{"1":{"tilte":"\n\t\t\tWatch two rehabbed sea lion pups return to the ocean in Palos Verdes\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/watch-two-rehabbed-sea-lion-pups-return-to-the-ocean-in-palos-verdes\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/TDB-L-RELEASE-0529-01-1.jpg?w=525","discription":"\nTwo sea lion pups were overjoyed recently when their caretakers at the Marine Mammal Care Center set them free in the ocean near Terranea Resort.\nAs soon as the doors to their cages opened, the pups skipped over the rocky shoreline of Rancho Palos Verdes straight to the water’s edge — then frolicked about in the surf for a moment before swimming out past the breakers, according to a video the resort posted on YouTube this week.\nTwo sea lion pups newly released by Marine Mammal Care Center near Terranea Resort in Rancho Palos Verdes play in the water. (Photo by Karen Schuenamann\/Terranea Resort)\n\nTwo sea lion pups newly released by Marine Mammal Care Center near Terranea Resort in Rancho Palos Verdes play in the water. (Photo by Karen Schuenamann\/Terranea Resort)\n\nCaretakers for Marine Mammal Care Center release two sea lion pups near Terranea Resort in Rancho Palos Verdes. (Photo by Karen Schuenamann\/Terranea)\n\nMarine Mammal Care Center President Amber Becerra stands by as two sea lion pups are released near Terranea Resort in Rancho Palos Verdes. (Photo by Karen Schuenemann\/Terranea)\n\n“What an exciting release,” Amber Becerra, president of Marine Mammal Care Center, said in the video. “They just bounced right out there into the ocean. They knew exactly where to go and what to do. They even gave each other a kiss on the way out.”\nThe young ones were separated from their mothers and emaciated when they were found earlier this year, one by the Marine Animal Rescue at the Redondo Beach Harbor Patrol Dock and another by the California Wildlife Center on a resident’s porch.\nThe Marine Mammal Care Center, which specializes in caring for sea lions, took the pups in and nursed them back to good health at the center’s rehab facility at Fort MacArthur in San Pedro.\nThe pups left the care center weighing twice as much as when they arrived\n“We are delighted to share this positive recovery as part of our ongoing mission to care for and protect Los Angeles marine life,” Becerra said.\nThe care center was founded in 1992 on the former site of Marineland of the Pacific, which closed in 1987; Terranea Resort is on the site now, and has partnered with the care center for more than 10 years.\n“We are committed to protecting and stewarding this unparalleled coastal setting,”  said Terranea Resort President Terri A. Haack, “and supporting the education of our visitors and guests to enhance awareness and encourage additional support for our partners in the community.”\nThe Marine Mammal Care Center has treated more than 8,000 animals at Fort MacArthur. The facility serves all injured or sick sea lions on the 70 miles of Los Angeles County beaches."},"2":{"tilte":"\n\t\t\tAs shutdowns lifts, what happens when wildlife exploring urban areas mix with humans return?\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/as-shutdowns-lifts-what-happens-when-wildlife-exploring-urban-areas-mix-with-humans-return\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/OCR-L-HBCOYOTE-0529-02-01-1.jpg?w=615","discription":"\nIt was an shocking sight as Huntington Beach resident Bob Daniel drove up Main Street after an early morning shooting video at the beach: A coyote strolling casually in downtown, an area typically busy with tourists and beachgoers just a few blocks from the Pacific Ocean.\nDaniel caught the moment on Wednesday, May 27, on camera as the coyote trotted past a stop sign, just across from Surf City Ale House.\n“I’ve seen plenty of coyotes here in H.B., but never one downtown,” he said. “This was unusual.”\nAs people have stayed home in recent months amid the coronavirus pandemic, wildlife has been exploring empty streets usually bustling with people. Reports of coyotes, in particular, have been spotted in once-popular streets of San Francisco to Chicago and beyond.\nBut as restrictions loosen up and more people are going outside, what will happen when the wildlife starts to mix with human’s return?\n“There’s not any more of the critters, but they are changing their behaviors,” said Eric Strauss, president’s professor of biology for Loyola Marymount University’s Center for Urban Resilience. “The wildlife in urban areas are always adjusting their behavior based on ours.”\nUrban wildlife, like coyotes, have become dependent on humans for food, finding scraps on the streets in the darkness or early morning hours, while most people sleep.\nDuring the coronavirus shutdown, “the abundant food resource got shut off in a matter of days. It changed the foraging dynamics, the risk analysis of what they should take in respect to searching for food,” Strauss said.\nAs people stayed indoors, our “center spots” were less used, allowing wildlife to expand their radius.\n“In almost every city, you’re reading some story about them walking in some area that had been historically dominated by humans,” Strauss said. “There’s no people, and there’s not as much food, so they are taking longer to search for food.\n“As we withdraw, more habitat becomes available for them to search for food,” he said. “Now they are showing up, there’s no people and no food. It takes longer to check out before they give up and go somewhere else.”\nPlus, people are at home looking out of their windows when they would otherwise be in offices focused instead on work and other distractions, Strauss noted.\nWhat we’re seeing during the coronavirus pandemic is “habitat fragmentation.”\n“When we back off a bit, we see them move into the new areas,” he said.\nWhen we move back outside, they will likely move away.\n“Some coyotes are getting bolder,” he said.\nIn Laguna Beach recently, authorities have been on the hunt for a coyote that bit a 91-year-old man who was picking up his newspaper in the driveway. Authorities \nRelocating a problem coyote is not an option because it only moves the problem to another neighborhood, California Department of Fish and Wildlife authorities say.\nStrauss and his students are working on a project that uses about 30 remote cameras set around Culver City, recording when movement, whether it be human or wildlife, is sensed. Thousands of photos are being generated a week, showing the exact time and place creatures are detected without interfering with their behavior.\n“What is their temporal use of land before the pandemic, through it and after?” Strauss wonders. “It will be very interesting to see.\n“I think what we are going to see we can tie into exact human events.”\nThe Huntington Beach coyote seemed to just be out for a stroll, as it trotted across Main Street and Olive Avenue, chasing a squirrel under a car, Daniel said.\n“He went around to the other side,” Daniel said, “and the squirrel got up a tree before the coyote could get breakfast.”"},"3":{"tilte":"\n\t\t\tSanta Clarita substitute teacher suspected of lewd acts with student arrested\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/santa-clarita-substitute-teacher-suspected-of-lewd-acts-with-student-arrested\/","img":"https:\/\/images.pexels.com\/photos\/518543\/pexels-photo-518543.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940","discription":"\nAuthorities arrested a Saugus High School substitute teacher suspected of having a sexual relationship with a female student, officials said Thursday, May 28.\nDavid Cornish, 28, was taken into custody Wednesday at his residence in the Santa Clarita, Los Angeles County Sheriff’s Department officials said in a news release. He was held in lieu of $100,000 bail, and booked on suspicion of lewd acts with a minor and oral copulation with a minor.\nInvestigators believe he had been involved in a sexual relationship with his student between April and May. Further details were not immediately released.\nCornish was immediately suspended from his position after the accusations against him came to light, said Dave Caldwell, a spokesman for the William S. Hart School District, said in a statement. The allegations against him will be reported to the California Commission on Teacher Credentialing.\n“The district strives to provide a safe educational environment for all of our students,” Caldwell said.\nDeputies have asked anyone who might be able to aid their investigation to contact the Los Angeles County Sheriff’s Department, Special Victims Bureau by calling 877-710-5273, or sending an email to specialvictimsbureau@lasd.org. Tips can also be left anonymously with Crime Stoppers at 800-222-TIPS (8477) or "},"4":{"tilte":"\n\t\t\tProtesters march Friday in Los Angeles, shut down 110 Freeway, amid growing anger nationwide over George Floyd’s death\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/protesters-march-again-friday-night-in-los-angeles-amid-growing-anger-nationwide-over-george-floyds-death\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-LA-PROTEST-009-0530-1.jpg?w=525","discription":"\nDuring a third night of protests in downtown Los Angeles on Friday, in angry response to the death of George Floyd, protesters clashed with police and shut down the 110 Freeway.\nWhat had begun as a group of about 70 protesters walking along streets and doing sit-ins at downtown intersections amid traffic devolved later in the evening into violent confrontations with police officers.\nA least two Los Angeles police officers were injured in skirmishes with protesters, officials said.\nPolice officers move forward to clear the street during a protest for George Floyd, in downtown Los Angeles, Friday, May 29, 2020. Protests continued following the death of George Floyd, who died after being restrained by Minneapolis police officers on Memorial Day. (AP Photo\/Ringo H.W. Chiu)\n\nTwo women lie on the street with signs during a protest over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nProtesters run through smoke as police officers start firing rubber bullets during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nProtesters block a street with signs during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA protester holds a sign advising social distancing in front of police officers during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA police officer yells to protesters to back up during a demonstration over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody on Memorial Day in Minneapolis. (AP Photo\/Jae C. Hong)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nCalifornia Highway Patrol officers prepare to open a shut down northbound CA-110 freeway by protestors protesting the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nBy 9:30 p.m., LAPD declared an unlawful assembly for all of downtown Los Angeles, ordering everyone in the streets to immediately leave the area and urging residents to stay inside and businesses to close.\nJust hours after prosecutors in Minneapolis criminally \nEarlier Friday, former Minneapolis police Officer Derek Chauvin, who is white, was charged with third-degree murder and manslaughter in the death of Floyd, who is black. Activists who filled downtown streets said the charges were not enough.\n“I can’t breathe means first-degree,” the original crowd of more than 70 demonstrators shouted while marching from Los Angeles City Hall and down along Spring Street, demanding harsher charges and broader reform.\nProtesters outside of Los Angeles City Hall , Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters make their way down, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nA man blocks traffic as he walks down the middle of Spring Street in Los Angeles, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters block Spring Street outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters on Spring Street outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nCas Hunter, Van Nuys, holds a sign during a protest outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters block Spring Street outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\n \nAs that crowd continued their march, employees of shuttered businesses applauded from behind metal blinds. Residents cheered from their apartment balconies. Cars passing by honked to the rhythm of the demonstrator’s chants.\nLos Angeles police officers on bikes rode in front of the marching group.\nDemonstrators occupied the intersection of Olympic Street and Figueroa Boulevard, halting traffic in the area. The group sat down and continued to hold signs, chanting Floyd’s name for several minutes before standing to continue their march.\nProtestors are staging a sit down in traffic at the Olympic and Figueroa intersection \n— Hunter Lee (@huntslee) \nLater in the evening, tensions rose as multiple groups took shape throughout downtown. Some protesters hurled glass bottles and other objects at police and officers responding by launching less-than-lethal rounds at crowds and shoving them back with riot shields.\nOther groups continued to sit on the pavement in quiet protest of police orders to disperse.\nAfter 7 p.m., dozens of protesters surged up Eighth Street and onto the 110 Freeway, halting traffic on north and southbound lanes until Olympic Boulevard, said California Highway Patrol Officer Elizabeth Kravig.\nCHP officers were able to disperse the crowds but within a half-hour a smaller group of protesters returned to the freeway, Kravig said. Television news broadcasts showed the marchers setting up a makeshift barricade in the northbound lanes.\nOne officer was injured by a flurry of protesters near Pershing Square on Fifth and Olive streets. The officer was transported to a local hospital in unknown condition, said LAPD Officer Drake Madison, spokesman for the department. A second officer was injured by a glass bottle thrown from a crowd that had gathered on 7th and Hope streets.\nProtesters confront police officers while blocking the 110 Freeway during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nProtesters chant while blocking an intersection during a protest over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA man walks past graffiti during a protest over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA demonstrator attacks a police car during a protest over the death of George Floyd in downtown Los Angeles, Friday, May 29, 2020. Floyd died in the custody of the Minneapolis police on Memorial Day. (AP Photo\/Ringo H.W. Chiu)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nPeople demonstrate in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\nProtesters sit in the street in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\nPolice officers hold their position as protesters march by in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\nProtesters clash with police officers in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\n“I saw people start climbing on the bus stop and then crowds start running from the street and some guy is getting thrown by cops,” said Torie Dunda who was among the crowd of protesters who witnessed the skirmish on Olive Street. LAPD had not confirmed any arrests.\nAs rows of police officers continued pushing forward, shooting less-than-lethal rounds at the crowds, people began to slowly disperse, but lingered in looser groups long after the unlawful assembly had been announced.\nProtesters left in their wake buildings and police vehicles with graffiti throughout downtown. “We can’t breathe,” read some of the painted messages, along with anti-police slogans. Trash cans were strewn across roads. Some of the cans were lit on fire. Television news broadcasts showed crowds breaking into a Starbucks on 6th and Spring streets, shattering windows and damaging property inside.\nThe previous two days were marked by less \nFriday’s arrest of former-Minnesota police Officer Chauvin did little to quell their demands.\nProtesters make their way down Spring St in LA \n— Hans Gutknecht (@HansGutknecht) \n“It’s not about this cop. It’s about upending the whole system that’s created this,” said Ryan Valdez, a Norwalk resident who was among protesters. “This isn’t going to stop with George Floyd just like it wasn’t going to stop with Eric Garner until we, the people, do something about it.”\nEarlier in the evening, while protesters pushed on throughout downtown streets, before the worst of the violence, Mayor Eric Garcetti acknowledged demonstrators efforts in his nightly speech. Garcetti said protester’s rights will be protected, but he urged protesters not to violate laws.\nHe said Floyd “was murdered in cold blood in front of this nation.”\n“I share your resolve to not only declare that black lives matter, but to make that statement real in our policies and our politics in our policing in our laws,” Garcetti said. “And most of all, in our hearts.”\nProtestors stand in front of traffic along Spring Street in front of city hall. \n— Hunter Lee (@huntslee) \nActivists have flooded recent discussions in City Council at Garcetti’s proposed budget, calling on city leaders to scale back the police department budget, one of the few areas that has been preserved and not seen the cuts that have ravaged other departments.\nThe protest Friday marked the third day of demonstrations in the city. On Wednesday, two protesters were injured during the mostly peaceful demonstration organized by Black Lives Matter Los Angeles.\nAs protesters spilled \nA second protester was struck by a car in a possible hit-and-run while hundreds of demonstrators crossed a street near the LAPD Headquarters.\nWhile protesters on Friday evening caused damage to some buildings and other property in downtown Los Angeles, the scene in Minneapolis, Minn. and the nearby St. Paul proved to be more volatile.\nProtesters set fire to the Minneapolis Police Department’s Third Precinct on Thursday evening, burning other buildings, damaging banks and apartments, and looting from various local businesses.\n— Hunter Lee (@huntslee) \nThe next morning, Minnesota Gov. Tim Walz offered a sympathetic statement to protesters.\n“Minneapolis and St. Paul are on fire. The fire is still smoldering in our streets. The ashes are symbolic of decades and generations of pain, of anguish unheard,” Walz said, adding. “Now generations of pain is manifesting itself in front of the world — and the world is watching.”\nMinneapolis Mayor Jacob Frey said he understood the anger and pain, but added that the looting was unacceptable. The National Guard was called to the city help prevent further looting. Protesters in Minneapolis continued to call on authorities to bring charges against the other officers involved in Floyd’s arrest.\nChauvin was one of four officers fired this week after the lethal encounter with Floyd. The other three former Minneapolis police officers are still under investigation.\nEarlier in the evening in Los Angeles, protesters had spoke against the violence as several protesters began to agitate officers.\n“This isn’t what we’re here for, violence,” said Miss Rodriguez of Los Angeles. “We’re here for peace because that’s what George would want.”\nHundreds of protesters also took to the streets in Rancho Cucamonga "},"5":{"tilte":"\n\t\t\tEnglander hearing to plead guilty to obstructing corruption probe rescheduled to July 7\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/englander-hearing-to-plead-guilty-to-obstructing-corruption-probe-rescheduled-to-july-7\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-ENGLANDER-HEARING-0313-DC-8-1.jpg?w=527","discription":"\nA federal court hearing in which former Los Angeles City Councilman Mitchell Englander was expected to plead guilty to obstructing a public corruptions investigation has been postponed to July 7.\nIn March, Englander pleaded \nFederal prosecutors accuse Englander of urging a business associate who was to be interviewed by FBI investigators to lie about his acceptance of cash and gifts — which included a hotel stay, expensive dinner and escort services — during a 2017 Las Vegas trip.\nEnglander’s attorneys said they needed more time to “consider the ‘materiality’ standard” in the case. Federal prosecutors had not opposed the request for the continuance of the June 4 hearing, although their position was that the facts do meet that standard.\nEnglander’s case is part of a federal investigation into “pay-to-play” corruption that broke into the open when the FBI raided the office and home of Councilman Jose Huizar in late 2018.\nThree others, including a former city commissioner and a Granada Hills business consultant, are set to plead guilty on counts related to the probe.\nGeorge Esparza, a former aide to Huizar, was the latest to agree to plead guilty to one count of conspiring to violate the Racketeer Influenced and Corrupt Organization statute. In his plea agreement, he admitted to participating in a criminal enterprise led by a former boss, a council member who was the chair of the council’s Planning and Land Use Management Committee.\nHuizar has not been charged with any crime. But with indications that he is likely the unnamed council member who was the ringleader of the alleged criminal enterprise described in federal court filings, several fellow council members, as well as Mayor Eric Garcetti, have now called for his immediate resignation."},"6":{"tilte":"\n\t\t\tMusic Center’s Spotlight Grand Finale with 14 teen finalists goes online Saturday\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/music-centers-spotlight-grand-finale-with-14-teen-finalists-goes-online-saturday\/","img":"https:\/\/i2.wp.com\/scng-dash.digitalfirstmedia.com\/wp-content\/uploads\/2020\/05\/Spotlight-Finalist-c-16x9may2020.jpg?fit=620%2C9999px&ssl=1","discription":"\n \nTalented teen finalists in the Music Center’s Spotlight program learned early on how entertainers need to be ready for challenges and changes. Their highly anticipated grand finale show is going online on Saturday, May 30 — but not on stage at the Music Center in downtown Los Angles.\nEarlier this year, due to coronavirus Safer at Home restrictions, the teens got a taste of the proverbial the-show-must-go-on when for their final round of auditions they had to submit an online video instead of performing an in-person audition.\nThe Music Center Spotlight Grand Finale will air online 7 p.m. Saturday, May 30 at \nTheir journey in the arts training and scholarship program began last September when nearly 1,400 teens from more than 260 schools in eight counties auditioned for a chance to be a part of the year-long program that includes extensive mentoring.\nThe arts categories include acting, ballet and non-classical dance, classical and non-classical voice and classical and jazz instrumental. The program, founded in 1988, has enabled 49,000 students to not only hone their performing skills but also gain work readiness skills and learn about careers in arts management.\nAll of this year’s applicants were able to attend the Spotlight Academy, a free, day-long series of seminars and workshops taught by professionals and arts educators. The teens then progressed through three rounds of auditions and attended master classes with one-on-one coaching.\nThe 14 students who made it through the auditions are each receiving $5,000 scholarships. Spotlight chooses two students per category.\nThe 2020 Spotlight finalists\nSpotlight also awarded the following students with Honorable Mention and a $1,000 scholarship award\nFor information on the Spotlight program and how to apply: \nThe Spotlight Grand Finale show is hosted by Tony Award winner and Spotlight alumna Lindsay Mendez (Broadway actress-singer) with special appearances by more Spotlight alumni including Misty Copeland (American Ballet Theatre), Josh Groban (singer-songwriter and actor), Matthew Rushing (associate artistic director with Alvin Ailey American Dance Theater) and Melinda Sullivan (dancer-choreographer).\nHow to watch the Music Center Spotlight Grand Finale: 7 p.m. Saturday, May 30 online at \n "},"7":{"tilte":"\n\t\t\tLos Angeles real estate firm sues Realtors over pocket listing ban\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/la-real-estate-service-sues-realtors-over-pocket-listing-ban\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/OCR-L-Real-MLS-1117-1-3.jpg?w=525","discription":"\nThe National Association of Realtors has been sued for a second time in two weeks over its \nThe lawsuit, filed in Los Angeles federal court on Thursday, May 28, also names as defendants three Realtor-affiliated multiple listing services, including the Chino Hills-based California Regional Multiple Listing Service, the nation’s largest Realtor listing database.\nPocket listings are homes sold privately outside the quasi-public multiple listing service, which shares data with real estate websites like Realtor.com, Zillow and Redfin.\nThe lawsuit, filed by The PLS.com of Los Angeles, takes aim at a NAR’s “clear cooperation policy,” effective May 1, which requires real estate agents to input a home into a Realtor-affiliated MLS within one business day after they start marketing it for sale.\nThe PLS.com, which started as Pocket Listing Service, claims to have nearly 20,000 members.\n“The surge in consumer demand for pocket listings … was a competitive threat to the viability of the NAR-affiliated MLS system,” the lawsuit states. “These market changes also threatened NAR’s ability to control competition in the residential real estate brokerage.”\nThe lawsuit comes just two weeks after the \nNAR officials couldn’t be reached for comment, and the head of the California Regional MLS said his group still is assessing the lawsuit.\nBut in response to the earlier Top Agent Network suit, NAR issued a statement saying there’s no legal basis for the claim.\nThe pocket listing ban “ensures greater transparency and competition,” the statement by NAR Communications Vice President Mantill Williams said.\n“Cooperation with other MLS participants is in (a) client’s interests and enables the listing to be shared with the widest group of potential buyers,” the statement said.\nSupporters of the ban attending NAR’s convention last November, when the new policy was adopted, argued pocket listings exclude buyers and agents from bidding on desirable properties. In addition, they argued, pocket listings allow discrimination against racial and ethnic minorities or are used by sellers’ agents to cut buyer agents out of a deal, hogging the whole commission.\nBoth the Top Agent Network and PLS.com have private databases agents can use to search for buyers or properties for sale. But unlike the MLS’s, those posts aren’t publicly available outside the network.\nPrivate marketing allows celebrities and the wealthy to maintain privacy while selling luxury homes or allow clients to test the market without the stigma of listing and then delisting a property in the MLS, advocates say.\n“Demand for pocket listing services has skyrocketed in recent years, particularly in large and competitive real estate markets such as Los Angeles, San Francisco, Miami, and Washington, D.C.,” the PLS.com lawsuit says. “In some of these markets, 20 percent or more of residential real estate was being sold outside the NAR-affiliated MLS system, primarily as pocket listings.”\nThe California Regional MLS has more than 100,000 members, covering all of Orange County and portions of Los Angeles, Riverside, San Bernardino and San Diego counties. It also serves communities in Central and Northern California, going as far north as Red Bluff, located between Chico and Redding.\nAgents violating the pocket listing policy in the California Regional MLS territory face fines of 1% of the home’s purchase price up to a maximum of $2,500. Violations in San Francisco can fetch fines of $5,000 for the first violation, the Top Agent Network lawsuit said.\nThe PLS.com suit seeks an injunction against the pocket listing ban and unspecified monetary damages."},"8":{"tilte":"\n\t\t\t186 new coronavirus cases and 8 deaths in the San Fernando Valley in 24 hours\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/186-new-coronavirus-cases-and-8-deaths-in-the-san-fernando-valley-in-24-hours\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-BOB-RESTAURANT-0528-DC-1-1.jpg?w=525","discription":"\nAs of Tuesday May 26, 2020, there were 8,730 documented cases of the novel coronavirus in San Fernando Valley communities, according to the \nThere have been 412 total COVID-19 deaths recorded in the core areas of the San Fernando Valley, where 87,155 people have been tested for the virus.\nBetween 8 p.m. Monday and Tuesday, there were 186 new cases and 8 deaths in San Fernando Valley communities.\nThe Valley communities with the most overall cases of COVID-19 are Sylmar with 749, Panorama City with 693, and Pacoima and Van Nuys with 664 each.\n \nOutside of the San Fernando Valley, the Agoura and Calabasas area has a total of 100 cases and 7 deaths.\nThe Burbank-Glendale area, including La Canada Flintridge, has 1,424 cases and 122 deaths.\nThe Santa Clarita and Antelope Valley areas, including Canyon Country and Castaic, have 2,525 cases and 57 deaths.\nThere could be more cases in any of these areas. The county is still investigating 1,940 possible COVID-19 cases and hasn’t yet released information on where those patients live in the county.\nAnd due to the limited availability of COVID-19 tests, officials have said there are many more people infected with the novel coronavirus than are represented in these numbers.\nAs of 8 p.m. Tuesday across Los Angeles County, the health departments of LA County and the cities of Pasadena and Long Beach have recorded 48,778 confirmed cases of COVID-19, the disease caused by the novel coronavirus.\nOf the 48,778 patients with positive COVID-19 tests, 6,283 have been hospitalized.\nThere have been 2,201 deaths in the county due to the virus.\nBetween Monday and Tuesday, there were 903 new cases and 56 deaths across LA County.\nThe county’s data is released in the afternoon and covers the period of time ending at 8 p.m. the previous day.\nTotals for Long Beach and Pasadena are provided by those cities’ public health departments.\nCommunity-level data from Los Angeles County includes the number of positive cases, deaths and COVID-19 tests administered along with percentages of the area’s population for each.\nCases and deaths are added to the totals based on when they are confirmed, not necessarily when the illness began or the death occurred.\nRates of infection, death and testing that are provided by LA County are age-adjusted to account for differences in the distribution of age in the underlying population, said county officials. The adjusted rates are useful for comparing rates between cities and communities that have different age distributions.\nFor complete totals, check the health department’s coronavirus location page at \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n "},"9":{"tilte":"\n\t\t\tLA panel approves stadium proposed for Warner Center\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/la-panel-approves-stadium-proposed-for-warner-center\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/Promenade-2-1.jpg?w=620","discription":"\nAs stadiums and entertainment venues sit idle across Los Angeles amid the global pandemic, French developer Unibail-Rodamco-Westfield has moved closer to bringing a sports center to Warner Center.\nThe City Planning Commission unanimously approved on Thursday, May 28, the Promenade 2035 project, featuring a 7,500-seat sports and entertainment venue with a partial roof or an enclosed 10,000-seat arena.\nThe approval came with some conditions, including that the developer would need to come back if it decides to modify the proposed plan.\nThe $1.5 billion project would spread across a 34-acre site. It calls for the construction of an urban district with nearly 1,400 residential units, 280,000 square feet of shops and restaurants, 731,500 square feet of office space and 572 hotel rooms.\nDuring a virtual meeting hosted by the City Planning Commission hearing on the Promenade 2035 mega-development, hundreds of participants dialed in to wave on the controversial development.\nThe hearing comes months after city planners recommended a fully enclosed 7,500-seat arena as part of the massive development proposed for Woodland Hills that was half the capacity of the originally proposed 15,000-seat stadium. The proposal triggered several appeals regarding the lack of affordable housing, the size of the stadium and air quality.\nDevelopers said the project represents over $1 billion in long-term investment in Warner Center, creating more than 10,800 construction jobs and over 9,700 permanent jobs upon completion.\nUnibail-Rodamco-Westfield agreed to modify their proposal, offering a smaller sports and entertainment center along with rent-restricted affordable housing.\nThe stadium, the developer said, will be a catalyst for economic growth, attracting further investment in the Warner Center area. It will include a dedicated space for cultural programming and also provide a gathering place for community events such as high school and college graduations and various cultural events.\n“We’re tired of transporting over the hill” to see events,” said Larry Green, executive vice president-development at Unibail-Rodamco-Westfield.\nIn response to community feedback, the developer agreed to redesign the venue, reducing its square footage from 320,000 square feet to 181,550 square feet and its height from 155 feet to approximately 85 feet. The venue will be encircled with landscaping, trees, open space and pedestrian paths.\nBut opponents fear the venue will attract rowdy crowds and fill up the 101 Freeway with cars.\nWest Hills resident Christine Rowe said she was “absolutely” opposed to the stadium.\n“I’m disgusted with the new arena,” she said.\nSupporters said they approved the 10,000-people facility, smaller than downtown’s Staples Center, that they hope will bring construction jobs and attract entertainment events in years ahead.\nThe updated plan includes a commitment for a total of 15% of the project’s initial residential units to be affordable, workforce and stakeholder housing divided into:\nGina K. Thornburg, executive director of Coalition for Valley Neighborhoods criticized the plan for not proposing to build more affordable units, demanding that the developer build 7.5% of the 1,009 units, to be preserved in perpetuity for the very low-Income residents.\nWoodland Hills Homeowners Organization president John Walker said his office supported the modified project.\n“We’re encouraged that they’re making some major modifications that increase the benefits to the community and mitigating the negative impacts on them, especially with the downsize of the arena,” Walker said."},"10":{"tilte":"\n\t\t\tSword-wielding suspect fatally shot by police in North Hollywood\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/27\/sword-wielding-suspect-fatally-shot-by-police-in-north-hollywood-authorities-say\/","img":"https:\/\/images.pexels.com\/photos\/518543\/pexels-photo-518543.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940","discription":"\nPolice fatally shot a person involved in a dispute with a neighbor and armed with a bladed weapon in North Hollywood on Wednesday, May 27, authorities said.\nOfficers were dispatched to reports of a “neighbor dispute” on the 6400 block of Elmer Ave., said Officer Tony Im, a spokesman for the Los Angeles Police Department. Responding officers encountered a male suspect armed with a “sword-type” weapon, LAPD officials said.\nLos Angeles police are on the scene Wednesday, May 27, 2020, of an officer-involved shooting at Victory Boulevard and Elmer Avenue in North Hollywood. A man reportedly brandishing a sword-type weapon was shot to death by LAPD officers. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nLos Angeles police are on the scene Wednesday, May 27, 2020, of an officer-involved shooting at Victory Boulevard and Elmer Avenue in North Hollywood. A man reportedly brandishing a sword-type weapon was shot to death by LAPD officers. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nLos Angeles police are on the scene Wednesday, May 27, 2020, of an officer-involved shooting at Victory Boulevard and Elmer Avenue in North Hollywood. A man reportedly brandishing a sword-type weapon was shot to death by LAPD officers. (Photo by Mike Meadows\/Special to the Los Angeles Daily News)\n\nThe suspect was struck by gunfire and taken into custody. LA City Fire Department responded and pronounced the suspect deceased. The suspect’s weapon was secured at scene and no officers were injured. This is preliminary info, while a thorough investigation is being conducted.\n— LAPD HQ (@LAPDHQ) \nAn officer-involved shooting ensued, police said. The suspect was wounded, fell to the ground, and was taken into custody. Los Angeles Fire Department paramedics arrived and pronounced him dead before he could be taken to a hospital.\nThe weapon involved in the incident was secured by authorities. No police or bystanders were hurt during the encounter.\nThe incident drew a large response from police, who blocked off a portion of the residential neighborhood where the disturbance and shooting had taken place. At least 10 officers were seen participating in an investigation in photos taken at the scene.\nAerial footage broadcast by Fox 11 Los Angeles showed at least a dozen police vehicles gathered at the intersection of Elmer and Victory Boulevard while officers closer to the site of the shooting laid a white tarp in the street."},"11":{"tilte":"\n\t\t\t194 new coronavirus cases and 6 deaths in the San Fernando Valley in 24 hours\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/27\/194-new-coronavirus-cases-and-6-deaths-in-the-san-fernando-valley-in-24-hours\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-VIRUS-RESTAURANT-008-0527-2.jpg?w=525","discription":"\nAs of Monday May 25, 2020, there were at least 8,544 documented cases of the novel coronavirus in San Fernando Valley communities, according to the \nThere have been 404 total COVID-19 deaths recorded in the core areas of the San Fernando Valley, where 86,555 people have been tested for the virus.\nBetween 8 p.m. Sunday and Monday, there were 194 new cases and 6 deaths in San Fernando Valley communities.\nThe Valley communities with the most overall cases of COVID-19 are Sylmar with 730, Panorama City with 670, and Van Nuys with 651.\n \nOutside of the San Fernando Valley, the Agoura and Calabasas area has a total of 99 cases and 5 deaths.\nThe Burbank-Glendale area, including La Canada Flintridge, has 1,411 cases and 123 deaths.\nThe Santa Clarita and Antelope Valley areas, including Canyon Country and Castaic, have 2,496 cases and 53 deaths.\nThere could be more cases in any of these areas. The county is still investigating 1,991 possible COVID-19 cases and hasn’t yet released information on where those patients live in the county.\nAnd due to the limited availability of COVID-19 tests, officials have said there are many more people infected with the novel coronavirus than are represented in these numbers.\nAs of 8 p.m. Monday across Los Angeles County, the health departments of LA County and the cities of Pasadena and Long Beach have recorded 47,875 confirmed cases of COVID-19, the disease caused by the novel coronavirus.\nOf the 47,875 patients with positive COVID-19 tests, 6,195 have been hospitalized.\nThere have been 2,145 deaths in the county due to the virus.\nBetween Sunday and Monday, there were 1,852 new cases and 29 deaths across LA County.\nThe county’s data is released in the afternoon and covers the period of time ending at 8 p.m. the previous day.\nTotals for Long Beach and Pasadena are provided by those cities’ public health departments.\nCommunity-level data from Los Angeles County includes the number of positive cases, deaths and COVID-19 tests administered along with percentages of the area’s population for each.\nRates of infection, death and testing that are provided by LA County are age-adjusted to account for differences in the distribution of age in the underlying population, said county officials. The adjusted rates are useful for comparing rates between cities and communities that have different age distributions.\nFor complete totals, check the health department’s coronavirus location page at \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n "},"12":{"tilte":"\n\t\t\tPedestrian killed in hit-and-run in Pacoima\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/23\/pedestrian-killed-in-hit-and-run-in-pacoima\/","img":"https:\/\/images.pexels.com\/photos\/518543\/pexels-photo-518543.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940","discription":"\nPACOIMA — A 54-year-old pedestrian died when he was struck by a vehicle in Pacoima, authorities said Saturday.\nThe crash was reported at 9:30 p.m. Friday in an alley east of Remick Avenue north of Osborne Street, said Los Angeles police Officer Rosario Cervantes.\nThe driver of the vehicle left the scene without stopping to render assistance, Cervantes said.\nThe victim was pronounced dead at the scene, she said. His name was withheld pending notification of relatives.\nA reward of up to $50,000 is available to anyone who provides information leading to the identification, apprehension and conviction of hit- and-run motorists or resolution through civil compromise. Anyone with information should call detectives at the LAPD’s Valley Traffic Division at 818- 644-8000."}}