{"1":{"tilte":"\n\t\t\tWatchdog group opposes bill that would hike insurance rates in fire-prone areas\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/05\/watchdog-group-opposes-bill-that-would-hike-insurance-rates-in-fire-prone-areas\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/California_Wildfires_92490-1.jpg?w=525","discription":"\nA bill that would allow California insurance companies to boost homeowners’ insurance rates in regions prone to wildfires will price people out of the market, a watchdog group says.\nConsumer Watchdog contends \nHarvey Rosenfield, who authored Prop. 103, said AB 2167 “rocketed” out of the Assembly Appropriation’s Committee on Wednesday and is being fast-tracked for the Assembly floor next week amid the pandemic, the collapse of the economy and widespread protests against police brutality.\n“After years of trying — only to get called out by the news media — this time the insurance industry might well succeed in getting deregulation through the Legislature if the politicians think no one is watching,” he said.\nIn a letter sent to Lorena Gonzalez, D-San Diego, chairwomen of the Assembly Appropriations Committee, Los Angeles-based Consumer Watchdog said AB 2167 is “an impermissible attack on Proposition 103 cloaked in proclamations about climate change and wildfires.”\nEnacted by California voters in 1988, Prop. 103 was designed to protect consumers from price gouging. It requires that insurance companies get prior approval from the California Department of Insurance before boosting property and casualty rates.\n“The insurance industry has provided no evidence that the regulatory structure created by the voters is not working, or any justification for replacing it with the costly multi-tiered, new bureaucracy created by AB 2167 and its companion bill, SB 292,” Consumer Watchdog’s letter states.\nSenate Bill 292, authored by state Sen. Susan Rubio, D-Baldwin Park, establishes formulas to determine which counties are eligible for an “insurance market action plan,” which would allow insurers to cut through some of the red tape involved in hiking rates.\nDaly said many insurers have re-evaluated their exposure to fire risk, and therefore, reduced the number of policies they provide in high-risk areas. That has resulted in a painful process for many homeowners, he said, who have had to seek coverage through other insurers, often paying more.\n“Too many homeowners in California are suffering the consequences of insufficient competition in the insurance market,” Daly said in a statement. “This bill will bring more insurers back to the market and give consumers more options to choose from.”\nDaly said it will help stop the cycle of non-renewals and ease the minds of homeowners who are afraid to open the mail.\nAB 2167, Consumer Watchdog’s letter states, would allow insurance companies to raise homeowners’ insurance rates at a time when they can least afford it.\nOrdinarily, the bill would be headed to a second policy committee in the Assembly since it’s an amendment to Prop. 103, Rosenfield said, but the process of double-referring bills has stopped amid the COVID-19 pandemic.\nIf the legislation clears the Assembly floor it will go next to the Senate Insurance Committee.\n“The voters passed Prop. 103 because the state Legislature was beholden to the insurance industry,” Rosenfield said. “Thirty years later the insurance industry is trying to buy its way out of what voters mandated.”"},"2":{"tilte":"\n\t\t\tCoronavirus rebound: Southern California pending home sales up for 6 straight weeks\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/05\/coronavirus-rebound-socal-pending-home-sales-up-for-6-straight-weeks\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/SoCal-homebuying-rebounds-1.png?w=566","discription":"\nSouthern California house hunters signed 8% more sales contracts in late May, according to a tally by Zillow.\nA weekly report on activity from brokers’ listing services in Los Angeles, Orange, Riverside and San Bernardino counties shows existing homes went into escrow at a weekly rate of 3,241 for the seven days ended May 30. It was the sixth straight week of gains after seven \nFinding homes to buy is a challenge. Southern California owners listed homes for sale at a weekly rate of 4,137 — down 8.9% vs. the previous week; and down 21.8% in a year. That put total inventory at 24,079 existing residences — down 0.7% vs. the previous week, and down 29.6% in a year.\nThe local housing market has been rebounding from economic turmoil created by “stay at home” orders designed to slow the coronavirus pandemic’s spread. Fewer restrictions on business, including home sales, plus low mortgage rates are putting owners and house hunters in a selling mood.\nBut even after a significant run-up of late, activity is still largely below year-ago levels.\nHow the data broke down in Los Angeles and Orange counties …\n 1,799 contracts signed — up 12.8% in a week; up 55% in a month; down 17.1% over 12 months.\n 2,562 over seven days — down 9.1% vs. the previous week; up 13.3% in a month; down 22.4% in a year.\n 14,382 homes on the market — up 1% in a week; up 8.9% in a month; down 28% over 12 months.\n $897,411 — up 0.9% vs. the previous week; up 3.9% in a month; up 7.7% in a year.\nIn the Inland Empire …\n 1,442 — up 2.6% in a week; up 34.1% in a month; up 1.6% over 12 months.\n 1,575 — down 8.5% vs. the previous week; up 7.7% in a month; down 20.7% in a year.\n 9,697 — down 3.1% in a week; down 8.5% in a month; down 31.9% over 12 months.\n $431,676 — up 0.7% vs. the previous week; up 1.7% in a month; up 2.8% in a year.\nNationally …\n 73,458 — down 5.2% in a week; up 24.5% in a month; up 2.7% over 12 months.\n 118,615 — down 7.2% vs. the previous week; up 19.3% in a month; down 17.2% in a year.\n 918,511 — down 1.4% in a week; down 7.1% in a month; down 24.9% over 12 months.\n $329,941 — up 0.3% vs. the previous week; up 3.2% in a month; up 3.1% in a year."},"3":{"tilte":"\n\t\t\tCOVID-19 claims: More than 5,000 Californians file for workers’ comp\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/05\/covid-19-claims-more-than-5000-californians-file-for-workers-comp\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/OCR-Z-COVID-CLAIMS-1.jpg?w=525","discription":"\nCalifornians stricken with COVID-19 took the first step in filing more than 5,000 workers’ compensation claims from January through May, according to state data released to CalMatters.\nMore than 1,000 of those claims were denied, most of them before Gov. Gavin Newsom signed a May 6 executive order extending protections for essential workers infected on the job on or after March 19, the day California’s lockdown order went into effect. The order presumes that essential workers — including nurses, first responders, farmworkers and grocery workers who contracted COVID-19 — were infected on the job, and puts the burden on employers to prove otherwise.\nAt the same time, overall workers’ compensation claims plummeted during California’s lockdown as workplaces shut down and fewer employees were injured at work. Only 1,098 claims were filed in May, compared with more than 50,000 in January.\nWhile a number of states have extended similar “presumptive eligibility” protections to varying groups of workers – mostly health care workers and first responders – California goes further than many in protecting all essential workers.\nLabor groups praised the executive order as protecting workers from a disease that can have severe and lingering effects, while the Chamber of Commerce and other business groups decried it as too expensive for the states’ employers, many already reeling from the state lockdown and economic downturn.\nAs of Tuesday, more than 10,000 health care workers have been diagnosed with COVID-19; 63 have died. More than half worked in nursing homes.\nThe new claims data lands as the state’s cases climbed past 119,000 and California Attorney General Xavier Becerra joined 11 other state attorneys general Tuesday in a letter calling on Walmart to better protect its workers and the public from COVID-19. The retailer has been criticized for inadequate sick leave policies and failing to properly sanitize its stores.\nIt was not clear Wednesday whether Walmart employees in California have filed COVID-related workers comp claims; the state’s workers’ compensation agency does not make most individual claim details public.\nAnalysts originally estimated that California employers and their insurers might face COVID claims of up to $33.6 billion annually but later downgraded that to about $2 billion.\nCOVID-related claims were denied at a rate of 10 to 60 percent depending on the month. In April, about 13 percent of claims were denied. Under Newsom’s executive order, essential workers, such as nurses or first responders, have to show that they were infected within a certain period after the statewide shutdown began; they also had to be diagnosed by a physician.\nGreg Gomez, a Sacramento-based attorney for the Ratto workers’ compensation law firm, said the order has helped his client, a certified nurse assistant who believes he was infected after helping a resident in the senior home where he worked. The Sacramento worker’s case has not yet been decided, Gomez said.\nThe order “made it a level playing field for people who contract COVID-19 at work,” Gomez said, noting that it has traditionally been difficult for workers to prove they contracted a communicable disease at work rather than out in the community.\nGomez advised essential workers who think they were infected on the job to immediately report it to their employers should they choose to file a claim later. “COVID-19 is such a new disease that some effects aren’t known for weeks afterwards,” Gomez said.\nAlex Swedlow, president of the California Workers’ Compensation Institute, a think tank largely funded by workers’ comp insurers and self-insured employers, said that even before Newsom’s order took effect, the majority of COVID claims were approved.\nThe shortage of diagnostic tests — a significant problem for workers in March and April, when most of the claims were filed — may have contributed to some of the denials, Swedlow said. Other workers may have been denied because they tested negative at a time when some COVID-19 tests have produced false negatives.\nAn Institute report released earlier this month found that about 41 percent of workers’ comp claims were made by health workers, with another 32 percent by first responders including police and firefighters. Some workers were denied because they worked at home; others because they declined to be tested, according to the report.\nSwedlow anticipates that denials may decline as workers get more access to testing and California’s workers’ comp system – created more than a century ago to deal with industrial injuries like broken bones –  adjusts to dealing with an entirely new disease.\nSteve Appell, who manages a workers’ compensation law firm in Van Nuys and represents workers at their hearings, said that even employees whose COVID claims have been denied may get a second chance because of existing legal precedents.\n“These denials would probably be overturned should they go to court,” Appell said."},"4":{"tilte":"\n\t\t\tResidential tower proposed for Warner Center is facing appeals\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/06\/residential-tower-proposed-for-warner-center-is-facing-appeals\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/LDN-L-TOWERS-0828-01-1.jpg?w=566","discription":"\nA project that proposed the construction of a 34-story apartment tower with 650 units is facing two appeals.\nThe project proposed for 6400 N. Canoga Ave. calls for the demolition of an existing office building along with the leveling of a two-level parking garage. The development will contain a residential building with 650 studio, one-, two-, and three-bedroom apartments, the 743,456 square-foot mixed-use building with dwelling units along with restaurants, shops and offices. In addition, a parking lot will stretch across 204,278 square feet with an automated garage. The project also includes 365 bicycle parking spaces.\nLocated near the Metro Orange Line Canoga station, the project is designed by architect firm Hetzel Design. \nSubmitted by the Southwest Regional Council of Carpenters, one of the appeals argued that the project is non-compliant with the Warner Center 2035 Specific Plan, which provides a blueprint for redevelopment for Warner Center bounded by the Los Angeles River, the 101 Freeway to the south, De Soto Avenue to the east, and Topanga Canyon Boulevard on the west.\nAnother appeal filed by \nThe project is among several major developments proposed for Warner Centre. The City Planning Commission approved the Promenade 2035 project featuring a sports and entertainment venue.\nThe $1.5 billion project will stretch across a 34-acre site. It calls for the construction of an urban district with nearly 1,400 residential units, 280,000 square feet of shops and restaurants, 731,500 square feet of office space and 572 hotel rooms."},"5":{"tilte":"\n\t\t\tLosing your mind, stuck at home? Here’s how to find some sanity in the chaos\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/06\/losing-your-mind-stuck-at-home-heres-how-to-find-some-sanity-in-the-chaos\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/RPE-L-WOMENBIZ-0607-1.jpg?w=620","discription":"\nWe, the writers of Women, Money & Mindset, agree that in order to make and manage money, you must adopt the right mindset. This means incorporating thoughts, attitudes and behaviors that support a healthy financial life.\nThe same rings true for all other areas of our lives.\nThis spring has challenged us with devastating events that have completely upended the way we conduct our work, relationships and our lives. These events have asked us to flex and pivot mentally, emotionally, and physically in ways that few of us have ever been called to do.\nMany are experiencing what we would describe as an emotional shutdown. This is affecting the way we are able to go about our daily business and activities. When what is happening outside of us becomes too much for our own experience, we have a defense mechanism that protects us. This defense mechanism impels the mind to go into fight-or-flight mode. It’s as if the mind says, “Enough! I cannot assimilate all this at once. I am taking a brain break!”\nThat’s when we find it hard to focus or to think clearly. We may find it difficult to perform even the simplest of tasks. If you find yourself in such a state, it’s time to take some steps for radical self-care so that you can lower stress and give your brain the space it deserves to regroup.\nHere are some basic steps to regain a personal sense of calm and control when the world seems to be falling apart.\nRoutines and rituals provide predictability, which lowers stress and gives us a sense of control. Heed to your normal rituals, such as how you make the bed and conduct your morning quiet time. This reinforces a sense of normalcy.\nKeep a regular schedule, whether with work or other activities.\nIdentify three things you want to accomplish each day and schedule them. Break down projects into bite-sized tasks and congratulate yourself on completing each step, one step at a time.\nAvoid judging yourself on what you aren’t accomplishing. These are unusual times. Instead, delight in congratulating yourself on small wins. Practice self-compassion.\nInstead of telling yourself to “get a stiff upper lip” when things seem difficult, acknowledge that things are really difficult right now. Ask yourself how you can care and comfort yourself in these moments.\nIn short, treat yourself as you would (hopefully!) treat others in the same situation.\nWrite a handwritten note saying you are thinking about someone and send it to them. Make a phone call to see how others are doing. Order an anonymous grocery delivery to someone you know has lost their job or suffered financial hardship.\nWhile making a difference to others, this also reinforces to you the ability to make a difference. It also activates endorphins and good thoughts in you, helping to calm and regulate the nervous system.\nIf you obsess over the news and social media, you are feeding stress and anxiety. Avoid opening “doom and gloom” YouTube videos and negative viral messages passed on by well-meaning friends and family members.\nAsk yourself what you responsibly need to know to keep up to date with current events, and then identify a dependable source for this. Decide to check this once daily. Balance this with sites that remind us that good things are happening in the world.\nTwo sources I enjoy are “The Good News Network” website and John Krasinski’s “Some Good News” on YouTube.\nThe way we are able to operate right now has been minimized and redirected. We can easily feel defeated. So many things we counted on in times past are no longer available to us. This can cause turmoil and frustration.\nBegin to identify the things you can control, and as you encounter limitations, congratulate yourself on learning any workarounds or other ways of accomplishing. Moving through this tumult requires that we flex and pivot.\nReplace phrases such as, “I can’t because…” with “How can I?” or “What else might I do instead?”\nMoving away from undue stress and feelings of being overwhelmed to more focus and clarity requires practice. This requires that we intentionally take small steps in practice each day if we are to be successful.\nAs each of us asks ourselves how we should respond to current events, it will be important to show up as our best selves by cultivating the right mindset in order to make the greatest difference."},"6":{"tilte":"\n\t\t\tCoronavirus rebound: SoCal housing jumps up from ‘worst’ April\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/07\/coronavirus-rebound-socal-housing-jump-up-from-worst-april\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/California-home-purchase-loan-applications-2-1.png?w=566","discription":"\nThe region’s housing markets are rebounding off what arguably was the worst April in the history books.\nWhen coronavirus-related “stay at home” orders began throttling the economy in March, house hunting dramatically slowed, and closing a deal became troublesome. It was the slowest April for sales in the six-county Southern California region — down 31% in a year — in CoreLogic’s 32 years of recording real estate data.\nBut since mid-to-late April, as business limitations were eased, homebuying has perked up. Low mortgage rates, fewer house-hunting restrictions, and reinvigorated consumer confidence got owners to place more homes on the market and got house hunters in a buying mood.\nVarious metrics show a sharp bounce off recent lows leaving local homebuying close to the pace of 2019.\nMore Southern California house hunters are signing sales contracts.\nIn Los Angeles and Orange counties, pending sales — or escrows — of existing homes jumped sharply as of May 23, up 66.7% from a month ago — the fifth-largest gain among 27 big U.S. markets studied by Zillow’s study of brokers’ listings services. Still, escrows are off 31% from a year ago.\nNewly listed properties in the two counties are up 28.5% in a month, but total inventory is 29% below that of a year earlier.\nIn Riverside and San Bernardino counties, pending sales rose 60% from a month ago — the sixth-largest gain among 27 big markets. Escrows are now down only 2.7% from last year.\nThe Inland Empire’s new listings rose 12.5% in a month, but inventory is 29.6% below last year.\nCalifornians are applying for more home loans.\nIn the week of May 29, California applications ran 5.5% above the year-ago level, according to the Mortgage Bankers Association. It’s the first time above 2019’s pace since March, and it’s a stark change from the week ending April 10, when applications were 49% below a year ago.\nSince the recent bottom for mortgage-making, my trusty spreadsheet shows applications in California are running at a 67% faster pace than nine weeks ago. This push means homebuyers are seeking mortgages at a pace that’s 93% of the first week of March.\nIn March, Emile Haddad, CEO of Five Point Holdings, said “stay-at-home” orders pushed home sales at Irvine’s high-profile Great Park Neighborhoods to zero.\nThe company’s project on the long-shuttered airbase had 553 sales last year — that’s almost 11 a week — and in 2020’s first 11 weeks, builders on Five Point land had made sales contracts at a nearly 14-a-week pace.\nBut in mid-March, Haddad said he saw an economy put into an “induced coma” for its well-being: “Once the patient awakes, they should be healthy.”\nOver five weeks, Great Park sales slumped to a total net loss of three sales. Then, almost as suddenly as sales slowed, buying rebounded as the economy’s reopening slowly began. In the next six weeks, 45 sales contracts were signed.\n“It feels like now we’re back normal velocity,” Haddad says.\nNow, the CEO isn’t ready to say the real estate market is fully back to normal. He needs even more strong weeks of sales to lower his concerns. The year-to-date sales pace, thanks to the virus, is still off 18% from 2019.\n“It is early in the post-COVID-19 period to feel like there is any solid trend line in terms of home sales,” Haddad said. “It’s a good start, but if there is a second or third wave of the virus this could change again.”\nA shaky economy hasn’t stopped local house hunters from paying up.\nSoCal home prices were slowly rising as the pandemic took hold of the economy.\nCoreLogic’s Home Price Index, based on closed sales of single-family homes, showed the biggest percentage gains of the year in April. House prices increased at a 4.9% annual rate in Los Angeles County, 3.7% in Orange County, and 5% in the Inland Empire.\nAnd prices of homes going into escrow are up, too.\nA thin supply of housing options pushed the LA-OC median listing price to $890,040, according to Zillow. That’s up 3.7% in a month, and up 6.8% in a year, the third-largest 12-month gain among 35 markets tracked.\nThe Inland Empire’s status as the region’s spot for housing bargain hunters likely aided its sales recovery. The median list price of $428,719 was up 2% in a month and 2.1% in a year.\nCoreLogic is forecasting price drops in 41 states, with the biggest declines occurring in areas hit by downturns in tourism and oil and gas industries.\nHowever, price drops aren’t expected in Southern California. CoreLogic Deputy Chief Economist Selma Hepp, noted the region’s wealth, low inventories, and growing numbers of millennials entering the homebuying market.\nPrices instead are forecast to rise 3% in Los Angeles County by April 2021, 5% in Orange County, and 6% in the Inland Empire, CoreLogic estimated.\nThe price strength, Hepp said, is “quite surprising, but when you think about it, it’s also not surprising. All the fundamentals are there.”"},"7":{"tilte":"\n\t\t\tUnemployment rate falls to 13.3%, U.S. adds 2.5 million jobs\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/05\/unemployment-rate-falls-to-13-3-us-adds-2-5-million-jobs\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/Virus_Outbreak_Ohio_Economy_19455-1.jpg?w=525","discription":"\nBy CHRISTOPHER RUGABER\nWASHINGTON — The U.S. unemployment rate fell unexpectedly in May to 13.3% — still on par with what the nation witnessed during the Great Depression — as states loosened their coronavirus lockdowns and businesses began recalling workers faster than economists had predicted.\nThe government said Friday that the economy added 2.5 million jobs last month, driving unemployment down from 14.7% in April.\nFor weeks, economists had been warning that unemployment in May could hit 20% or more, rivaling what was seen during the depths of the Depression in the 1930s.\nOnce again, the Labor Department acknowledged making errors in how it classified people as employed and said the real May rate is worse than the numbers indicate. But the government made the same mistakes in April, and together the figures still show the job market is improving.\nThe May job gain, which confounded economists’ expectations of another round of severe losses, suggests that thousands of stores, restaurants, gyms and other companies reopened and rehired more quickly than many analysts had forecast.\nStocks surged on Wall Street on the news, with the S&P 500 gaining 2.2% within 15 minutes.\n“We are witnessing the easiest phase of growth as people come off temporary layoffs and come back to their employers,” said Harvard University economist Jason Furman, who led the White House Council of Economic Advisers during the Obama presidency. “And once employers are done recalling people, the much harder, longer work of recovery will have to proceed.”\nMost economists expected rehiring to kick in as shutdowns were increasingly lifted and people gradually resumed shopping and eating out.\n“The surprising thing here is the timing and that it happened as quickly as it did,” said Adam Kamins, senior regional economist at Moody’s Analytics.\nEconomists had expected the government to report that employers shed 8.5 million more jobs last month on top of 21.4 million lost in March and April.\nInstead, nearly all industries added jobs, a sharp reversal from April, when almost all cut them. Hotels and restaurants added 1.2 million jobs in May, after shedding 7.5 million. Retailers gained 368,000, after losing nearly 2.3 million in the previous month. Construction companies added 464,000 after cutting 995,000.\nThe unemployment rate is still at its highest level since the 1930s era of bread lines and soup kitchens.\nFriday’s figures raise a key question for businesses and unemployed workers: How fast will the rebound proceed? For hiring to continue at a solid pace, businesses will probably need to see signs that consumers are starting to resume their pre-outbreak habits of shopping and dining out.\nThe crisis has also exposed wide disparities: While the unemployment rate for white Americans was 12.4% May, it was 17.6% for Hispanics and 16.8% for African-Americans.\nEven with the surprising gain in May, it may take months for all those who lost work in April and March to find jobs. Some economists forecast the rate could remain in double-digits through the November elections and into next year.\nThe street protests over George Floyd’s killing that led to vandalism and looting in dozens of cities did not affect Friday’s figures, which were compiled in the middle of May. But business closings related to the unrest could show up in the June report.\nA few businesses are reporting signs of progress even in hard-hit industries. American Airlines, for example, said this week that it will fly 55% of its U.S. routes in July, up from just 20% in May.\nAnd the Cheesecake Factory said one-quarter of its nearly 300 restaurants have reopened, though with limited capacity. Sales are at nearly 75% of the levels reached a year ago, the company said.\nFriday’s report made it clear the government continues to struggle with how it classifies millions of workers on temporary layoff. The Labor Department admitted that government household survey-takers mistakenly counted about 4.9 million temporarily laid-off people as employed.\nThe government doesn’t correct its survey results for fear of the appearance of political manipulation.\nHad the mistake been corrected, the unemployment rate would have risen to 16.1% in May. But the corrected April figure would have been more than than 19%, rather than 14.7%.\nErica Groshen, a labor economist at Cornell University and a former commissioner of the Labor Department’s Bureau of Labor Statistics, said hiring could ramp up relatively quickly in the coming months and reduce unemployment to low double-digits by year’s end.\n“Then my inclination is that it will be a long, slow slog,” she said.\nUntil most Americans are confident they can shop, travel, eat out and fully return to their other spending habits without fear of contracting the virus, the economy is likely to remain sluggish.\nGwyneth Duesbery, 22, returned this week to her job as a restaurant hostess in Grand Rapids, Michigan, as Bowdie’s Chop House prepares to reopen with tables 6 feet apart and seating capacity reduced to about one-quarter.\n“I am concerned that it will expose me to potential diseases, and expose others, no matter the precautions that we take,” she said. “It’s kind of uncharted waters.”\n "},"8":{"tilte":"\n\t\t\tHousing advocates breathe sigh of relief after California’s coronavirus budget cuts\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/19\/housing-advocates-breathe-sigh-of-relief-after-californias-coronavirus-budget-cuts\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/SJM-L-GAVIN-0507-1-2.jpg?w=525","discription":"\nAfter Gov. Gavin Newsom rolled out his new coronavirus-decimated \nStaring down a \n“It was not as dire as was predicted by a lot of groups,” said David Garcia, policy director of the UC Berkeley Terner Center for Housing Innovation. “But there’s still a lot of changes to process.”\nThe brunt of the cuts will be shouldered by K12 schools, colleges and state employees, with state parks and prisons feeling the squeeze as well. But Newsom’s newly revised budget also eliminates the ambitious $750 million state fund for homeless housing and services he had proposed in January.\nInstead, the governor intends to use $750 million in federal funds — which already have been allocated to the state — to buy the hotels and motels counties across California that are being \nSo far the state, in partnership with county governments, has leased more than 15,000 rooms as part of its \n“It’s terrific that the governor is signaling that the state is going to use a portion of its federal resources to make sure people stay housed,” said Matt Schwartz, president and CEO of the California Housing Partnership. “Is $750 million enough? No, it won’t be enough. We’re going to need more federal funding, and we’re going to need the state to double down on this amount if it wants to keep all 15,000 people housed.”\nThe governor also abandoned his earlier proposal to beef up Medi-Cal by $695 million, which would have provided for better treatment of mental illness among those experiencing homelessness. But if additional federal funds Newsom has asked for come through, that cut will be reversed.\nNewsom said within the next few years, he hopes to be in a position again where he can jump-start the programs he was forced to cut this year.\n“We’re not going to walk away from them,” he said.\nIn a bright spot for housing activists, Newsom’s revised budget retains key funds to finance affordable housing construction: $500 million in low-income housing tax credits. That will help make sure affordable housing continues to be built during what’s likely to be an upcoming recession, Garcia said.\n“A lot of groups were concerned that that would not survive the revise,” he said. “So the fact that that is in there is a big relief for affordable housing builders.”\nAt the same time, the governor proposed cutting $565 million in funding for mixed-income developments, infill infrastructure grants and other housing programs.\nAssemblyman David Chiu, D-San Francisco, was pleased the revised budget kept the $500 million in low-income housing tax credits but expressed frustration at the loss of funding to help cities combat homelessness.\n“I am deeply concerned that we are shifting away from addressing our housing and homelessness crises, which affects all other aspects of life for everyday Californians,” he wrote in a statement. “Our housing crisis has made people poorer, sicker, and more vulnerable to COVID-19. We cannot let up on addressing this issue.”"},"9":{"tilte":"\n\t\t\tUS job losses in May could raise 3-month total to 30 million\t\t","link":"https:\/\/www.dailynews.com\/2020\/06\/03\/us-job-losses-in-may-could-raise-3-month-total-to-30-million\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/06\/ADP_Jobs_Report_39483-1-1.jpg?w=525","discription":"\nThe epic damage to America’s job market from the viral outbreak will come into sharper focus Friday when the government releases the May employment report: Eight million more jobs are estimated to have been lost. Unemployment could near 20%. And potentially fewer than half of all adults may be working.\nBeneath the dismal figures will be signs that job cuts, severe as they are, are slowing as more businesses gradually or partially reopen. Still, the economy is mired in a recession, and any rebound in hiring will likely be painfully slow. Economists foresee unemployment remaining in double-digits through the November elections and into 2021.\nIf their forecast of 8 million jobs lost in May proves correct, it would come on top of April’s loss of 20.5 million jobs — the worst monthly loss on record — and bring total job cuts in the three months since the viral outbreak intensified to nearly 30 million. That’s more than three times the jobs lost in the 2008-2009 Great Recession. And if the jobless rate does reach 20% for May, it would be double the worst level during that previous recession.\nOverhanging the jobs picture is widespread uncertainty about how long the unemployed will remain out of work. Most of the layoffs in recent months were a direct result of the sudden shutdowns of businesses in response to the coronavirus pandemic. As many of these businesses reopen, at least partially, workers who had been laid off have held out hope of being rehired soon.\nBut some small employers might not reopen at all if the recession drags on much longer. And even once companies do reopen, their business may not fully return until Americans are confident they can shop, eat out and return to other previous habits without becoming sick. For now, most people who have lost jobs still say they expect their unemployment to prove temporary.\nEven if just one-third of the job losses turn out to be permanent, though, that would leave 10 million people who will need to find work at new employers or even in new occupations. That is still more than all the jobs lost in the Great Recession.\nA hole that size would take years to fill. Hiring will likely rebound over the summer and fall as states and cities further lift restrictions on economic activity. But it won’t match the huge job cuts this spring. Oxford Economics, a consulting firm, estimates that the economy will regain 17 million jobs by year’s end, a huge increase by historic standards. But that would make up for barely more than half the losses.\nSeth Carpenter, an economist at UBS, said that after an initial bounce-back, future hiring will likely be slow and could be interrupted by another wave of the pandemic.\nAdam Ozimek, chief economist at Upwork, notes the fastest year for job growth since the Great Recession was 3 million jobs in 2014. Even at that pace, it would take at least several years to return to the pre-pandemic job market.\nSince mid-March, more than 40 million Americans have applied for unemployment benefits. That doesn’t mean that many people are still unemployed. The figure likely includes some duplicate filings: In some states, self-employed and “gig” workers applied under their regular state unemployment systems before they were able to file under a new federal program that has made them eligible for benefits for the first time.\nIn addition, some people who lost jobs early and applied for unemployment aid have been rehired. That, along with slowing layoffs, helps explain why the net job loss for May is expected to be far less than April’s. Goldman Sachs estimates that up to 3 million people who were initially laid off have already been rehired.\nWeekly surveys of small businesses by the Census Bureau show an uptick in the number of such companies that are hiring and providing more hours of work, though the gains are slight. In mid-May, the most recent data available, nearly 10% of small companies surveyed said they had added jobs in the past week, and 12% said they had added hours. Both figures were roughly double their level three weeks earlier.\nStill, 16% said they had cut jobs, and a third said they were still cutting hours — figures that are consistent with ongoing but smaller job cuts in May.\nThree-quarters of states have allowed dining-in services to resume at restaurants, though most are still restricting total capacity. Many states have reopened gyms, hair salons and movie theaters. But a meaningful rebound will require greater public willingness to return to their old activities without fear of contracting the virus.\nAdam Kamins, senior regional economist at Moodys Analytics, said this probably won’t happen until a vaccine is available or testing expands significantly.\nCivil unrest in dozens of cities since the weekend in response to the killing in Minneapolis of George Floyd may also weigh on the economy in the short term, though analysts for now expect the consequences to be limited. Kamins said the economic damage was likely mitigated by the fact that so much activity is still closed down in large cities like New York and Washington, with many people already working from home.\nData from the restaurant reservation app OpenTable showed a slight drop in dine-in activity Monday and Tuesday that might have been caused by the protests.\n“It certainly doesn’t help to have this layer of uncertainty added on,” Kamins said.\nHeidi Shierholz, senior economist at the progressive Economic Policy Institute and a former chief economist at the Labor Department, suggested that more government aid will be necessary to keep consumers and businesses afloat so that many laid-off workers will have jobs to return to.\n“Those jobs are not going to come back if the federal government doesn’t do the things it needs to do to stimulate the economy, so that the demand and confidence is going to be there, so that those businesses will need to call workers back,” Shierholz said."}}