{"1":{"tilte":"\n\t\t\tFormer Trojans Chris Claiborne, Hayes Pullard join USC staff as quality control analysts\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/former-trojans-chris-claiborne-hayes-pullard-join-usc-staff-as-quality-control-analysts\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-PREP-CALABASAS-0907-12-1.jpg?w=527","discription":"\nChris Claiborne and Hayes Pullard are back in cardinal and gold. \n\nThe two former USC linebackers have joined the Trojans’ staff as quality control analysts, head coach Clay Helton announced on Thursday. Claiborne will help on the offensive side of the ball while Pullard will work on defense. \n\t\t\t\t\t\t\nClaiborne spent the last two years as head coach at Calabasas High before \nHe returns to USC, where he was a three-year starter from 1996-1998. In his final season at USC, Claiborne was a team captain and won the Butkus Award and Pac-10 Defensive Player of the Year Award while being named a unanimous All-American. He went ninth overall in the 1999 NFL Draft to the Lions and played professionally until 2006. \nPullard started at USC from 2011-2014, finishing his career sixth on the program’s all-time tackles list. The former Crenshaw High standout played three years in the NFL. \n\nBoth were effectively hired prior to the COVID-19 outbreak, but agreed to start their duties on June 1, USC’s statement said. \n"},"2":{"tilte":"\n\t\t\tMLB players reportedly want more games, no further salary cuts\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/mlb-players-reportedly-want-more-games-no-further-salary-cuts\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/AP20045746290768-1.jpg?w=525","discription":"\nA day after Max Scherzer symbolically whistled a fastball past the heads of Major League Baseball owners, there was little public indication that the two sides had gotten any closer to a deal that would allow the sport to return this summer. \n\nOn Wednesday night, Scherzer, a member of the executive committee of Players’ Assn., \nPlayers instead intended to submit a proposal to the owners that would call for a return with more games, according to \nDeferrals could also be a solution that would allow the players to collect their expected salaries while allowing owners relief from the short-term cash flow issues created by games without the revenue of ticket sales. \nBoth sides would like to have a pre-season training period start in mid-June and \nAlthough there have been some reported differences between the sides on the \nOwners on Tuesday submitted an offer to the players that would reduce their salaries on a sliding scale, with the highest paid players taking the largest cuts. While players making the minimum would see their salaries cut by about 8 percent, those at the top of the scale would lose about 56 percent. \n\nThose cuts would be on top of the pro-rated losses they players have already accepted simply by virtue of playing fewer games. The current proposal of an 82-game season would leave players earning half of their normal salary for 162 games. \n\n“After discussing the latest developments with the rest of the players, there’s no reason to engage with MLB in any further compensation reductions,” Scherzer wrote. \nScherzer added that MLB’s position would “completely change if all documentation were to become public information.” \n\nPlayers are skeptical of the owners’ contention that they would lose more money by playing than not playing if they have to pay players their full pro-rated salaries without being able to sell tickets to the games. \n\nPlayers will reportedly counter with an offer to play more games, up to 100 or 110. That could allow both sides to make more money if games later in the year could be played with fans. \n\nPushing the regular season back into October and the postseason into November could risk postseason games being lost to a second wave of coronavirus. MLB generates the largest portion of its TV revenue from the postseason. \n\nOne suggestion for a bridge to the differences would be deferring player salaries. It could be possible for players to still earn their full pro-rated salaries, but to have portions of that money deferred, with interest, into future seasons. \n\nThe sides already agreed to defer portions of bonuses paid in the draft, which will be held next month. \n\n\n\n— Max Scherzer (@Max_Scherzer) \n\n"},"3":{"tilte":"\n\t\t\tSafeSport: Amy Nyman made gymnasts feel ‘scared, degraded and humiliated’\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/safesport-amy-nyman-made-gymnasts-feel-scared-degraded-and-humiliated\/","img":"https:\/\/images.pexels.com\/photos\/518543\/pexels-photo-518543.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940","discription":"\nAs the temperature hit triple digits in northwest Ohio one day in 2002, Amy Nyman had the doors at New Heights Gymnastics closed and instructed the gymnasts she coached, some as young as 10, to do sprints in the sweltering heat inside the gym. No water breaks were allowed. \n\nThe incident is listed among the findings in previously undisclosed confidential U.S. Center for SafeSport documents shared with the Southern California News Group that describe the “impossible conditioning” Nyman, the wife of USA Gymnastics’ former director of sport medicine and science, allegedly forced young athletes to endure. \n\t\t\t\t\t\t\nNyman, the New Heights owner and head coach, ordered gymnasts to do so many repeat rope climbs that the insides of their legs bled and their arms were too sore to continue training, according to the documents. When a New Heights gymnast said she was afraid to attempt a balance beam skill during a 2016 camp the team was attending in Pennsylvania, Nyman ridiculed the girl in front of her teammates, then made her do a series of sprints up a hill and 1,000 push-ups, according the SafeSport documents.  It took the girl so long to complete the push-ups that she missed dinner. \n\n“This conduct not only emotionally effected claimant and several teammates but it was likely to be perceived as abuse and served little purpose other than to humiliate claimant for fear in performing a skill,” a SafeSport official wrote. \nThe U.S. Center for \nNyman was suspended an additional year for retaliating against two adult individuals who participated with the SafeSport investigation. \n\nSafeSport, citing a preponderance of evidence provided by 14 claimants found that Nyman “created an environment at her gym that had little positive enforcement and made minor (-aged) gymnasts constantly feel scared, degraded and humiliated.” \n\nNyman is prohibited from participating in USA Gymnastics sanctioned events or having any contact with USA Gymnastics members or sanctioned clubs or businesses until Oct. 3, 2021. \n\nNyman’s suspension came against the backdrop of USA Gymnastics hearings on allegations of physical, verbal and emotional abuse against Maggie Haney, the New Jersey-based coach of Olympic and world champion gymnasts. \nThe juxtaposition of the Nyman and Haney suspensions has sparked outrage among Nyman’s alleged victims and their families and supporters. It has also raised concerns about what critics charge is a lack of uniformity regarding sanctions and procedures between SafeSport and national governing bodies like USA Gymnastics. \n\nNyman’s suspension, said Judie Saunders, an attorney for some of the alleged victims, “goes against the weight of the (SafeSport) report.” \n\n“The punishment does not seem fair or in line with events” that were detailed in SafeSport’s findings,” Saunders said. “It’s a very frustrating process and a woefully inadequate suspension if you can even call it a suspension.” \n\nThe Nyman case highlights how sanctions for similar offenses can vary significantly among SafeSport and national governing bodies, athletes and athlete rights advocates said. \n\n“There’s no consistency at all in it,” said Jonathan Little, an attorney who has represented dozens of sexual abuse victims in Olympic sports. \n\n“My concern is that everyone in the Olympic movement should know where the lines are,” said Nancy Hogshead-Makar, an Olympic swimming gold medalist and founder of Champion Women, an advocacy group for girls and women in sports. “That’s how you get people to buy in and they’re not buying into it now because they don’t trust it.” \n\nDan Hill, a spokesman for the U.S. Center for SafeSport, countered that the SafeSport code “is a consistent and unifying message against abuse and sets clearly what isn’t permitted.” \n\nThe Nyman case has also raised questions about the competency of the SafeSport staff and the process for deciding whether the U.S. Center for SafeSport or national governing body has jurisdiction over certain abuse cases. \n\nSafeSport investigators shared private medical and personal information about alleged victims and their family members in a report that was accessible to dozens of individuals. The center later redacted the medical and personal information in an updated report after it was alerted to the breach, according to Hill. SafeSport has since taken additional steps to ensure claimants have more control over what information is shared with others, Hill said. \n\nGymnasts and their families’ anxiety about the case was further heightened, parents said, by how long it took to resolve and by SafeSport investigators’ failures to respond to emails, phone calls and texts in a timely manner – if they responded at all. An attorney for Nyman also complained about the length of the case. Nyman’s suspension came 15 months after it was referred to SafeSport and 32 months after USA Gymnastics began investigating New Heights. \n\n“The center has acknowledged that it wants to resolve matters faster without compromising quality and thoroughness,” Hill said. \n\nSafeSport’s staff has grown from 36 in July 2019 to 65 employees. The center has 16 investigators, double that of a year ago. \n\nBut in terms of response and resolution, Hill acknowledged “there’s still room for improvement there.” \n\nNyman has appealed the suspension and an arbitrator is scheduled to hear her appeal over three days beginning June 29. The arbitrator is Christian S. Dennie, a Fort Worth attorney. Dennie last year reduced a SafeSport lifetime ban of Richard Callaghan, coach of Olympic skating champion Tara Lipinski, to three years. Callaghan was banned for sexually abusing a male teenage skater starting in the 1970s. \n\nDennie found that Callaghan had committed sexual misconduct but reduced the ban because “SafeSport failed to produce corroborating evidence as required” to meet the criminal statues upon which the complaint was based. \n\n“I’ll bet my house on it that the whole thing is getting overturned,” said Russell Prince, Nyman’s attorney who also represents Haney. “Amy Nyman is not coming out of this with a suspension. It’s not going to happen. This is one of the easiest (appeals) I’ve seen. It’s not Maggie Haney stuff. It’s cut and dried.” \n\nSafeSport cleared two New Heights assistant coaches of verbally abusing gymnasts and violating USA Gymnastics policies prohibiting the consumption of alcohol in the presence of minor-aged athletes. \n\nThe center also cleared Edward Nyman Jr., Amy’s husband, \n“Dr. Nyman was terminated for his failure to disclose athlete safety complaints involving the club with which he is affiliated to USA Gymnastics,” USA Gymnastics said in a statement to SCNG. “This demonstrated poor judgment and created a conflict of interest that disqualified him from serving in this important role.  We are confident this was the best decision for the welfare of our athletes and our community.” \n\nBut Edward Nyman said in an interview with SCNG that he discussed complaints made against New Heights and his wife extensively with Mark Busby, a USA Gymnastics in-house counsel, before he was hired. \n\n against Amy Nyman and New Heights since at least the summer of 2017, according to a person familiar with the complaint. Busby, in late January or early February 2019, encouraged a parent to file a complaint against Amy Nyman and New Heights with USA Gymnastics and U.S. Center for SafeSport, according to four people familiar with the complaints. \n\nThe complaints against New Heights were serious enough for USA Gymnastics to refer them to the U.S. Center for SafeSport in February 2019, two months before Nyman was hired. The complaints allege emotional and verbal abuse, and that Edward Nyman, who has a PhD. in biomechanics, conducted physical exams on New Heights athletes. \n\nBeginning in 2016, under what club officials described as “Injury Prevention Screening and Protocols,” gymnasts were required to undergo “physical and injury prevention screening” conducted by Edward Nyman in the New Heights gym, according to four people familiar with the case. Parents were charged $75 for the initial screening and between $75 to $200 if additional consulting was required, according to documents. \n\nNyman denied any wrongdoing and there were no allegations of sexual misconduct. \n\n“These are not exams,” Nyman said. “They’re functional movement type screenings. They do this all over the world. I’m looking for symmetry or strength changes, like if one leg is weaker compared to the other. \n\n“This is my expertise. This is what I’m world renown for. I’m not physically doing any medical (procedures). I’m not touching athletes in any way, shape or form.” \n\nThe allegations are not referred to in either SafeSport’s 639-page investigative report by Libby Bailey, the center’s assistant director of intake and a senior investigator, or the notice of decision. \n\nCiting what it described as a “thorough investigation,” SafeSport found Amy Nyman engaged “in emotional and physical misconduct against multiple minor (-aged) athletes” between 2002 to 2005 and 2010 to 2019. The physical misconduct refers to excessive and punitive conditioning and not Nyman physically touching athletes in an abusive manner, according to SafeSport documents. \n\nNyman had young gymnasts do conditioning that “exceeded appropriate amounts” and resulted in “physical injuries.” She required girls to keep food journals, which SafeSport found “had a signature negative effect on the emotional health of multiple young gymnasts.” \n\nGymnasts, SafeSport said, “repeatedly heard degrading comments” from Nyman. The coach referred to one gymnast as a “waste of her mom’s money,” according to SafeSport documents. \n\nNyman, according to SafeSport, also threatened to isolate gymnasts she was upset with by sitting them in a “crybaby chair,” an approximately six-inch tall, plastic Little Tikes chair placed against the gym’s wall. \n\nSafeSport also found Nyman violated USA Gymnastics policies by drinking in front of gymnasts during a trip to a 2017 meet in Charleston, South Carolina. Nyman was “falling down blotto,” according to one witness cited in a SafeSport document. Nyman denied drinking but one assistant coach acknowledged to SafeSport that the coaches “may have a had a few drinks.” \n\nNyman, SafeSport said, also drank wine in front of at least five minor-aged gymnasts during what one parent described as a three-hour tirade by the coach at a 2018 camp in Cincinnati. \n\nSafeSport also found that Nyman’s removal of two judges from a meet she was directing was retaliation for the judges cooperating with the center’s investigation. \n\nNyman’s retaliatory behavior, SafeSport said, “can dissuade participants from participating with investigations and undermine the center’s resolution process.” \n\nSafeSport said it asked Nyman to give a reason for the judges’ removal. Nyman provided, SafeSport said, “no articulable reason other than the center’s investigation to remove them from the meet.” \n\nNyman “did not provide an alternate reason despite the opportunity and specific request to do so.” \n\nThe suspension for retaliation was significant, Hogshead-Makar said, because it marked only the second time the center had issued a sanction for retaliatory behavior. \n\nPrince, however, said he is confident that retaliation charge will not stand. \n\n“I don’t think the whole retaliation argument is even going to make it to arbitration,” he said. “I don’t think there’s any doubt (SafeSport) will drop the retaliation charge or else they’re going to face significant legal exposure. \n\n“If they don’t drop the retaliation, they’re staring a lawsuit in the face they can’t win.” \n\nPrince described the SafeSport investigative report as “laughable. It’s 800 pages of gobbledygook.” \n\nPrince said SafeSport is needed, but complained that the current investigative and adjudication processes are slanted against the accused. \n\n“SafeSport is a sham,” he said. “The whole system is a sham.” \n\nAttorneys on both sides said they supported an overhaul of SafeSport, including the adoption of procedures more in line with practices in state and federal courts. Both sides, echoing a familiar complaint, also urged more transparency in the decision-making process behind whether SafeSport or a national governing body handles abuse complaints. \n\nThe U.S. Center for SafeSport has jurisdiction over sexual abuse cases in Olympic sports. National governing bodies such as USA Gymnastics can handle physical, emotional and verbal abuse cases or they can refer them to the center if there are conflict-of-interest or systemic issues involved in the case. \n\nHill declined to comment on why the Nyman case was referred to SafeSport. \n\nUSA Gymnastics said in a statement “USAG is unable to comment on the details of individual cases. In general, when a report comes to USA Gymnastics, we make a determination whether or not to send it to the Center. We immediately send any case to the Center if it has exclusive jurisdiction in those matters, as it does with sexual abuse cases. However, we may also request that the Center take jurisdiction over other cases where there is the potential for a conflict of interest that could prevent a fair process – e.g., if we were involved in a lawsuit with a related party.” \n\nThe Nyman case, according to longtime observers of the American Olympic movement’s efforts to address abuse, highlights the need for uniformity in sanctions between SafeSport and the NGBs. \n\nThe length of Nyman’s suspension was based on “mitigating factors,” SafeSport wrote, including that she had “no prior history of misconduct with the center” and her misconduct did not involve any physical contact with athletes. \n\nHill said “the SafeSport code is consistent and it applies across the movement and defines what abuse is and what action organizations need to take to prevent abuse.” \n\nBut Little and other athlete advocates support SafeSport and the NGBs adopting a uniform “punishment code with minimum (sanctions). So you could start building, for lack of a better term, a case. You can say, ‘This gymnastics coach did this. And so if the track coach did this, they get this.’” \n  \n\t\t\t"},"4":{"tilte":"\n\t\t\tUSC QB JT Daniels transfers to Georgia\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/usc-qb-jt-daniels-transfers-to-georgia\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-USC-FBC-0306-881-SV-1.jpg?w=510","discription":"\nAfter speculation he may still return to USC, JT Daniels made his departure from Troy official on Thursday. \n\nThe former Trojan quarterback is transferring to Georgia, he announced on Twitter, signing off with a short message: “THANK YOU USC. Excited for the future.” \n\t\t\t\t\t\t\nA former five-star recruit from Mater Dei, Daniels started for USC in 2018 as a true freshman. He completed 216 of 363 passes that season for 2,672 yards, 14 touchdowns and 10 interceptions. \n\nHe beat out a four-man field for the starting job again in 2019 but suffered a season-ending ACL tear in the second quarter of the season opener that required surgery. In his lone half as a sophomore, Daniels completed 25 of 34 passes for 215 yards and a touchdown and interception apiece. \nThis allowed true freshman Kedon Slovis a chance at quarterback. Even after his surgery, Daniels remained a consistent presence at USC practices and helped Slovis throughout his freshman campaign. \n\nSlovis won Pac-12 Offensive Freshman of the Year honors after completing 72 percent of his passes for 3,502 yards, 30 touchdowns and nine interceptions, and has since garnered speculation as a potential Heisman candidate in 2020. \n\nStill, USC head coach Clay Helton planned to keep the quarterback competition open for Daniels to earn back the job, but Daniels entered the transfer portal in April. \n\nNow a redshirt sophomore, Daniels will have to apply for a waiver for immediate eligibility at Georgia. If he receives the waiver, he will have three years of eligibility remaining. \n\nIf eligible in 2020, Daniels will compete with Wake Forest transfer Jamie Newman for the starting job. Newman, who committed to the Bulldogs in January, completed 60.9 percent of his passes as a junior and threw for 2,868 yards, 26 touchdowns and 11 interceptions. \nBut Newman is a graduate transfer and has just one year of eligibility remaining, making Daniels the presumptive starter in 2020 for Georgia, which went 12-2 this past season and beat Baylor in the Sugar Bowl. The other quarterbacks on the Georgia roster are redshirt junior Stetson Bennett IV, redshirt freshman D’Wan Mathis and highly recruited true freshman Carson Beck, who enrolled early. \n\nDaniels’ departure leaves USC with two scholarship quarterbacks on roster: Slovis and senior Matt Fink. USC also added Vanderbilt transfer Mo Hasan as a walk-on this spring. \n\nFink offered a different potential path for Daniels. Fink entered the transfer portal last summer, flirting with Illinois before opting to return to USC. \n\nHelton and his staff kept this door open to Daniels, too, as he remained a part of USC’s quarterback and team meetings even after the program announced he was exploring his options for a transfer. \n\nBut Daniels has opted for Georgia and the SEC rather than stay at USC. \n\nDaniels first arrived at USC after reclassifying from a junior in high school to a senior, the next in a long line of Trojan quarterbacks from Mater Dei including Matt Leinart and Matt Barkley. In his final season at Mater Dei, Daniels led the Monarchs to a 15-0 record and a consensus national championship. \n\nHe won the starting job at USC as a freshman over Fink and Jack Sears, who earlier this month transferred to Boise State. \n\nAfter losing half of its quarterback room, Slovis is the presumptive starter for USC, though Helton said in an interview with the Southern California News Group last month that he will keep the competition open for Fink even without Daniels in the fold. \n\n“We always compete at all positions. Training camp is an opportunity to compete,” \nIn that interview, Helton did not rule out the possibility of adding a third scholarship quarterback via transfer. But that comment was in the context of the question of whether the NCAA would grant one-time immediate eligibility waiver to transfers. \n\nIn a vote last week, the NCAA postponed passing such a rule until January, complicating USC’s options. The Trojans could look at adding a graduate transfer, or signing a younger QB and hope he receives a waiver from the NCAA to play in 2020. \n"},"5":{"tilte":"\n\t\t\tDodgers minor leaguers will get bonus out of David Price’s pocket\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/dodgers-minor-leaguers-will-get-bonus-out-of-david-prices-pocket\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/Dodgers-Reds-Spring-Baseball-2-1-1.jpg?w=525","discription":"\nDodgers minor leaguers will continue to receive $400 a week from the team at least through June, and each will also receive $1,000 as a goodwill gesture from star pitcher David Price, a club spokesman confirmed on Friday morning. \n\nMinor leaguers throughout the sport were set to have their $400 weekly payments run through May, but the Dodgers have opted to continue them at least another month. \n\t\t\t\t\t\t\nThe Dodgers are among about a dozen teams that have committed to continue the payments, while so far only the Oakland A’s have revealed that they will not pay their minor leaguers. The Angels have not revealed their plans. \n\nMost teams have at least 200 minor leaguers, who typically are paid $300 to $500 per month. \nMany teams have been releasing dozens of minor leaguers in recent days, however. The Dodgers have not yet announced whether they will be releasing any. \n\nThe bonus will come from Price, who has still has not played a regular season game in a Dodgers uniform. Price, acquired in a trade with the Boston Red Sox in February, made $31 million in 2019 as part of a seven-year, $217 million contract that runs through 2021. \n\nThis season Price has made just a fraction that of so far, with his remaining compensation to be determined by whether MLB and the players reach an agreement to start the season. \n\nPlayers would like to see their full contracts paid on a pro-rated basis, so if half the season were played Price would earn about $16 million of his $32 million salary. The Red Sox are paying half of whatever Price earns this season. \n\nMLB has proposed that players take even deeper pay cuts to account for the loss of revenue from games without fans, with the highest paid players taking the biggest cuts. Under that proposal, Price would earn less than $8 million. "},"6":{"tilte":"\n\t\t\tWhy the death of George Floyd has resonated throughout the NBA\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/why-the-death-of-george-floyd-has-resonated-throughout-the-nba\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/GettyImages-1216203729-1.jpg?w=526","discription":"\nLegions of fans have been waiting for months to see NBA players gather again in the same building — but not like this. \n\nThe scene at Minneapolis City Hall was grim and somber, as Stephen Jackson — flanked by Karl-Anthony Towns, Gary Trent Jr. and Josh Okogie among others — spoke passionately and painfully about George Floyd, \nFloyd’s death is now famous nationwide after a video was released showing his arrest: While Minneapolis police officer Derek Chauvin pinned him to the ground with his knee across Floyd’s neck, Floyd complained that he couldn’t breathe before eventually appearing to pass out. Bystanders asking Chauvin to stop the chokehold were largely ignored. Floyd was later pronounced dead at a local hospital. \n\n“A lot of times, when police do things they know that’s wrong, the first thing they try to do is cover it up, and bring up their background to make it seem like the (expletive) that they did was worthy,” said Jackson, a 14-year NBA vet who once played for the Clippers. “When was murder ever worthy? But if it’s a black man, it’s approved.” \nThe momentum of outrage of Floyd’s death, however, has spurred consequences: Four officers involved in the arrest were fired; as of Friday, \nWhile NBA stars have long been vocal about this particular issue, perhaps most memorably dating back to \nThe scale of these responses has spread throughout whole organizations: \n“It’s a sad thing to see young minorities being murdered on camera by people supposed to protect us,” Lakers guard Quinn Cook told Southern California News Group. “You don’t know what can happen. We need to pray for our country, pray for George Floyd and his family, and we have to keep being a voice for reason.” \n\nThere’s an inherent tension for black athletes between the game and league that has helped them become famous, and the reality that many black people still face profiling and excessive violence for the color of their skin. \n“We’re not here designed only to entertain,” Rose added. “We’re actually living and breathing human beings that have a multitude of intelligence, work ethic, discipline and talent.” \n\nRecent years have seen the NBA’s biggest stars make efforts to expand the scope of their influence, perhaps no one moreso than the Lakers’ LeBron James. His media company Uninterrupted carries the tagline: “More Than An Athlete.” \nIn the last few days, James has tweeted frustration about the death of Floyd, posted a photo of himself wearing an \nBut James is far from the only NBA luminary to weigh in, and not all are black: Golden State Steve Kerr tweeted early in the week that he believed the Floyd video showed a case of murder. \n“I think most people in my circle can talk about this stuff and we are horrified. And then we move on. Move on to the next day,” Kerr said. “Human nature is to live your own life, take care of yourself, take care of your family. When you see something horrifying, you wanna do something about it. But when you don’t live it, when it’s not in your backyard, not your children, it’s easier for things to slide by. Even when people are outraged.” \n"},"7":{"tilte":"\n\t\t\tBLACKBALLED documentary shows Sterling saga through the eyes of Clippers players and coaches\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/27\/blackballed-documentary-shows-sterling-saga-through-the-eyes-of-clippers-players-and-coaches\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/AP253149777167-1.jpg?w=620","discription":"\nLittle about the process of excommunicating Donald Sterling from the NBA was pleasant: from the release of tapes that revealed the depths of his discriminatory views, to the blanketing media coverage of the fallout, to the bitter maneuverings as he tried to maintain a grip on the Los Angeles Clippers. \n\nBut in the end, Chris Paul saw it as a “turning point” for the league’s players, who throughout their history have often found their own views and political stances held in check. \n\t\t\t\t\t\t\n“There was once upon a time when guys wouldn’t say how they felt,” he says in one scene of \n“But not anymore.” \nWhile basketball may be on hiatus, athletes are not waiting in the wings when it comes to social commentary. The death of George Floyd, a friend of former NBA player Stephen Jackson who died after being arrested by Minneapolis police, \nSocial activism by athletes precedes the Donald Sterling affair in 2014, but the scandal and subsequent booting of Sterling from the league represented a tide change to many in the NBA — a moment when players saw that they had power in their platform, and that the league and other owners had to acknowledge it. And that’s why \n“It was a time when they spoke up, spoke out, and found communities of fans and an institution that agreed, ‘This guy’s gotta go,’” Jacobs said in a conversation with the Southern California News Group. “It empowered a generation of players to feel like their voices were heard, all the moreso five years later, their influence has gotten greater and they’ve been emboldened.” \n\n harkens to before pandemics, when the Sterling tapes posed one of the greatest existential crises the league had ever faced. The beats will be familiar to even to casual observers of the circus that surrounded the Clippers back then, but with added commentary from Paul, DeAndre Jordan, Doc Rivers, J.J. Redick, Adam Silver and numerous others offering context behind one of the strangest events in pro sports. \n\nThe means of telling the story is fresh: While ESPN did a podcast on the Sterling tapes last summer, this is the first comprehensive film documentary on the subject cut into episodes shorter than 10 minutes (in accordance with Quibi’s emphasis on bite-sized episodic content). Interviews were conducted through a technology that has the subject look directly into the camera, creating an arresting intimacy with the people who helped navigate the Clippers and the NBA through the crisis. \n“On set, when we’re shooting the interviews, it is very intense and very personal,” Jacobs said. “It’s for the removal of the interviewer, to create a one-to-one relationship with the audience. You are right there, very close to these subjects.” \n\nAnd the subjects don’t seem to hold many punches: There’s depictions of terse team meetings and phone calls, as players describe how they very nearly didn’t take the court for Game 4 against Golden State, how Doc Rivers describes balancing feelings of wanting to lead his team and compete while furious with Sterling and other Clippers leadership. \nIt’s worth noting that filmmakers weighed reaching out to Sterling before ultimately deciding to proceed without his side of the story — perhaps a wise choice given Sterling’s rambling, nonsensical CNN interview that was meant as an apology and served as doubling down in the aftermath of the tapes. Players and others inside the locker room were the people Jacobs and his team wished to highlight. While ESPN’s podcast took a long, glaring look at Sterling’s spotty record as a discriminatory landlord with a taste for mistresses, \nIt’s fallout that Jacobs still is a little incredulous that the Clippers have come out of as a functional organization, still in Los Angeles, still with the same name that was once inexorably linked with not only losing, but with its miserly, racially biased owner. \n\n“It’s stranger than fiction; it’s the Hollywood script you could never write,” Jacobs said. “When you go through the Clippers organization and read about all sorts of stuff about their mismanagement, it’s amazing they’ve been able to hang on with Steve Ballmer coming in. If they had moved the franchise, it would have made way more sense to me than it ultimately turned out. But in a weird way, it is kind of a Hollywood ending.” \n\nThe best way to leave the past behind is to build a glorious future — and \nA red carpet debut was not in the cards for \n“My sports friends who are familiar with the story are just stoked to hear sports content,” he said. “But other people have told me they really like the culture story. So it’s good to see it really resonated to a completely different set of eyes and experiences, that it’s been very positively received in that way.” \n\n airs on Quibi, a subscription platform on mobile devices. The last of 12 total episodes will be released on Friday. \n"},"8":{"tilte":"\n\t\t\tUCLA guard Johnny Juzang granted immediate eligibility after transfer from Kentucky\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/27\/ucla-guard-johnny-juzang-granted-immediate-eligibility-after-transfer-from-kentucky\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/AP20022025489798-1.jpg?w=519","discription":"\nUCLA’s big off-season acquisition won’t have to wait a year to suit up at Pauley Pavilion. \n\nSophomore guard Johnny Juzang has been granted immediate eligibility by the NCAA, a team spokesperson said on Wednesday. Juzang, who transferred from Kentucky this off-season, will be able to play for UCLA in 2020-21. \n\t\t\t\t\t\t\n“We’re very excited that Johnny will be able to play for us next season,” head coach Mick Cronin said in a statement. “I’m grateful to Erin Adkins, our associate athletic director in compliance, for all of her hard work in this process. Johnny is a talented player who can definitely make an impact for us.” \n\nJuzang transferred following his freshman season at Kentucky, in which he averaged 2.9 points and 1.9 rebounds in 12.3 minutes per game. But the former Harvard-Westlake standout wanted to play closer to home, which led him to Westwood. \nJuzang’s immediate eligibility is a boost for UCLA after it lost five-star point guard signee Daishen Nix to the G-League. The Bruins return Tyger Campbell, Jaime Jaquez and Jalen Hill from last year’s team, and are still waiting to see if guard Chris Smith withdraws from the NBA Draft. \n"},"9":{"tilte":"\n\t\t\tMLB draft to air on MLB Network and ESPN\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/mlb-draft-to-air-on-mlb-network-and-espn\/","img":"https:\/\/images.pexels.com\/photos\/518543\/pexels-photo-518543.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940","discription":"\nThe Major League Baseball draft, which has traditionally been shown only on MLB Network, this year will also be carried by ESPN on June 10-11. \n\nThe two networks will both show the first round and the competitive balance round, which cover the first 37 selections. The two broadcasts, which will be independently produced, will begin at 4 p.m. PT. on June 10. \n\t\t\t\t\t\t\nThe second day of the draft, on June 11, will be carried by MLB Network and ESPN2, beginning at 2 p.m. PT. \n\nThe teams will make their selections via video conference. \nThe draft will end after only five rounds, instead of the normal 40, a concession to the coronavirus pandemic that has shut down the sport, leaving no amateur baseball games for the teams to scout and reduced revenue for them to use to sign the players. \n\nThe deadline for signing draft picks has been moved back to Aug. 1, from July 10. And much of the bonus payments will also be deferred. \n\nAlso, there is a limit of $20,000 to sign any non-drafted players, which is likely to result in a free for all as teams fight to grab the hundreds of available players who would have been drafted in a normal season. \n"},"10":{"tilte":"\n\t\t\tTwo months later, Nick Rakocevic and Jonah Mathews have different outlooks on end of USC careers\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/two-months-later-nick-rakocevic-and-jonah-mathews-have-different-outlooks-on-end-of-usc-careers\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-USC-BKC-0308-13-1.jpg?w=525","discription":"\nInextricably tied together throughout their USC careers, Jonah Mathews and Nick Rakocevic are fittingly killing time during quarantine together. \n\nThe pair, whose senior seasons came to an abrupt end just over two months ago, still live in the same houses they rented out in August. Situated within walking distance of each other, they frequent each other’s homes at least five times a week in search of something to do in between workouts to prepare for the NBA Draft. \n\t\t\t\t\t\t\nThere’s a lot of playing Call of Duty on XBox and watching Netflix shows like \n“His tendencies I’ve really noticed with times. Like he can’t workout. It’s either at 10 a.m., one o’clock or four o’clock. No in between. It has to be those times,” Mathews notes. “Quarantine has you finding out stuff about people that you never knew.” \nBut where Mathews and Rakocevic do differ, two months later, is their feelings about the end of their collegiate careers. \n\n“To be honest with you, I don’t think it will ever really click to me,” Rakocevic says. “It’s just not real. When people ask me about my season, I’m like, what season?” \n\nThe USC men’s basketball program entered postseason play winners of their last three games, clinching a first-round bye in the Pac-12 tournament with a dramatic win over rival UCLA. \n\nThen, it was over. The conference tournament, March Madness, Rakocevic and Mathews’ college days, all brought to an end by COVID-19. \n\nThe two months between then and now have done little to damper the disappointment of Rakocevic, who described his NCAA Tournament experience as a freshman as the best of his life. \n“It just got cut, just like that. There’s really not much you can do,” Rakocevic says. “The mojo that we had and the confidence that we had heading into the Pac-12 tournament, I’d never seen it before. Seeing that kinda get taken away, it’s just not real.” \n\nBut, he adds, “Me and Jonah, we did all we could do here. We talk about it every day. We’re legends here.” \n\nThat’s the lone consolation for Rakocevic. That final streak made Rakocevic and Mathews the all-time winningest players in USC history. Mathews broke the school’s career 3-point record, while Rakocevic is second all-time in rebounds. \n\nMathews finds comfort in those spots in the USC record book, too. But he found it easier than Rakocevic to move on from how the season ended, in part because of his dramatic final act as a Trojan. \n\nIt was Mathews who hit the game-winning 3-pointer with one second remaining to beat UCLA in the season finale. Such a shot against his school’s bitterest rival had a therapeutic effect on Mathews. \n\n“I made peace with it a couple days after, because for me it was different,” he says. “It ended in a way that I could make terms with it.” \n\nNow all that’s left for the pair to do is to prepare for the NBA Draft. \n\nBoth remain in Los Angeles, working at private gyms set up by their respective agencies. And both have started the process of interviewing with potential NBA employers. \n\nMathews, who has met with eight teams, has found the process of interviewing over video chats awkward. And he’s been caught off guard by some teams’ questions, like when one executive asked what he would do if a woman slapped him in a bar. \n\n“They want to gauge your personality so they can know, ‘Do we want this guy on our team or not?’ ” Mathews says. “I said I wouldn’t do anything, because if you say anything more than that, then they’ll go, ‘Ok, he’s crazy.’ “ \n\nUsually, prospects would be doing team workouts and preparing for the final month before the draft. But with the postponement of the draft lottery, the process could drag on into the fall. \n\nMathews is keeping his mentality simple in the midst of the uncertainty. \n\n“The end goal is make money and do what you love. I’m just looking for the end goal,” Mathews says. “All the stuff right here is a stick in the mud. The end goal is the game, so you just keep on pushing. It will all come to fruition soon.” \n"},"11":{"tilte":"\n\t\t\tReports: NBA could return by July at Disney World in Orlando\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/20\/reports-nba-could-return-by-july-at-disney-world-in-orlando\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/NBA-Shorter-Season-B-16x9-1-1.jpg?w=620","discription":"\nFor a number of weeks, the NBA has seemed determined to find a track to resume the 2019-20 season – and multiple media reports indicate that plan is finally starting to take shape. \n\nThe Athletic reported Wednesday morning\nWhile numerous cities have been rumored to be considered hosting games, including Houston and Las Vegas, The Athletic reported Disney World’s viability is tied to its private ownership, with property including the Wide World of Sports Complex with multiple basketball courts. Hotels and other resources could create a “campus-like” bubble  the NBA has been seeking to resume the season on hiatus since March 11 due to the COVID-19 pandemic. \n\nEven though coronavirus cases have soared to more than 1.5 million in the United States and been attributed to more than 93,000 deaths, pro sports leagues have been scouring to see what options are available to resume play. Prominent NBA voices,\nThe challenges of opening up competition in the NBA’s regular markets and arenas are complex and vast. Individual states and municipalities have varying guidelines for what businesses and services can operate – sports with fans are generally seen as one of the last public events that will be permitted on the road to normalcy. \n: Disney is the parent company of ESPN, one of the NBA’s largest media partners. Disney CEO Bob Iger has spoken to league owners during meetings during the hiatus. The league formerly hosted Summer League events in Orlando for roughly 15 years. The Wide World of Sports Complex has about 12 courts and access to broadcasting facilities. \n\nThe partnership could be just as vital to Disney, which has struggled through the closure of many of its parks and could use the appeal of basketball programming for ESPN and ABC. It opened a small section of Disney World Springs in Orlando on Wednesday with temperature checks for incoming park-goers. \n\nTesting could be one of the biggest barriers to a return: \n, with games expected to begin by mid-July. By June 1, many teams expect the NBA to issue guidelines to bring back players who are living outside their team markets and expand workouts at team facilities. \nBoth "},"12":{"tilte":"\n\t\t\tAngels open facilities for limited workouts, ‘prefer’ to hold second spring training in Anaheim\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/25\/angels-open-facilities-for-limited-workouts\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-ANGELS-0217-23-KJS-1.jpg?w=526","discription":"\nThe Angels have opened Angel Stadium and their minor league facility in Tempe, Ariz., for limited workouts for players on the 40-man roster, general manager Billy Eppler said on Monday. \n\nEppler also said the team would “prefer” to hold its formal workouts in Anaheim, instead of Arizona, if and when teams are cleared to begin officially preparing for a shortened season. Under the current proposal, each club could chose the site of its workouts in an abbreviated second “spring” training. \n\t\t\t\t\t\t\nAt the moment, with Major League Baseball and the Players’ Assn. still negotiating the terms of the sport’s return to the field, the Angels are among a handful of teams gradually reopening baseball facilities. \n\nThe Angels are allowing players to work out on the field or in indoor facilities, in Anaheim and Tempe, provided they are in groups of four or fewer. \nAt least six other teams — the Arizona Diamondbacks, Houston Astros, Miami Marlins, New York Yankees, St. Louis Cardinals and Tampa Bay Rays — have opened baseball facilities in the past week. The Seattle Mariners are planning to open their spring training facility on Tuesday. \n\nThe Dodgers’ facilities at Dodger Stadium and in Glendale, Ariz., are open only for injured players to rehab, but not for healthy players to participate in baseball workouts, a club spokesman said. \n\nOpening the facilities marks a small step toward the resumption of the sport, with owners and players currently negotiating the financial and health considerations required to emerge from the coronavirus shutdown. \n\nMLB has reportedly proposed an \nA spring training reboot would begin sometime in June, with teams having the option of returning to Florida or Arizona or working out at at their home park. \nMLB submitted to the players a 67-page document outlining the \nThis week baseball officials are expected to present a financial proposal to the union. MLB owners have contended that players should accept less than their pro-rated full salaries if they are to play games without the revenue of ticket sales. Players believe the issue was settled when they agreed to be paid only for games played, rather than their full salaries. \n  \n\t\t\t"},"13":{"tilte":"\n\t\t\tJalen Ramsey won’t skip Rams camp; deal ‘will get handled’\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/jalen-ramsey-wont-skip-rams-camp-deal-will-get-handled\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/Rams_Ramsey_Football_05515-1.jpg?w=525","discription":"\nBy GREG BEACHAM \n\nLOS ANGELES (AP) — Jalen Ramsey says he will definitely report to training camp with the Los Angeles Rams for the final year of his rookie contract. \n\t\t\t\t\t\t\nAnd while he didn’t confirm how he’ll get there, Ramsey probably won’t feel the need to show up in an armored bank truck this time. \n\nThe Rams have said they realize Ramsey deserves to be one of the NFL’s highest-paid cornerbacks ever since they acquired him from Jacksonville last season. \nIn turn, Ramsey has done everything possible to be worthy of a megadeal, receiving his third Pro Bowl nod last fall before earning his coaches’ trust and praise during the current offseason. \n\nIt all adds up to strong optimism on both sides while Ramsey’s representatives work on his long-term deal with the Rams. \n\n“It will get handled,” Ramsey said this week in a video conference call. \n\n“The Rams know where I stand, and that’s all that matters,” he added. “They’ve been in contact with my agent. They’re on the same page. They know what’s up. I know what’s up. … Everybody knew what type of situation it was going to be once they traded for me. I think it doesn’t need to be talked about that much. It’ll get handled.” \n\nRather than going after his next contract with the passion that prompted him to show up at Jaguars camp last fall in a bank truck, Ramsey is spending more time working on his burgeoning bond with new Rams defensive coordinator Brandon Staley. \nRather than isolating Ramsey as a seldom-targeted shutdown corner, Staley indicated last week that the former Florida State safety could play all over the secondary for Los Angeles next season. \n\nRamsey doesn’t want to give away the Rams’ plans, but he’s up for the challenges ahead. \n\n“I’m very excited about the way I’m going to be utilized in this defense,” Ramsey said. “I’ll leave it at that. I think my talents will be shown thoroughly.” \n\nRamsey didn’t get his big contract from the Jaguars, who drafted him in 2016 and watched him become an All-Pro a year later. After his tongue-in-cheek armored truck stunt didn’t work, he requested a trade several weeks later. \n\nRamsey’s clashes with Tom Coughlin and the Jags’ front office are only a bad memory now. The Rams have nothing but praise for their defensive centerpiece alongside Aaron Donald, and they seem eager to lock up the long-term future of a player who cost them two first-round draft picks in the trade. \n\nByron Jones became the NFL’s highest-paid cornerback in March when he agreed to a five-year, $82.5 million deal including $57 million guaranteed with the Miami Dolphins. Ramsey’s deal likely will eclipse Jones’ contract, and the Rams aren’t shy about making big commitments: general manager Les Snead has recently re-signed players to the biggest contracts ever given to a quarterback, a running back and a defensive player. \n\n“There’s a lot of dialogue” between Ramsey’s agents and the Rams, coach Sean McVay said. \n\n“What I can speak on is how impressed I’ve been with Jalen, the leadership I’m watching him take from afar,” McVay said. “When he came in, I was so impressed with him at first. But now you’re actually able to have a foundation … and this is a really impressive guy. You really get a feel for his football acumen, and how much he’s able to understand and absorb.” \n\nRamsey has already formed a solid bond with Staley, the Rams’ rookie coordinator. They’re speaking over the phone about three times per day, and Staley is eagerly exploring new ways to use Ramsey’s talents. \n\n“I love coaching this guy,” Staley said last week. “One of the unique parts about this whole thing is the relationship that I’ve been able to form with him in a short time. This guy has been really, really fun to work with. He’s got a high capacity to learn, he’s got a high capacity to lead. This game means a lot to him. His craft, his focus, his commitment, I couldn’t be more impressed with this guy. \n  \n\t\t\t"},"14":{"tilte":"\n\t\t\tChargers hire Pep Hamilton to groom Justin Herbert, but no pressure\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/27\/chargers-hire-pep-hamilton-to-groom-justin-herbert-but-no-pressure\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/AP848642379068-1.jpg?w=453","discription":"\nPep Hamilton hasn’t wasted any time getting to know the Chargers’ next face of the franchise and eventual successor to Philip Rivers. \n\nThis, of course, is Justin Herbert, whom the Chargers drafted with the sixth overall pick in last month’s NFL draft. Perhaps it’s not fair to label a rookie quarterback as a “face of a franchise,” but that’s what many expect from him in the years to come, and Hamilton was hired to guide Herbert to that esteemed status. \n\t\t\t\t\t\t\nThere’s plenty of pressure on the Chargers’ new quarterbacks coach, but you couldn’t tell from Wednesday’s introductory Zoom call. The easygoing Hamilton bantered with reporters and poked fun at one’s quarantine mustache (this reporter). \n\n“Is that a real mustache?” Hamilton asked. “What was your question again?” \nThe question: How tough is it to balance a quarterback competition while trying to groom a first-round quarterback at the same time? \n\nHerbert will compete with veteran quarterback Tyrod Taylor, who’s been referred to by Chargers coach Anthony Lynn as being in the driver’s seat to start. \n\nHamilton, 45, wasn’t stalling to answer the question. He’s seen all types of quarterback battles dating back to his first coaching gig as Howard’s quarterbacks coach in 1997, one year after playing quarterback for the university. Hamilton has coached for the New York Jets, San Francisco 49ers, Chicago Bears and Cleveland Browns. \n\nHe was instrumental in the development of former star quarterback Andrew Luck as an assistant coach at Stanford and with the Indianapolis Colts. Hamilton was Luck’s offensive coordinator from 2013 to 2015. \n\nSo back to the question. \n“I don’t know that it’s necessarily a tough thing to do,” Hamilton said. “I think whenever we get on the field, I think guys are going to organically separate themselves. I do think that football is such that when given the opportunity to go out and play, and play at a level that’s going to give our team a chance to win games, it shows through reps and it shows in time.” \n\nNew QB coach Pep Hamilton \n— Gilbert Manzano (@GManzano24) \n\n\nHamilton and the Chargers don’t plan on rushing Herbert’s development, but they’re expecting the former Oregon quarterback to push Taylor for the starting gig. \n\n“They are different players,” Hamilton said when asked if there are any similarities between Herbert and Luck. “But you know, I think the one thing that they have in common is the fact that they were drafted with the expectation of being able to come in and play at a high level whenever they get the opportunity to play. So we’re preparing Justin to be ready to come in and compete to play from Day 1.” \n\nHamilton, who was officially hired this month, hasn’t worked with Herbert in person, but he’s gotten to know him virtually, saying the two have had many football conversations that have gone into the wee hours of the night. \n\n“Smart kid,” Hamilton said of Herbert. “Very smart. Football is important to him. … I’m excited to see that he’s a student of the game.” \n\nHamilton hasn’t coached in the NFL since 2016. He was an assistant head coach at Michigan for two seasons and was the general manager and head coach of the XFL’s DC Defenders for five games before the startup league folded in April. \n\nHamilton wasn’t unemployed for long. He has another coaching gig, one with plenty of pressure, but that’s nothing new to him. \n\n\n\nThe Chargers reopened their facility Tuesday with only a few executives allowed inside the Costa Mesa building. \n\nThey plan to slowly allow more people inside the facility in the coming days while following all safety guidelines. NFL facilities were closed two months ago because of the coronavirus pandemic and were allowed to reopen last week. \n\nThe next phase would be to allow players and coaches inside the building and eventually on the practice field, but there’s no telling when that time will come. \n\nRight tackle Bryan Bulaga, the Chargers’ free-agent acquisition, has spent his offseason in Florida. Bulaga said he’s planning to gradually move into his new Los Angeles home in the next few weeks. \n\nBulaga is itching to meet his new teammates in person, but he’s skeptical about potentially jumping into a mandatory minicamp next month if the league and the state allows it. \n\n“I don’t think we can just go out there for a week of minicamp and do it how we normally do it,” Bulaga said. “Put on helmets and fly around and do that. I don’t see how that’s possible. I think there’s health risk involved there, not coronavirus health, but with guys’ bodies; hamstrings, knees. \n\n“We haven’t done any football movements and then you’re going to put us in front of each other and then say, ‘Hey, go at it.’ I don’t know if that’s going to work out, but I can see it more of a jog through tempo. More teaching than actually live speed.” \n\n\n\nFirst-year Chargers cornerback Chris Harris Jr. was named to the league’s 2010s All-Decade Team in April. That’s one of many awards Harris earned during his nine seasons with the Denver Broncos. \n\nHarris, 30, is hoping a fresh start with the Chargers will lead to more awards, including the prestigious Hall of Fame. \n\n“Last year, there was a lot of stuff going on with me,” Harris said about his final year with the Broncos, which included trade rumors. “Mentally, you never know how stuff wears down on you. I think it just did. Naturally as a human it did. Going into this year, I feel so happy. I got a clear mind and I’m hungry. I’m not done. I got a lot of goals I want to achieve. I want to be in the Hall of Fame. I want to continue to get Pro Bowls and All-Pros.” \n\nBefore the rocky ending, the Broncos signed Harris as an undrafted free agent in 2011 out of the University of Kansas. He made four Pro Bowls, one First-Team All-Pro, two Second-Team All-Pros and won Super Bowl 50. \n\nThere was plenty of good for Harris in Denver, a stint that started with Chargers defensive backs coach Ron Milus grooming the undrafted free agent. Milus held the same position in Denver and coached Harris from 2011 to 2012. \n\n“Always play that slot (cornerback position),” Harris recalled what Milus told him in Denver. “He said that’s my spot. That’s one thing he told me. He said, ‘Whatever you do, if you can play outside or safety, always try to play that slot.’ He said I’m one of the best at it.” \n\nOne of the Chargers’ intriguing offseason storylines is where Harris and Desmond King will line up in the secondary this season. King was named First-Team All-Pro as a slot cornerback in 2018. \n  \n\t\t\t"},"15":{"tilte":"\n\t\t\tNHL return plan leaves Ducks, Kings out, but could still involve LA\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/27\/nhl-return-plan-leaves-ducks-kings-out-but-could-still-involve-la\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/AP20147639756126-1.jpg?w=539","discription":"\nWhile the NHL made long strides toward a return to play, the Kings and Ducks will still be running in place for the foreseeable future. \n\nOver the Memorial Day weekend, the league accelerated its pace toward a return to the ice following its shutdown due to the COVID-19 pandemic. First, the NHL Players Association voted to further discussion of a plan for a 24-team playoff to be completed during what would usually be the offseason.  Gary Bettman laid out some details Tuesday regarding a potential return to play. \n\t\t\t\t\t\t\nTwenty-four of the league’s 31 teams will qualify for a playoff that will include eight byes, a play-in round with best-of-five series, a round-robin among the bye earners and, in all cases, games played at one of two host sites without fans in attendance. The timeline would see this season conclude roughly in September and next season begin as late as necessary, likely sometime during the winter. \n\nThe Ducks and Kings, however, need not concern themselves too deeply. They are both among the seven teams — along with San Jose, Ottawa, Detroit, New Jersey and Buffalo –not participating in the expanded postseason if it comes to fruition. \nWhen play was suspended on March 12, The Kings had just won what turned out to be the final game of the NHL regular season, giving them their seventh straight victory and boosting them above San Jose to avert a last place finish in the West. The Ducks finished ahead of the Kings and five points behind 12th place Chicago, the final qualifying team under the nearly all-inclusive format. The Ducks had 11 games remaining on their schedule to attempt to close that gap. \n\n“While we would have preferred to conclude our season normally and play 82 games, it became obvious over time that was not practical,” the Ducks said in a statement. “We appreciate the NHL and NHLPA working together to award the Stanley Cup in these unique circumstances. We also want to thank our fans for their support and patience. We remain excited about our future and can’t wait for the 2020-21 season.” \n\nBoth Southern California franchises are affected by the league’s course of action in other ways. The seven teams that will not compete in the tournament as well as the play-in round’s losing sides will be in a revised draft lottery to determine who receives the first three selections in this year’s draft, the date of which has been postponed and remains to be determined. The Kings have a 9.5 percent chance at the top overall selection, while the Ducks have an 8.5 percent probability. \n\nThe Kings and Ducks’ players are also affected by just how much revenue this revamped playoff can generate. With the cancellation of between 11 and 14 regular-season games for each franchise as well as the reality that the playoffs are likely to be played without any gate revenue from fan attendance, league revenue will dip. That impacts players directly, as their salaries are tethered to the revenue pool. \n\nEach player places a portion of his salary in escrow, and the amount he receives back from that depends on the financial success of the league. Shortfalls in league revenue impact both the portion placed into escrow the following season, and a portion of a season or an entire season without fans could also impact the amount of money placed into escrow that’s retained by players. \nPlayer salaries in sum are to represent 50 percent of the league’s hockey-related revenue as enumerated in its collective bargaining agreement. An underestimate could result in bonuses or an overestimate, as would certainly be the case under these circumstances, results in salary losses. League revenue also impacts the salary cap for the forthcoming season. The cap may have been in a position to increase substantially prior to suspending play, and now it remains to be seen how it will differ from the $81 million figure for the 2019-20 campaign. \n\nOn Tuesday, Bettman confirmed that there were 10 NHL arenas being considered for the two sites where the playoffs would be played. Among them was Staples Center. Bettman said that the decision regarding host cities would be made as late as possible so as to have the most accurate logistical and public health information, with a decision likely coming in three to four weeks. \n\nOne city would host the Eastern Conference and another would host the West. Seven Western Conference cities were among the 10 possible sites, but Bettman said the conference affiliation of the host city’s franchise would not impact which city hosted which conference. Safety, health and the adequacy of facilities would impact which cities are selected rather than geographical location, Bettman said. \n\nMinnesota Wild player representative and goalie Devan Dubnyk emphasized to The Athletic that the players voted solely on a format in the event that play were to resume, adding that many details were still be agreed upon. Bettman addressed many concerns regarding the proposal, but also said that significant aspects of it were yet to be determined. The conference quarterfinals, for example, may be best-of-five or more traditional best-of-seven series. The conference finals might be played in different buildings or in the same one, with the location of the Stanley Cup Final still unknown as well, in addition to myriad logistical and health considerations being weighed. \n\n“The challenging parts are going to be finding the venues that can handle the amount of play that’s going to happen, the ice conditions in the warm summer climate. There’s a lot of things that I worry about in terms of the players’ safety,” former Kings center Jeremy Roenick said. “What their conditioning is, how many games they’re going to play in the course of a week. Everybody’s staying in a hotel, they’re separated from their families. It’s going to be a tough two and a half months of hockey. But I think the league has come too far to let this whole season get canceled.” \n\nThe timetable for this season, next and possibly beyond has also been altered significantly. Instead of the season beginning in October and ending in June, this campaign will potentially run into the time next season’s training camp would have begun, causing a delay in next season’s commencement and conclusion. \n\nBettman said the league will use the improvised schedule to research whether a long-term change is desirable or if it should consider measures in the future — for example compressed or truncated schedules — to return to a more traditional timeline that does not see a winter sport crown its champions late in the summer. \n\n\n“It’s not what you’re used to. It feels like it’s baseball. It’s not perfect,’ said Jarome Iginla, a former scoring champion who concluded his illustrious career with the Kings. “Initially I thought ‘maybe you just don’t have the season and start up at the normal time,’ but there’s so many unknowns with when there will be a vaccine or what’s going to happen with the coronavirus that you can’t really plan it. So when you have the opportunity to play, you take it.” \n\nThe absence of fans is something all major sports leagues are contending with as they seek to resume play. Germany’s top soccer league, the Bundesliga, returned to the pitch earlier this month sans fans and with beefy guidelines for player health and safety, much like those the NHL will likely implement. Players will likely face extensive regulations both on and off the ice, as well as the unfamiliar situation of playing an extended postseason on neutral ice, potentially far from their families and inside empty arenas. \n\n“I’ve been watching some soccer games over in Europe with no fans and it’s not quite the same, let’s face it,” former Kings center Cliff Ronning said. “Hockey, especially in the playoffs, it’s a very emotional game and you ride on your emotions. It’s going to be difficult for the playoffs but when you’re chasing the Stanley Cup, you always have to be ready for the unknown and it takes a true champion to win it.” \n"},"16":{"tilte":"\n\t\t\tDucks goalie Ryan Miller makes charity a priority during NHL’s coronavirus break\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/22\/ducks-goalie-ryan-miller-makes-charity-a-priority-during-nhls-coronavirus-break\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-DUCKS-0927-06-kjs_26958017_808461-1.jpg?w=505","discription":"\nRyan Miller’s world came to a screeching halt one day in March, just as it did for almost everyone else. It wasn’t just hockey that was put on pause because of the coronavirus pandemic sweeping the globe. It was life in general that was placed in suspended animation. \n\nIt didn’t take long for Miller and his Ducks teammates to wonder what they could do to help. They started by donating meals to doctors, nurses and other essential health care workers at UC Irvine Medical Center in Orange, following the charitable lead of Ducks owners Henry and Susan Samueli. \n\t\t\t\t\t\t\nAmong other things, the Samuelis promised to pay part-time employees through June 30. \n\nAs days turned into weeks and weeks turned into months, Miller realized there was more he could do. He had old goalie equipment that he could auction off for charities in Orange County, including the Second Harvest Food Bank, and in Buffalo, New York, where he got his NHL start. \nThe Ducks had already teamed with Second Harvest, setting up a food distribution location in the Honda Center parking lot and turning over their shuttered practice rink at the Great Park in Irvine to the organization to use as a food storage facility. \n\n“We have a good group in Anaheim,” Miller said. “The Samuelis really stepped up and the boys pivoted and did a nice thing. Then it was, like, ‘OK, we’ve done something as a group. What else can I do? Well, I’ve got a bunch of gear in old bags in an attic and in storage.’” \n\nMiller, 39, began the Steadfast Foundation in 2006, while playing with the Buffalo Sabres. It was through his charity that he set up his latest fundraising effort, an online auction that features some of his pads, catching gloves, skates and sticks, plus a few donated items from teammates and rivals. \n\n“I’ve been reaching out to guys I’ve played with,” he said. “There’s some good stuff there.” \n\nThe auction runs through June 1, or perhaps later if the bids continue to roll in. \nTo view Miller’s collection of gear and make a bid visit: \nSetting up the auction was one way to give back to two of the communities he’s called home since entering the NHL in 2002-03 with the Sabres, after a stellar career at Michigan State. It also gave him a project to keep him busy during these days of uncertainty. \n\nLike almost everyone who’s been under safer-at-home orders in California, Miller has binged-watched TV and embraced an abundance of free time with his family. He’s also tried his hand at yoga as a way of staying active while awaiting whatever comes next. \n\nOn thing became certain Friday: The Ducks’ last game of 2019-20 was a loss to the St. Louis Blues at Honda Center one night before play was suspended March 12. On Friday, the NHL’s players association agreed to resume play with only the top 24 of the league’s 31 teams returning to action. \n\nMiller might have played his final NHL game. \n\nAfter all, the Ducks were not among the top 24 teams in the standings when play was halted, so their 2019-20 season is history. Miller doesn’t have a contract for the 2020-21, and although he said he would like to play, he couldn’t claim to know what’s next for him. \n\n“If that ends up being my final season, it would be pretty disappointing,” he said of the possibility of such a jarring end to his career. “These are uncertain times and I don’t know what that means for me. It would be tough to accept if it is the final opportunity for me.” \n\nMiller served as a capable backup and an excellent mentor for starting goalie John Gibson for 71 games over three seasons with the Ducks, his fourth team in the NHL. Overall, he has won 387 games, the most by an American-born goalie in league history. \n\nIn addition, Miller is two wins away from tying Dominik Hasek, the man who preceded him in Buffalo and set the standard for Sabres goalies while playing 491 games. Miller played 540 games with Buffalo and forged a strong bond with the hard-scrabble city and its fans. \n\nMiller also played with the Blues and Vancouver Canucks before signing with the Ducks as a free agent July 1, 2017. As in his other stops, he’s endeared himself to Ducks fans with acts of kindness such as swapping pucks for Girl Scout cookies and other treats during a pregame warmups this past season. \n\n“I don’t want to close anything off,” Miller said of the possibility of re-signing with the Ducks and continuing his Hall of Fame-caliber career for an 18th season in the NHL. “But I also don’t want to make a decision when no one knows what’s going on.” \n\nLike everything else, it’s a decision that has been put on hold because of the coronavirus. \n  \n\t\t\t"},"17":{"tilte":"\n\t\t\tZlatan Ibrahimović injures calf while training with AC Milan\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/25\/ibrahimovi-injures-calf-while-training-with-ac-milan\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/Sweden_Soccer_Ibrahimovic_Statue_48017-1-1.jpg?w=537","discription":"\nMILAN (AP) — Zlatan Ibrahimović injured his calf while training for the anticipated restart of Serie A with AC Milan on Monday. \n\nThe forward will undergo medical exams on Tuesday to determine the extent of the injury, the club said. \n\t\t\t\t\t\t\nSerie A has been suspended since March 9 due to the coronavirus pandemic. The league is hoping to restart on June 13 if the government approves. \n\nThe 38-year-old Ibrahimović rejoined Milan in December on a six-month contract with an option for next season. \nDuring the virus lockdown in Italy, Ibrahimović trained with Swedish club Hammarby, of which he is part owner. \n\nIbrahimović scored three goals in eight Serie A matches with Milan this season. He also played for Milan from 2010-12. \n"},"18":{"tilte":"\n\t\t\tKristine Anigwe, newest Sparks member, looks forward to playing alongside ‘legends’\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/kristine-anigwe-newest-sparks-member-looks-forward-to-playing-alongside-legends\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/GettyImages-1199357472-1.jpg?w=452","discription":"\nBy the time Kristine Anigwe fielded the question, she had already make it perfectly clear how excited she is to have become a member of such a talented Sparks team. \n\nAnigwe on Tuesday was \n“I talked to him during the trading process and basically, again, there are so many veteran players that have made their mark in the league,” she said. “Right now, all I’m trying to do is just learn and grow from them and whatever happens, happens.” \n\nAnigwe, a college star at Cal, averaged just 9.3 minutes combined for Connecticut and Dallas in 2019 — her rookie season in the WNBA. \n“If I’m playing five minutes, if I’m playing 10 minutes, if I’m playing 20 minutes, I just have to accept the role I’m given and excel in that role,” the 6-foot-4 post said. “That’s what I’m willing to do. … I’m just grateful for this opportunity to play on this team. It’s so rewarding for me.” \n\nAnigwe, 23, played four seasons at Cal and was an immediate hit for the Bears, averaging 20.5 points and 9.3 rebounds as a freshman. She averaged 21.0 points and 9.3 rebounds as a sophomore, 16.7 points and 8.8 rebounds as a junior and \nShe played 17 games for the Sun in 2019 in just 7.1 minutes per game and was traded to Dallas, where she played an average of 12.9 minutes for the Wings over 10 games. She averaged a combined \nAnigwe said she could not be happier about the transaction. \n\n“Being back in California and playing on a team that I dreamed of playing on since I started playing basketball is like a dream come true,” she said. “Playing with legendary players, learning so much from the other two organizations that I was at — especially in Connecticut, where they ended up almost winning the championship — I learned so much from those veterans. \n“But now I have the opportunity just to play alongside so many great legends, I’m so excited.” \n\nConnecticut lost to Washington in five games in the 2019 WNBA Finals. \n\nThe Sparks are led by, among others, forward-center Candace Parker – a 12-year veteran who has played her entire career for the Sparks. Parker is a five-time All-Star, two-time league MVP and 2016 WNBA Finals MVP. \n"},"19":{"tilte":"\n\t\t\tBoxing making its comeback June 9 in Las Vegas\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/21\/boxing-making-its-comeback-june-9-in-las-vegas\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/0522_SPO_LDN-Z-BOXING-1.jpg?w=525","discription":"\nLAS VEGAS — Add boxing to the list of sports on the comeback trail. \n\nPromoter Bob Arum said Thursday he plans to stage a card of five fights on June 9 at the MGM Grand, the first of a series of fights over the next two months at the Las Vegas hotel. A second fight card will be held two nights later, with ESPN televising both cards, kicking off twice weekly shows at the hotel in June and July. \n\t\t\t\t\t\t\nNo fans will be allowed, and Arum said fighters and everyone else will be tested at least twice during fight week for the new coronavirus. The fights are pending approval of the Nevada Athletic Commission, which meets next week to consider the events, along with two cards that the UFC plans to stage at its facility in Las Vegas. \n\nThey are also pending the reopening of the MGM and other Las Vegas hotels, something that is widely expected to happen the first week of June, though no dates for a second phase of easing virus restrictions have been announced by Nevada Gov. Steve Sisolak. \n“Once we get those fights in and UFC gets its initial fights in, both of us will ask for additional dates,” Arum told The Associated Press. “The key was getting enough testing, and we’ve got plenty of testing in Nevada to hold our events.” \n\nIn addition to Arum’s fights, British promoter Eddie Hearn said this week he plans to hold fights beginning sometime in July from the backyard garden of the family mansion outside London where he was raised. Hearn told The Athletic that the first fight card is tentatively set for July 15. \n\nGolden Boy promoter Oscar De La Hoya has also talked about returning with a July 4 card, though he has offered no details. UFC returned to action earlier this month with cards in Florida, including a pay-per-view event, that took place without fans. \n\nArum declined to say who would be fighting on June 9, saying ESPN wanted to make the announcement after the fights are approved. But he said the cards would feature the same quality of fighters who were on ESPN before the shutdown of sports around the world. \n\nThe cards would be expanded to three-hour shows, Arum said, and feature a main event, a co-main and three supporting fights. \n“These will be the same guys we were going to have before to the extent possible,” he said. “Guys like (Olympic medalist) Shakur Stevenson and others who would have been fighting on our cards.” \n\nStevenson was set to headline a Top Rank card in March at Madison Square Garden when it was called off at the last minute because of the pandemic. Another Top Rank fighter, Ireland’s Michael Conlan, was to fight in New York on St. Patrick’s Day, but Arum said Conlan won’t be on the upcoming cards because he’s unable to travel from Ireland. \n\nArum said fighters and cornermen will be tested when they arrive in Las Vegas the week of the fight and will be housed on a “bubble” floor at the MGM Grand. They will be allowed out only to eat at an approved restaurant in the hotel or to train at the Top Rank gym. \n\nFighters will also be tested the night before they fight. The double tests should eliminate the issue the UFC had when a fighter tested positive and was removed from the UFC 249 card, Arum said. \n\n“Our protocols will be much more stringent than UFC had in Florida,” Arum said. “In ours you wouldn’t have a fighter testing positive the day of the fight or the day before.” \n\nArum credited Jim Murren, the former MGM CEO who leads a state task force dealing with the virus, with making sure there are enough tests available for fighters, judges, commissioners and anyone else involved on site. He said 60-70 people may be tested on fight day alone, using tests that can give results in a couple hours. \n\nWhile pre-pandemic fights were held in the 16,000-seat MGM Grand Garden, Arum said the fights will be held in a convention area or ballroom at the hotel. There will be no media allowed, at least at the beginning, he said, because of the logistical difficulty of testing more people. \n\nArum’s Top Rank has a long-term deal with ESPN for fights that before the pandemic hit were on the main network and streaming service ESPN+. The network also combined with Fox to televise the pay-per-view of the Tyson Fury-Deontay Wilder heavyweight title card in February that was Top Rank’s last card. \n\nArum said he talked to Fury on Thursday and that plans are underway to hold the rematch – probably somewhere outside the U.S. – late this year. He said there are also still plans for a highly anticipated lightweight title unification fight between Vasiliy Lomachenko and Teofimo Lopez by the end of the year. \n  \n\t\t\t"},"20":{"tilte":"\n\t\t\tU.S. Olympic and Paralympic Committee announces layoffs, furloughs\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/21\/usopc-announces-layoffs-furloughs\/","img":"https:\/\/images.pexels.com\/photos\/518543\/pexels-photo-518543.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940","discription":"\nU.S. Olympic and Paralympic Committee CEO Sarah Hirshland told her staff Thursday that the organization is eliminating 51 positions and that another 33 employees have been placed on furlough. \n\nHirshland said last month that the organization needed to reduce expenses by 10 to 20 percent over the 2020-2024 quad to offset the financial impact of postponing the Olympic Games in Tokyo originally scheduled for this summer, and the COVID-19 pandemic. \n\t\t\t\t\t\t\nThe USOPC is also facing a series of lawsuits related to the organizations and some of the national governing bodies under its umbrella such as USA Gymnastics, USA Swimming and USA Taekwondo. \n\nThe USOPC listed $322.86 million in revenue and $275.1 million in expenses in an Internal Revenue Service filing for the fiscal year 2018, the most recent year available. The organization spent $7.64 million on compensation for executives and top officers, $37.7 million on other salaries and wages, and $7.5 million in pension contributions and other benefits in 2018. The USOPC also listed $13.6 million in legal fees for 2018. \nThe USOPC listed $336.6 million in assets in the filing. \n\nThe following is Hirshland’s letter to USOPC employees: \n\nTeam, \n\nAs each of us processes the emotions of today, I hope that you have found some time to connect with colleagues and friends. Our relationships are so important as we navigate tumultuous times together. Thank you for making this a priority and investing a little extra time to take care of yourself and one another. \n\nToday we notified 51 team members that their positions have been eliminated and another 33 that their roles have been placed on furlough. In addition, we have ended the assignments of 23 temporary workers and offered 32 team members a reassignment opportunity that provides them a different role from the one they had previously occupied. \nI am overwhelmed by the magnitude of this change. It is significant. \n\nYou deserve to understand the decisions we made and how our organization, Team USA athletes and NGBs will be impacted. You may remember that on April 21st we came together to discuss the impact of the Tokyo Games postponement and the COVID 19 virus on our organization’s financial stability. I explained that the revenue we projected to collect this year, and in future years, would decline. As a result of that, we decided to proactively reduce our expenses by 10-20% over the 2020-2024 timeframe to ensure we will be able to deliver against our mission and serve Team USA athletes for years to come. We defined the principles that would guide our decisions and promised to complete our evaluation by the end of May – and I also told you that everything was on the table, including layoffs and furloughs. \n\nOver the past four weeks our leaders have worked with the support of a cross-functional team from finance, strategy and business consulting, and people and culture to evaluate their strategic priorities, operational mandates, current budgeted investments and the skills and people required to accomplish their objectives over the next 4.5 years. They did this evaluation with the goal of finding the necessary efficiency to reach our target reduction. \n\nDuring this time, we have also continued to learn more about the future and the challenges we all face in returning to work, to training and to events and competitions. It has become clear that it will take months, and not weeks, for us to return to full operation, particularly at our training centers in Colorado Springs and Lake Placid. We are adapting, even more than we had imagined, to a new way of operating and we cannot predict how long it will take before we have clarity on what the future holds. \n\nThis reality, coupled with the economic challenges that are impacting our revenue, have led us to identify several areas where we will reduce our planned investments over the remainder of this year and throughout the next quadrennial. \n\nNext Tuesday morning we will review these planned changes in more detail during a virtual Town Hall. For today, our focus will remain on our team members. \n\nMany of you have already discussed the changes that will occur within your team with your managers. If you have not, you will have the opportunity to do so soon. For some, there will be a lot of change and for others, there will be little or no change at all. But all of us will need to adapt to a smaller team, new accountabilities, and a different structure. That process will take some time and a good bit of patience. \n\nAt the end of a difficult day, and a tough month, we must all be asking ourselves if something that feels so awful is necessary and right. \n\nI believe that these actions are the right ones. All of this will make the difference. Because it isn’t one thing that will determine our success. It is the right combination of mission, values, strategic focus, discipline, talent, and fiscal responsibility and efficiency that will define our success. These actions will: \n\n1.       Sustain the resources required for Team USA athletes to achieve competitive success \n\n2.       Support Team USA athletes in new ways off the field of play through health and wellness, engagement, and a deeper commitment to safety than ever before \n\n3.       Deliver an exceptional experience for the Team USA Delegation at three Games over a four-year timeframe \n\n4.       Invest in the strength and compliance of our partner NGBs so that they too can support Team USA athletes better than ever \n\n5.       Integrate our teams in innovative ways to optimize the impact of our voice and those of Team USA athletes as we, collectively, inspire our country \n\n6.       Reward our talented team members for delivering results and living by our values \n\n7.       Lay the foundation for a strong organization not only in the next quad, but the one after that in which we welcome the world to our home. \n\nWe owe it to Team USA and all our supporters. Today and for years to come. \n\nI look forward to being with all of you on Tuesday. \n\nSarah \n\n  \n  \n\t\t\t"}}