{"1":{"tilte":"\n\t\t\t13 arrested at protest of George Floyd’s death in Rancho Cucamonga\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/more-than-100-protest-george-floyds-death-in-rancho-cucamonga\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/IDB-L-RC-PROTEST-0530-06CY-1-1.jpg?w=481","discription":"\nHundreds gathered and at least 13 people were arrested in Rancho Cucamonga Friday night, May 29, at a protest over the \nFloyd, 46, was an unarmed black man who died on May 25 in police custody after a Minneapolis officer kneeled on his neck. The \nRancho Cucamonga police form a line as protesters walk towards them during a rally observing the death of George Floyd in Rancho Cucamonga on Friday, May 29, 2020.  A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nHundreds gathered Friday night, May 29, 2020, in Rancho Cucamonga to protest the death of George Floyd, an unarmed black man who was killed this week while in police custody in Minneapolis. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nA demonstrator gets close and tells Rancho Cucamonga police how to do their job form a line as during a  Rancho Cucamonga protest for the death of George Floyd on Friday, May 29, 2020.  A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nThe Black Lives Matter protests get confrontational with demonstrators walking towards police and earlier throwing water bottles as they protest the death of George Floyd. A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nA Rancho Cucamonga officer sprays tear gas as George Floyd protesters near in Rancho Cucamonga on Friday, May 29, 2020.  A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nRancho Cucamonga police form a line as a protesters gets close and during a rally observing the death of George Floyd in Rancho Cucamonga on Friday, May 29, 2020.  A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nProtesters take over Foothill Ave. at Day Creek and walk towards a police line in Rancho Cucamonga on Friday, May 29, 2020. They chant “George Floyd” who died when a former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nRancho Cucamonga law enforcement form a line as demonstrators throw bottles and confront during a George Floyd protest over his death on Friday, May 29, 2020. A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nMore than 500 Black Lives Matter protesters chant from high and low gather for George Floyd in Rancho Cucamonga on Friday, May 29, 2020. Floyd died when (former) Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly 9 minutes. Ex-Officer Chauvin is charged with murder. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nA poster of George Floyd leads the way at a Black Lives Matter protest at Foothill Blvd. and Day Creek in Rancho Cucamonga on Friday, May 29, 2020.  The death occurred on May 25 when Derek Chauvin, a Minneapolis police officer, kneeled on Floyd’s neck for 8 minutes and 46 seconds. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nA passenger applauds Black Lives Matter protesters chanting, “I can’t breath” referring to George Floyd’s death at a Rancho Cucamonga demonstration on Friday, May 29, 2020. Floyd died May 25 when Derek Chauvin, a Minneapolis police officer, kneeled on Floyd’s neck for 8 minutes and 46 seconds. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nProtesters confront Rancho Cucamonga law enforcement with arms up while others threw water bottles during a protest of George Floyd death on Friday, May 29, 2020.  A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nProtester try to interact with Rancho Cucamonga law enforcement in Rancho Cucamonga on Friday, May 29, 2020. They protest the death of George Floyd. A former Minneapolis police officer Derek Chauvin knelt on Floyd’s neck for nearly nine minutes. (Photo by Cindy Yamanaka, The Press-Enterprise\/SCNG)\n\nIn Rancho Cucamonga, protesters lined the sidewalks Friday evening holding signs — “We are not trying to start a race war. We are trying to end it,” “Say his name. George Floyd,” — and chanting “No justice. No peace. No racist police,” and “Black lives matter.”\nThe gathering started peaceful, as about 500 people turned out at the intersection of Foothill and Day Creek boulevards to protest police violence and to support the Black Lives Matter movement.\nBut tension rose a few hours later, when deputies warned protesters to disperse or they would be arrested. There were 13 arrests as of 11:30 p.m., but it was still an active scene, said Deputy Olivia Bozek, a spokeswoman for the San Bernardino County Sheriff’s Department.\nThe charges against those arrested were not immediately known.\nAs night grew near, the protest began to grow more tense. People began to trickle onto city streets. Some threw water bottles at Sheriff’s Department vehicles driving by the crowd. The vehicles drove away.\nVehicles honked to show their support while passing through the intersection.\nAt about 7 p.m., Bozek said that the protest had been peaceful.\nShortly after, the water bottles had been thrown, and a Sheriff’s Department helicopter circling overhead told the crowd to disperse, but the protesters remained.\nDeputies wearing riot gear and protesters were face-to-face by 8 p.m. on Foothill Boulevard, west of Day Creek. The crowd had begun to dissipate and fewer than 100 protesters remained. The chants continued, but a deputy warned the remainder of the crowd to disperse.\n“If you do not immediately disperse, you will be arrested,” he told protesters.\nBy 10:45 p.m., the area had emptied out.\nIn Fontana on Thursday, the nine people were arrested when protesters began throwing rocks at businesses, cars and officers, according to police. Officers used foam rounds and tear gas, police said, and the protest cleared up at around midnight."},"2":{"tilte":"\n\t\t\tValley church leaders say they support protests, demand justice for George Floyd\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/valley-church-leaders-say-they-support-protests-demand-justice-for-george-floyd\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-PROTEST-RESEDA-0530-02-SR-1-1.jpg?w=526","discription":"\nJames Thomas, professor at Cal State LA and a Black Lives Matter member, speaks during a press conference denouncing the death of George Floyd while in police custody and the fragile state of racial relations in the San Fernando Valley outside the Reseda Church of Christ on Friday, May 29, 2020. (Photo by Sarah Reingewirtz, Los Angeles Daily News\/SCNG)\n\nCongressman Tony Cárdenas, speaks during a press conference denouncing the death of George Floyd while in police custody and the fragile state of racial relations in the San Fernando Valley outside the Reseda Church of Christ on Friday, May 29, 2020. (Photo by Sarah Reingewirtz, Los Angeles Daily News\/SCNG)\n\nLAPD Deputy Chief Jorge Rodriguez, of the Valley Bureau, speaks during a press conference denouncing the death of George Floyd while in police custody and the fragile state of racial relations in the San Fernando Valley outside the Reseda Church of Christ on Friday, May 29, 2020. (Photo by Sarah Reingewirtz, Los Angeles Daily News\/SCNG)\n\nRev. Dewayne Winrow leads a press conference to denounce the death of George Floyd while in police custody and the fragile state of racial relations in the San Fernando Valley outside the Reseda Church of Christ on Friday, May 29, 2020. (Photo by Sarah Reingewirtz, Los Angeles Daily News\/SCNG)\n\nCongressman Tony Cárdenas, speaks during a press conference denouncing the death of George Floyd while in police custody and the fragile state of racial relations in the San Fernando Valley outside the Reseda Church of Christ on Friday, May 29, 2020. (Photo by Sarah Reingewirtz, Los Angeles Daily News\/SCNG)\n\nRosalind Scarbrough, president of the San Fernando Valley NAACP, speaks during a press conference denouncing   the death of George Floyd while in police custody and the fragile state of racial relations in the San Fernando Valley outside the Reseda Church of Christ on Friday, May 29, 2020. (Photo by Sarah Reingewirtz, Los Angeles Daily News\/SCNG)\n\nCongressman Tony Cárdenas, speaks during a press conference denouncing the death of George Floyd while in police custody and the fragile state of racial relations in the San Fernando Valley outside the Reseda Church of Christ on Friday, May 29, 2020. (Photo by Sarah Reingewirtz, Los Angeles Daily News\/SCNG)\n\nLeaders of the Christian faith in the San Fernando Valley echoed national outcry Friday, May 29, over the \n“We align ourselves with those who seek to express outrage against the unjust killing of black men,” said Senior Minister of the Reseda Church of Christ Dewayne Winrow to local media.\nHe demanded the officer seen on video using his knee to pin down Floyd before he died be charged and prosecuted, and for sensitivity training to be put in place to enact systemic changes in police departments across the nation.\nThe church leaders called the press conference hours before the former police officer Derek Chauvin, who is white, was arrested and charged with murder. Several speakers denounced any non-peaceful actions by protesters.\nThe Valley is far from immune from fraught relations between police and the black community, Winrow noted, highlighting two cases of police involved killings of black men who belonged to his church including James Mincey Jr. who died in 1982 by police chokehold.\nSince the video of Floyd’s death circulated widely, Minneapolis has seen days of growing unrest in recent days that escalated in the burning of a police station Thursday. Similar protests have \nFloyd’s death also came amid outrage over the death of Ahmaud Arbery, who was fatally shot Feb. 23 in Georgia after a white father and son pursued the 25-year-old black man they had spotted running in their subdivision. More than two months passed before charges were brought.\n“How many times are we gonna be here at a press conference dealing with this issue over and over again,” asked local NAACP president Rosalind Scarborough. “What happens when the cameras stop rolling? We need to roll up our sleeves and put policies in place that truly deal with the systemic issues of racism.”\nRep. Tony Cardenas, D-Panorama City,  echoed the need to push back against institutional racism in the context of his personal experiences, pointing to discrimination he faced as a young Latino man from authority figures like teachers and police.\n“I live a blessed life. I was born in the U.S. But growing up in Pacoima in the San Fernando Valley, I didn’t feel equal,” he said.\nValley deputy chief of the L.A Police Department Jorge Rodriguez also denounced what “the use of excessive force, the lack of passion and lack of proper treatment” seen in Minneapolis.\nThe LAPD, he said, underwent a one-day inclusivity training session two years ago and officers receive yearly 8-hour online training on race relations.\nOn ongoing protests, Rodriguez said law enforcement is seeing some signs of rioting at recent protests over Floyd’s death that are likely to continue.\nThe department has come under scrutiny by left-leaning activists in the city who have decried a planned increase to the police department budget amid cuts to social services spurred by the pandemic.\n“I tell everyone, you have your first amendment right and I will encourage you use it,” he said. “We’ve had some aggression. What we plan to do is deal with those factions specifically and remove them as calmly and quietly as we can.”"},"3":{"tilte":"\n\t\t\tSenior Living: Aging skin and how to protect it\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/senior-living-aging-skin-and-how-to-protect-it\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/SeniorLivingBeach-9.jpg?w=597","discription":""},"4":{"tilte":"\n\t\t\tProtests, some violent, spread nationally in wake of George Floyd death\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/protests-some-violent-spread-nationally-in-wake-of-george-floyd-death\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/AP20151031263305-1.jpg?w=525","discription":"\n Demonstrators marched, stopped traffic and in some cases lashed out violently at police as protests erupted Friday in dozens of U.S. cities following the killing of George Floyd after a white officer pressed a knee into his neck while taking him into custody in Minnesota. In Phoenix, Denver, Las Vegas, Los Angeles and beyond, thousands of protesters carried signs that said: “He said I can’t breathe. Justice for George.” They chanted “”No justice, no peace” and “Say his name. George Floyd.”\nAfter hours of peaceful protest in downtown Atlanta, some demonstrators suddenly turned violent, smashing police cars, setting one on fire, spray-painting the iconic logo sign at CNN headquarters, and breaking into a restaurant. The crowd pelted officers with bottles, chanting “Quit your jobs.”\nAt least three officers were hurt and there were multiple arrests, Atlanta police spokesman Carlos Campos said. Campos said protesters shot BB guns at officers and threw bricks, bottles and knives at them. People watched the scene from rooftops, some laughing as skirmishes broke out.\nMayor Keisha Lance Bottoms passionately addressed the protesters at a news conference: “This is not a protest. This is not in the spirit of Martin Luther King Jr.”\n“You are disgracing our city,” she told protesters. “You are disgracing the life of George Floyd and every other person who has been killed in this country. We are better than this. We are better than this as a city. We are better than this as a country. Go home, go home.”\nBottoms was flanked by rappers T.I. and Killer Mike, as well as King’s daughter, Bernice King.\nKiller Mike cried as he spoke.\n“We have to be better than this moment. We have to be better than burning down our own homes. Because if we lose Atlanta what have we got?” he said.\nAfter Mayor Bottoms appealed for calm, the violence continued. More cars were set on fire, a Starbucks was smashed up, the windows of the College Football Hall of Fame were broken, and the iconic Omni Hotel was vandalized.\nProtesters gathered outside the White House, with President Donald Trump inside, and some tried to push through barriers set up by the U.S. Secret Service along Pennsylvania Avenue.\nIn Minneapolis, a curfew did little to stop protesters and others from gathering in several areas of the city, including the battered Lake Street neighborhood where a police precinct was burned the night before. There were scattered small fires and some stores in a strip mall were being broken into near the city’s 5th Precinct.\nAn initially peaceful demonstration in New York City spiraled into chaos as night fell, as protesters skirmished with officers, destroyed police vehicles and set fires.\nIn Brooklyn, activists who had marched from Manhattan chanted insults at officers lined up outside the Barclays Center and pelted them with water bottles. Police sprayed an eye-irritating chemical into the largely diverse crowd multiple times, then cleared the plaza.\nVideo posted to social media showed officers using batons and shoving protesters down as they took people into custody and cleared streets.\nDemonstrators rocked a police van, set it ablaze, then scrawled graffiti across its charred hulk and set it on fire a second time as officers retreated from the area. Blocks away, protesters used a club to batter another police vehicle.\nNumerous people were arrested and police brought in buses to carry off those they arrested.\n“We have a long night ahead of us in Brooklyn,” Mayor Bill de Blasio tweeted. “Our sole focus is deescalating this situation and getting people home safe. There will be a full review of what happened tonight. We don’t ever want to see another night like this.”\nThe police department said numerous officers were injured, including one who had a tooth knocked out.\nThe names of black people killed by police, including Floyd and Eric Garner, who died on Staten Island in 2014, were on signs carried by those in the crowd, and in their chants.\n“It’s my duty to be out here,” said Brianna Petrisko, among those at Foley Square in lower Manhattan, where most were wearing masks amid the coronavirus pandemic. “Our country has a sickness. We have to be out here. This is the only way we’re going to be heard.”\nIn Houston, where George Floyd grew up, several thousand people rallied in front of City Hall. Among them was 19-year-old Jimmy Ohaz, who came from the nearby city of Richmond, Texas.\n“My question is how many more, how many more? I just want to live in a future where we all live in harmony and we’re not oppressed.”\nTensions rose in several West Coast cities as night fell.\nAbout 1,000 protesters gathered in Oakland at a demonstration billed on social media as a rally to “F(asterisk)(asterisk)(asterisk) the police,” and some windows were smashed.\nDemonstrators shut down a freeway in Los Angeles amid isolated scuffles with police that ended in a few protesters detained and one officer receiving medical treatment, police said. An LAPD vehicle had its windows smashed, and CNN reported that someone wrote “killer” on a patrol car.\nProtesters repeatedly clashed with police in the Silicon Valley city of San Jose, said Mayor Sam Liccardo, and police responded with flash-bang grenades and rubber bullets. One officer was being treated at a hospital for an injury that was not life-threatening, he and police officials said.\nLiccardo said his own officers shared the community’s outrage over Floyd’s in-custody death.\n“It was a horrible injustice. I’d venture to guess that every police officer out there feels much of the same anger about what happened in Minneapolis,” he told The Associated Press.\nThirty miles to the west, Santa Cruz police chief Andrew G. Mills said in a statement that the actions by Minneapolis officers in Floyd’s death “are the antithesis of what we view as good policing.”"},"5":{"tilte":"\n\t\t\tProtesters march Friday in Los Angeles, shut down 110 Freeway, amid growing anger nationwide over George Floyd’s death\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/protesters-march-again-friday-night-in-los-angeles-amid-growing-anger-nationwide-over-george-floyds-death\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/LDN-L-LA-PROTEST-009-0530-1.jpg?w=525","discription":"\nDuring a third night of protests in downtown Los Angeles on Friday, in angry response to the death of George Floyd, protesters clashed with police and shut down the 110 Freeway.\nWhat had begun as a group of about 70 protesters walking along streets and doing sit-ins at downtown intersections amid traffic devolved later in the evening into violent confrontations with police officers.\nA least two Los Angeles police officers were injured in skirmishes with protesters, officials said.\nPolice officers move forward to clear the street during a protest for George Floyd, in downtown Los Angeles, Friday, May 29, 2020. Protests continued following the death of George Floyd, who died after being restrained by Minneapolis police officers on Memorial Day. (AP Photo\/Ringo H.W. Chiu)\n\nTwo women lie on the street with signs during a protest over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nProtesters run through smoke as police officers start firing rubber bullets during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nProtesters block a street with signs during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA protester holds a sign advising social distancing in front of police officers during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA police officer yells to protesters to back up during a demonstration over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody on Memorial Day in Minneapolis. (AP Photo\/Jae C. Hong)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nCalifornia Highway Patrol officers prepare to open a shut down northbound CA-110 freeway by protestors protesting the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nBy 9:30 p.m., LAPD declared an unlawful assembly for all of downtown Los Angeles, ordering everyone in the streets to immediately leave the area and urging residents to stay inside and businesses to close.\nJust hours after prosecutors in Minneapolis criminally \nEarlier Friday, former Minneapolis police Officer Derek Chauvin, who is white, was charged with third-degree murder and manslaughter in the death of Floyd, who is black. Activists who filled downtown streets said the charges were not enough.\n“I can’t breathe means first-degree,” the original crowd of more than 70 demonstrators shouted while marching from Los Angeles City Hall and down along Spring Street, demanding harsher charges and broader reform.\nProtesters outside of Los Angeles City Hall , Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters make their way down, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nA man blocks traffic as he walks down the middle of Spring Street in Los Angeles, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters block Spring Street outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters on Spring Street outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nCas Hunter, Van Nuys, holds a sign during a protest outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\nProtesters block Spring Street outside of Los Angeles City Hall, Friday, May 29, 2020. Protesters gathered in response to the killing of George Floyd, who died in Minneapolis while being arrested by police.  (Photo by Hans Gutknecht, Los Angeles Daily News\/SCNG)\n\n \nAs that crowd continued their march, employees of shuttered businesses applauded from behind metal blinds. Residents cheered from their apartment balconies. Cars passing by honked to the rhythm of the demonstrator’s chants.\nLos Angeles police officers on bikes rode in front of the marching group.\nDemonstrators occupied the intersection of Olympic Street and Figueroa Boulevard, halting traffic in the area. The group sat down and continued to hold signs, chanting Floyd’s name for several minutes before standing to continue their march.\nProtestors are staging a sit down in traffic at the Olympic and Figueroa intersection \n— Hunter Lee (@huntslee) \nLater in the evening, tensions rose as multiple groups took shape throughout downtown. Some protesters hurled glass bottles and other objects at police and officers responding by launching less-than-lethal rounds at crowds and shoving them back with riot shields.\nOther groups continued to sit on the pavement in quiet protest of police orders to disperse.\nAfter 7 p.m., dozens of protesters surged up Eighth Street and onto the 110 Freeway, halting traffic on north and southbound lanes until Olympic Boulevard, said California Highway Patrol Officer Elizabeth Kravig.\nCHP officers were able to disperse the crowds but within a half-hour a smaller group of protesters returned to the freeway, Kravig said. Television news broadcasts showed the marchers setting up a makeshift barricade in the northbound lanes.\nOne officer was injured by a flurry of protesters near Pershing Square on Fifth and Olive streets. The officer was transported to a local hospital in unknown condition, said LAPD Officer Drake Madison, spokesman for the department. A second officer was injured by a glass bottle thrown from a crowd that had gathered on 7th and Hope streets.\nProtesters confront police officers while blocking the 110 Freeway during a protest over the death of George Floyd Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nProtesters chant while blocking an intersection during a protest over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA man walks past graffiti during a protest over the death of George Floyd, Friday, May 29, 2020, in Los Angeles. Floyd died in police custody Monday in Minneapolis. (AP Photo\/Jae C. Hong)\n\nA demonstrator attacks a police car during a protest over the death of George Floyd in downtown Los Angeles, Friday, May 29, 2020. Floyd died in the custody of the Minneapolis police on Memorial Day. (AP Photo\/Ringo H.W. Chiu)\n\nDemonstrators shut down the northbound CA-110 freeway to protest the killing of George Floyd, in downtown Los Angeles Friday, May. 29, 2020. Los Angeles Police Department declared an unlawful assembly for a large swath of downtown L.A. from the 10 Freeway to the 101, and the 110 Freeway to Alameda Street. (AP Photo\/Damian Dovarganes)\n\nPeople demonstrate in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\nProtesters sit in the street in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\nPolice officers hold their position as protesters march by in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\nProtesters clash with police officers in Los Angeles, Friday, May 29, 2020, in protest over the death of George Floyd, who died in police custody on Memorial Day in Minneapolis. (AP Photo\/Christian Monterrosa)\n\n“I saw people start climbing on the bus stop and then crowds start running from the street and some guy is getting thrown by cops,” said Torie Dunda who was among the crowd of protesters who witnessed the skirmish on Olive Street. LAPD had not confirmed any arrests.\nAs rows of police officers continued pushing forward, shooting less-than-lethal rounds at the crowds, people began to slowly disperse, but lingered in looser groups long after the unlawful assembly had been announced.\nProtesters left in their wake buildings and police vehicles with graffiti throughout downtown. “We can’t breathe,” read some of the painted messages, along with anti-police slogans. Trash cans were strewn across roads. Some of the cans were lit on fire. Television news broadcasts showed crowds breaking into a Starbucks on 6th and Spring streets, shattering windows and damaging property inside.\nThe previous two days were marked by less \nFriday’s arrest of former-Minnesota police Officer Chauvin did little to quell their demands.\nProtesters make their way down Spring St in LA \n— Hans Gutknecht (@HansGutknecht) \n“It’s not about this cop. It’s about upending the whole system that’s created this,” said Ryan Valdez, a Norwalk resident who was among protesters. “This isn’t going to stop with George Floyd just like it wasn’t going to stop with Eric Garner until we, the people, do something about it.”\nEarlier in the evening, while protesters pushed on throughout downtown streets, before the worst of the violence, Mayor Eric Garcetti acknowledged demonstrators efforts in his nightly speech. Garcetti said protester’s rights will be protected, but he urged protesters not to violate laws.\nHe said Floyd “was murdered in cold blood in front of this nation.”\n“I share your resolve to not only declare that black lives matter, but to make that statement real in our policies and our politics in our policing in our laws,” Garcetti said. “And most of all, in our hearts.”\nProtestors stand in front of traffic along Spring Street in front of city hall. \n— Hunter Lee (@huntslee) \nActivists have flooded recent discussions in City Council at Garcetti’s proposed budget, calling on city leaders to scale back the police department budget, one of the few areas that has been preserved and not seen the cuts that have ravaged other departments.\nThe protest Friday marked the third day of demonstrations in the city. On Wednesday, two protesters were injured during the mostly peaceful demonstration organized by Black Lives Matter Los Angeles.\nAs protesters spilled \nA second protester was struck by a car in a possible hit-and-run while hundreds of demonstrators crossed a street near the LAPD Headquarters.\nWhile protesters on Friday evening caused damage to some buildings and other property in downtown Los Angeles, the scene in Minneapolis, Minn. and the nearby St. Paul proved to be more volatile.\nProtesters set fire to the Minneapolis Police Department’s Third Precinct on Thursday evening, burning other buildings, damaging banks and apartments, and looting from various local businesses.\n— Hunter Lee (@huntslee) \nThe next morning, Minnesota Gov. Tim Walz offered a sympathetic statement to protesters.\n“Minneapolis and St. Paul are on fire. The fire is still smoldering in our streets. The ashes are symbolic of decades and generations of pain, of anguish unheard,” Walz said, adding. “Now generations of pain is manifesting itself in front of the world — and the world is watching.”\nMinneapolis Mayor Jacob Frey said he understood the anger and pain, but added that the looting was unacceptable. The National Guard was called to the city help prevent further looting. Protesters in Minneapolis continued to call on authorities to bring charges against the other officers involved in Floyd’s arrest.\nChauvin was one of four officers fired this week after the lethal encounter with Floyd. The other three former Minneapolis police officers are still under investigation.\nEarlier in the evening in Los Angeles, protesters had spoke against the violence as several protesters began to agitate officers.\n“This isn’t what we’re here for, violence,” said Miss Rodriguez of Los Angeles. “We’re here for peace because that’s what George would want.”\nHundreds of protesters also took to the streets in Rancho Cucamonga "},"6":{"tilte":"\n\t\t\tMusic Center’s Spotlight Grand Finale with 14 teen finalists goes online Saturday\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/music-centers-spotlight-grand-finale-with-14-teen-finalists-goes-online-saturday\/","img":"https:\/\/i2.wp.com\/scng-dash.digitalfirstmedia.com\/wp-content\/uploads\/2020\/05\/Spotlight-Finalist-c-16x9may2020.jpg?fit=620%2C9999px&ssl=1","discription":"\n \nTalented teen finalists in the Music Center’s Spotlight program learned early on how entertainers need to be ready for challenges and changes. Their highly anticipated grand finale show is going online on Saturday, May 30 — but not on stage at the Music Center in downtown Los Angles.\nEarlier this year, due to coronavirus Safer at Home restrictions, the teens got a taste of the proverbial the-show-must-go-on when for their final round of auditions they had to submit an online video instead of performing an in-person audition.\nThe Music Center Spotlight Grand Finale will air online 7 p.m. Saturday, May 30 at \nTheir journey in the arts training and scholarship program began last September when nearly 1,400 teens from more than 260 schools in eight counties auditioned for a chance to be a part of the year-long program that includes extensive mentoring.\nThe arts categories include acting, ballet and non-classical dance, classical and non-classical voice and classical and jazz instrumental. The program, founded in 1988, has enabled 49,000 students to not only hone their performing skills but also gain work readiness skills and learn about careers in arts management.\nAll of this year’s applicants were able to attend the Spotlight Academy, a free, day-long series of seminars and workshops taught by professionals and arts educators. The teens then progressed through three rounds of auditions and attended master classes with one-on-one coaching.\nThe 14 students who made it through the auditions are each receiving $5,000 scholarships. Spotlight chooses two students per category.\nThe 2020 Spotlight finalists\nSpotlight also awarded the following students with Honorable Mention and a $1,000 scholarship award\nFor information on the Spotlight program and how to apply: \nThe Spotlight Grand Finale show is hosted by Tony Award winner and Spotlight alumna Lindsay Mendez (Broadway actress-singer) with special appearances by more Spotlight alumni including Misty Copeland (American Ballet Theatre), Josh Groban (singer-songwriter and actor), Matthew Rushing (associate artistic director with Alvin Ailey American Dance Theater) and Melinda Sullivan (dancer-choreographer).\nHow to watch the Music Center Spotlight Grand Finale: 7 p.m. Saturday, May 30 online at \n "},"7":{"tilte":"\n\t\t\tYearbooks capture pre-coronavirus world for Southern California students\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/yearbooks-capture-pre-coronavirus-world-for-southern-california-students\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/SBS-L-VIRUS-YEARBOOKS-0529-03-1.jpg?w=467","discription":"\nBefore they started snapping pictures, writing copy blocks and designing pages, 26 Chaparral High School students selected a theme for the 2019-20 yearbook.\n.\nApropos of the months ahead, Jackie Schmidt’s yearbook students, like thousands of other creative minds across Southern California, set out in the fall to capture in art and text the uniqueness of a school year barrelling toward an abrupt and unprecedented ending.\nIn March, as the \nMore than two months later, those campus scrapbooks are off the presses and finding their way into the hands of teens in dire need of something familiar during such unfamiliar times.\n“A yearbook is a legacy piece,” said Schmidt, now in her 12th year as yearbook adviser at Temecula’s Chaparral High. “It captures school history, but also is one of those things that students end up discussing at their 5-, 10-, 20-year reunion. We’re trying to capture best we can not only the senior experience, but the freshman experience, the sophomore experience, the junior experience.\n“We want to truly represent our entire student body’s experience with events that happened during the school year.”\nAs the main editor of the yearbook for Aquinas High School in San Bernardino, senior Sara Duran was responsible for about 75% of what can now be considered a time capsule to a pre-coronavirus, pre-COVID-19 world.\nWith hard deadlines throughout the school year, yearbook advisers and student editors like Duran dole out assignments so major seasonal activities such as dances, pep rallies and sporting events are covered. Similarly, senior portraits have to be handed in by a certain date, while prom, grad night and other year-end celebrations typically fall casualty to March and April deadlines.\n“We learned this year,” Duran said, “that time is very precious.”\nServite High School yearbook advisers Jen Emard and Andrea Watanabe have cultivated a classroom environment that bears a resemblance to a Fortune 500 company, with the two women serving as chief executive officers overseeing a major business project.\nYearbook students at the all-boys Catholic school in Anaheim learn the basics of project management, the two said, and are encouraged throughout the school year to reflect on what went right, what went wrong and what could be done better next time.\nAbove all, Emard and Watanabe said, kids have to take ownership of their projects to truly appreciate the process.\n“Yearbook is a real neat way to be connected to all aspects of the school,” Emard said. “Our kids are taking photos at sporting events, robotics competitions, theater. I don’t know any elective at Servite that puts kids in every classroom – English, math, history – and gives them the opportunity to interview teachers and students throughout the year.”\nWith the exception of a few pages for spring sports and activities, most pages in most yearbooks were complete when the coronavirus crisis \nHowever, work still remained.\nDuran, 17, and a few of her Aquinas classmates met virtually with students and teachers to go over and finish assignments. Schmidt, meanwhile, used Chaparral’s Blackboard communication tool to solicit student photos for the “Student life” spread and Emard and Watanabe said they had to reconfigure certain pages at the tail end of the yearbook to make up for lost content.\n“Our yearbook kids and their adviser worked so tremendously hard,” Rialto High principal Caroline Sweeney said. “There’s nothing in this yearbook that looks rushed or hurried. It looks like it has the same pride as every other year. Our yearbook kids just made it work because they were so committed to it being a good product.\n“They knew it was going to be history,” Sweeney added. “This yearbook will be the pandemic yearbook, it will.”\nWorking on deadline under such extreme conditions, Duran said, “got my creative juices flowing. I had to think hard about different pages and how I wanted them to look, what colors to use, how photos go with each other. These moments would be memories for students and I was able to make these memories last through the yearbook.\n“I had a lot of pride after finishing this.”\nAside from a sentence or two explaining why certain springtime pages were barer than usual, precious little ink in most 2019-20 yearbooks was spilled on the coronavirus pandemic or the subsequent school closures and statewide lockdowns.\nHowever, as relatively little impact as the virus had on completing these keepsakes, how and when they will be distributed to students amid the current public health crisis has changed entirely.\nYearbook students at Rialto High, for example, traditionally plan distribution parties during lunches to toast the year that was with ice cream, music and opportunities for friends to sign pages. Due to public health concerns, however, yearbooks are expected to be passed out safely on campus at a later date, with school officials brainstorming ways to celebrate the moment.\n“Our kids want the memory of this year,” said Sweeney, noting that Rialto High is close to selling out of yearbooks for the first time. “To me, (the yearbook) is one of our largest sources of pride. These are truly going to create one of the lasting memories for us.”\nAll Chaparral High yearbooks close with a note from one of the class’ editors.\nThis year, Schmidt’s graduating son, Jacob, had the honor.\nWhile most students will not see his message, or even know it is there, until they have a moment to sit down and thumb through the moments forever memorialized inside, Jacob Schmidt’s message of perseverance in these trying times quite literally closes the book on the most upside-down school year of all.\n“I’m proud of our kids, and I’m excited for our student body to get this,” Jackie Schmidt said. “We had a good year. It ended in something we couldn’t control, but this yearbook I truly believe is going to bring back super positive experiences. Students will be able to look back and remember that the last nine weeks were rough, but the first 27 were pretty fantastic.\n“We’ve all grown this year and our yearbook will capture that.”"},"8":{"tilte":"\n\t\t\tAs shutdowns lifts, what happens when wildlife exploring urban areas mix with humans return?\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/as-shutdowns-lifts-what-happens-when-wildlife-exploring-urban-areas-mix-with-humans-return\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/OCR-L-HBCOYOTE-0529-02-01-1.jpg?w=615","discription":"\nIt was an shocking sight as Huntington Beach resident Bob Daniel drove up Main Street after an early morning shooting video at the beach: A coyote strolling casually in downtown, an area typically busy with tourists and beachgoers just a few blocks from the Pacific Ocean.\nDaniel caught the moment on Wednesday, May 27, on camera as the coyote trotted past a stop sign, just across from Surf City Ale House.\n“I’ve seen plenty of coyotes here in H.B., but never one downtown,” he said. “This was unusual.”\nAs people have stayed home in recent months amid the coronavirus pandemic, wildlife has been exploring empty streets usually bustling with people. Reports of coyotes, in particular, have been spotted in once-popular streets of San Francisco to Chicago and beyond.\nBut as restrictions loosen up and more people are going outside, what will happen when the wildlife starts to mix with human’s return?\n“There’s not any more of the critters, but they are changing their behaviors,” said Eric Strauss, president’s professor of biology for Loyola Marymount University’s Center for Urban Resilience. “The wildlife in urban areas are always adjusting their behavior based on ours.”\nUrban wildlife, like coyotes, have become dependent on humans for food, finding scraps on the streets in the darkness or early morning hours, while most people sleep.\nDuring the coronavirus shutdown, “the abundant food resource got shut off in a matter of days. It changed the foraging dynamics, the risk analysis of what they should take in respect to searching for food,” Strauss said.\nAs people stayed indoors, our “center spots” were less used, allowing wildlife to expand their radius.\n“In almost every city, you’re reading some story about them walking in some area that had been historically dominated by humans,” Strauss said. “There’s no people, and there’s not as much food, so they are taking longer to search for food.\n“As we withdraw, more habitat becomes available for them to search for food,” he said. “Now they are showing up, there’s no people and no food. It takes longer to check out before they give up and go somewhere else.”\nPlus, people are at home looking out of their windows when they would otherwise be in offices focused instead on work and other distractions, Strauss noted.\nWhat we’re seeing during the coronavirus pandemic is “habitat fragmentation.”\n“When we back off a bit, we see them move into the new areas,” he said.\nWhen we move back outside, they will likely move away.\n“Some coyotes are getting bolder,” he said.\nIn Laguna Beach recently, authorities have been on the hunt for a coyote that bit a 91-year-old man who was picking up his newspaper in the driveway. Authorities \nRelocating a problem coyote is not an option because it only moves the problem to another neighborhood, California Department of Fish and Wildlife authorities say.\nStrauss and his students are working on a project that uses about 30 remote cameras set around Culver City, recording when movement, whether it be human or wildlife, is sensed. Thousands of photos are being generated a week, showing the exact time and place creatures are detected without interfering with their behavior.\n“What is their temporal use of land before the pandemic, through it and after?” Strauss wonders. “It will be very interesting to see.\n“I think what we are going to see we can tie into exact human events.”\nThe Huntington Beach coyote seemed to just be out for a stroll, as it trotted across Main Street and Olive Avenue, chasing a squirrel under a car, Daniel said.\n“He went around to the other side,” Daniel said, “and the squirrel got up a tree before the coyote could get breakfast.”"},"9":{"tilte":"\n\t\t\tLAX, Van Nuys airports braced for economic turbulence ahead\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/01\/lax-van-nuys-airports-braced-for-economic-turbulence-ahead\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/TDB-L-VIRUS-LAX-UPDATE-0325_33-1.jpg?w=525","discription":"\nThe financial outlook for Los Angeles World Airports remains gloomy, with a budget forecast for next year providing scenarios in which its revenues will continue to decline due to the COVID-19 pandemic.\nCommercial air traffic continues to be down about 95% compared to prior years at Los Angeles International Airport, according to Sean Burton, president of the Board of Airport Commissioners.\nLAWA, the umbrella of LAX and Van Nuys Airport, reported an average of 1,900 flights a day normally take place this time of year, but they’re down to about 400, and most of those are flights that ship cargo.\n“Even if we don’t end up planning for the worst-case scenario, the cuts will be deeper,” said Tatiana Starostina, LAWA chief financial officer, adding that while the budget cuts have been “very painful” to make, airport officials are working under economic uncertainty.\nStarostina presented two possible scenarios for air traffic in the near future, one that showed air traffic increasing steadily by December and then leveling off for the remainder of the fiscal year but still below traffic levels of early March. The second scenario showed almost no growth in air traffic until September and then steadily increasing by next summer.\nIn the first scenario, airport revenue next year would decline 15% compared to last year while expenses would also decline 10%. The second scenario showed the airport’s revenue declining 24% next year while expenses would remain the same.\nThis amounted to a projected revenue loss of about $239 million in the first scenario and about $376 million in the second.\nIt’s uncertain what kind of additional debt the airports could incur in the next year, as new contracts and construction projects are currently not being considered, but construction continues to take place throughout the airport facilities, Starostina said.\nThe end of this fiscal year is projected to see a about a 31% decline in total passengers compared to last fiscal year, Starostina said.\nThe budget proposals, however, did not account for money coming to LAX via the Coronavirus Aid, Relief, and Economic Security Act, or CARES Act, which allocated $326 million to LAX to mitigate its pandemic-related losses.\nTask forces working within LAWA have been addressing safety measures and ways to clean airport facilities, according to Justin Erbacci, interim CEO of LAWA.\n“Now our focus is on recovery,” Erbacci said. “There are many new things that we need to look at to try to see how we are going to get ourselves out of this current crisis. Internationally, there’s just not a lot of activity right now.”\nCutting additional costs may be the only way to do that, Burton said.\n“Obviously, these are projections. We don’t have control over the revenue side of this,” Burton said. “We have more control over the expense side of this. … To go down 24% in revenues and only 10% in expenses, that won’t work in the long run.”\nThe board has already revised agreements for airlines and commercial tenants at the airport to help them maintain business as well. The board also took action in March to put a stop on all new hiring until the pandemic measures are lifted.\nCommissioners said the board may need to starting figuring how to “make real sacrifices” in terms of contracts and expenditures it thought it would need in the next fiscal year.\nThe next Board of Airport Commissioners meeting, its first in May, will consist of a “deep dive” into budget details, LAWA officials said. The second meeting of the month will include commissioners’ feedback on the budget proposals and present finalized projected revenue and expenses.\nThe first meeting in June will be the presentation of the LAWA draft budget, which needs to be finalized by June 30."},"10":{"tilte":"\n\t\t\tClint Eastwood is turning 90, here’s some trivia to make your day\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/clint-eastwood-is-turning-90-heres-some-trivia-to-make-your-day\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/web-clint-1.jpg?w=567","discription":"\nLegendary Hollywood star Clint Eastwood turns 90 on Sunday. In honor of that milestone, we are taking a look at his stellar and sometimes controversial career.\nClinton Eastwood Jr. was born on May 31, 1930, in San Francisco. He was raised in Oakland, after moving from town to town as his father sought work during the Great Depression.\nIn his mid-20s, he landed uncredited bit parts in such B-films as “Revenge of the Creature” and “Tarantula” while paying the bills by digging swimming pools and driving a garbage truck. In 1958, he landed his first consequential acting role as Rowdy Yates in the long-running TV show “Rawhide.”\nEastwood’s roles in spaghetti westerns made him an international star, but that didn’t happen overnight. His first film directed by Sergio Leone was shot in 1964 but not seen in the U.S. until 1967-68 for copyright reasons.\nOnce he was back in the U.S., Eastwood’s career took off as a leading man and director.\nConsidering his long and storied career, we thought we would go ahead and make your day by testing your Eastwood knowledge.\nHere are nine trivia questions:\nA) Monterey\nB) Carmel\nC) Big Sur\nA) Walt Kowalski\nB) Bill Munny\nC) Harry Callahan\nA) “Any Which Way You Can”\nB) “Mystic River”\nC) “Magnum Force”\nA) “Play Misty for Me”\nB) “Richard Jewell”\nC) “The Gauntlet”\nA) “Million Dollar Baby”\nB) “Letters from Iwo Jima”\nC) “Unforgiven”\nA) “Blondie”\nB) “The Stranger”\nC) “Pardner”\nA) “Sudden Impact”\nB) “City Heat”\nC) “The Enforcer”\nA) Sally Field\nB) Shirley MacLaine\nC) Sondra Locke\nA) “Dirty Harry”\nB) “Sudden Impact”\nC) “The Good, the Bad and the Ugly”\nBTW: In 2005, the American Film Institute did a list of the 100 most famous movie quotes and the line “Go ahead — make my day” was ranked sixth.\nEastwood was one of the first people inducted in the \nThese are the highest-ranked films of Eastwood’s career on the movie site \nYou can hear Clint sing several songs and other "},"11":{"tilte":"\n\t\t\tFormer Minneapolis police officer charged with murder of George Floyd\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/29\/minneapolis-officer-in-george-floyds-death-under-arrest\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/APTOPIX-Minneapolis-Police-Death-1.jpg?w=525","discription":"\nBy TIM SULLIVAN and AMY FORLITI\nMINNEAPOLIS — The police officer who was seen on video kneeling on the neck of George Floyd, a handcuffed black man who died in custody after pleading that he could not breathe, was arrested Friday and charged with murder in a case that sparked protests across the United States and violence in Minneapolis.\nHennepin County Attorney Mike Freeman said Derek Chauvin was charged with third-degree murder and manslaughter. Freeman did not provide immediate details, but said a criminal complaint would be made available later Friday and that more charges were possible.\nIn the video, Chauvin is seen kneeling on Floyd’s neck as Floyd is on the ground. He gradually becomes motionless as Chauvin and three other officers ignore bystanders’ shouts to get off him. Freeman said the investigation continues into the other three officers, but that authorities “felt it appropriate to focus on the most dangerous perpetrator.”\nFreeman highlighted the “extraordinary speed” in charging the case just four days after Floyd’s death, but also defended himself against questions about why it did not happen sooner. He said his office needed time to put together evidence, including what he called the “horrible” video by a bystander. He said he would not bring a case unless he had enough evidence to prove the charges beyond a reasonable doubt.\nProtests in Minneapolis escalated in violence on Thursday, when demonstrators torched a police station that officers had abandoned.\n“I’m not insensitive to what happened in the streets,” Freeman said. “My own home has been picketed regularly.”\nNews of the arrest came moments after Minnesota Gov. Tim Walz acknowledged the “abject failure” of the response to the protests and called for swift justice for officers involved. Walz said the state would take over the response to the violence and that it’s time to show respect and dignity to those who are suffering.\n“Minneapolis and St. Paul are on fire. The fire is still smoldering in our streets. The ashes are symbolic of decades and generations of pain, of anguish unheard,” Walz said, adding. “Now generations of pain is manifesting itself in front of the world — and the world is watching.”\nThe governor cited a call he received from a state senator who described her district “on fire, no police, no firefighters, no social control, constituents locked in houses wondering what they were going to do. That is an abject failure that cannot happen.”\nHis comments came the morning after protesters torched a police station that officers abandoned during a third night of violence. Livestream video showed protesters entering the building, where intentionally set fires activated smoke alarms and sprinklers. President Donald Trump threatened action, tweeting “when the looting starts, the shooting starts,” which prompted a warning from Twitter for “glorifying violence.”\nThe governor faced tough questions after National Guard leader Maj. Gen. Jon Jensen blamed a lack of clarity about the Guard’s mission for a slow response. Walz said the state was in a supporting role and that it was up to city leaders to run the situation. Walz said it became apparent as the 3rd Precinct was lost that the state had to step in, which happened at 12:05 a.m. Requests from the cities for resources “never came,” he said.\n“You will not see that tonight, there will be no lack of leadership,” Walz said.\nOn Friday morning, nearly every building in the shopping district around the abandoned police station had been vandalized, burned or looted. National Guard members were in the area, with several of them lined up, keeping people away from the police station.\nDozens of volunteers swept up broken glass in the street, doing what they could to help.\nDean Hanson, 64, lives in a subsidized housing unit nearby, which is home to many older residents. He said his building lost electricity overnight, and residents were terrified as they watched mobs of people run around their neighborhood, with no apparent intervention.\n“I can’t believe this is happening here,” he said.\nDozens of fires were also set in nearby St. Paul, where nearly 200 businesses were damaged or looted. Protests spread across the U.S., fueled by outrage over Floyd’s death, and years of violence against African Americans at the hands of police. Demonstrators clashed with officers in New York and blocked traffic in Columbus, Ohio, and Denver.\nTrump threatened to bring Minneapolis “under control,” calling the protesters “thugs” and tweeting that “when the looting starts, the shooting starts.” The tweet drew another warning from Twitter, which said the comment violated the platform’s rules, but the company did not remove it.\nTrump also blasted the “total lack of leadership” in Minneapolis.\nA visibly tired and frustrated Minneapolis Mayor Jacob Frey made his first public appearance of the night early Friday at City Hall and took responsibility for evacuating the precinct, saying it had become too dangerous for officers. As Frey continued, a reporter cut across loudly with a question: “What’s the plan here?”\n“With regard to?” Frey responded. Then he added: “There is a lot of pain and anger right now in our city. I understand that … What we have seen over the past several hours and past couple of nights here in terms of looting is unacceptable.”\nHe defended the city’s lack of engagement with looters — only a handful of arrests across the first two nights of violence — and said, “We are doing absolutely everything that we can to keep the peace.” He said National Guard members were stationed in locations to help stem looting, including at banks, grocery stores and pharmacies.\nThe Minnesota State Patrol arrested a CNN television crew early Friday as the journalists reported on the unrest. While live on air, CNN reporter Omar Jimenez was handcuffed and led away. A producer and a photojournalist for CNN were also taken away in handcuffs.\nThe Minnesota State Patrol said the journalists were among four people arrested as troopers were “clearing the streets and restoring order,” and they were released after being confirmed to be media members. CNN said on Twitter that the arrests were “a clear violation of their First Amendment rights.” Walz publicly apologized on Friday.\nAttorney Benjamin Crump, who is representing members of Floyd’s family, called for an independent investigation, and said he asked to take custody of Floyd’s body to have an independent autopsy performed. Floyd said that talk of a heart condition or asthma is irrelevant because Floyd was walking and breathing before his contact with police.\nThe doctor who will do the autopsy is Michael Baden, former chief medical examiner of New York City, who was hired to do an autopsy for Eric Garner as well.\nIn New York City, protesters defied New York’s coronavirus prohibition on public gatherings Thursday, clashing with police, while demonstrators blocked traffic in downtown Denver and downtown Columbus. A day earlier, demonstrators had taken to the streets in Los Angeles and Memphis.\nAbout 10 protesters went to a Florida home believed to belong to Chauvin. The Orange County Sheriff’s Office tweeted Friday that Chauvin was not at the residence and has no plans to be in the area.\nIn Louisville, Kentucky, police confirmed that at least seven people had been shot Thursday night as protesters demanded justice for Breonna Taylor, a black woman who was fatally shot by police in her home in March.\nIn Mississippi, the mayor of the community of Petal resisted calls to resign following his remarks about Floyd’s death. Hal Marx, a Republican, asked on Twitter: “Why in the world would anyone choose to become a police officer in our society today?” In a follow-up tweet, he said he “didn’t see anything unreasonable.”\nThe city on Thursday released a transcript of the 911 call that brought police to the grocery store where Floyd was arrested. The caller described someone paying with a counterfeit bill, with workers rushing outside to find the man sitting on a van. The caller described the man as “awfully drunk” and said he was “not in control of himself.”\nAsked by the 911 operator whether the man was “under the influence of something,” the caller said: “Something like that, yes. He is not acting right.” Police said Floyd matched the caller’s description of the suspect.\nState and federal authorities are investigating Floyd’s death.\nChauvin, the officer who knelt on Floyd’s neck, was fired Tuesday, along with three other officers involved in the arrest.\nThe owner of a popular Latin nightclub said that Floyd and Chauvin both worked as security guards at the club as recently as the end of last year, but it’s not clear whether they worked together. Chauvin worked at the El Nuevo Rodeo club as an off-duty security guard for nearly two decades, but Floyd had only worked there more recently for about a dozen events that featured African-American music, Maya Santamaria told The Associated Press.\nSantamaria said if Chauvin had recognized Floyd, “he might have given him a little more mercy.”\nSantamaria, who sold the venue within the past two months, said Chauvin got along well with the regular Latino customers, but did not like to work the African American nights. When he did, and there was a fight, he would spray people with mace and call for police backup and half-dozen squad cars would soon show up, something she felt was unjustified “overkill.”\n___"},"12":{"tilte":"\n\t\t\tChinese lawmakers endorse Hong Kong national security law\t\t","link":"https:\/\/www.dailynews.com\/2020\/05\/28\/chinese-lawmakers-endorse-hong-kong-national-security-law\/","img":"https:\/\/www.dailynews.com\/wp-content\/uploads\/2020\/05\/China_Congress_13601-1.jpg?w=525","discription":"\nBy JOE McDONALD\nBEIJING — China’s legislature endorsed a national security law for Hong Kong on Thursday that has strained relations with the United States and Britain and prompted new protests in the territory.\nThe National People’s Congress approved the bill as it wrapped up an annual session that was held under intensive anti-coronavirus controls. The vote was 2,878-1 with six abstentions, in line with the high-profile but largely ceremonial body’s custom of near-unanimous support for all legal changes decided by the ruling Communist Party.\nThe law will alter Hong Kong’s mini-constitution, or Basic Law, to require the territory to enforce measures to be decided by the NPC’s standing committee, a small body controlled by the ruling party that handles most lawmaking work.\nThe law reflects the determination of President Xi Jinping’s government to tighten control over Hong Kong following 11 months of anti-government protests. Activists in Hong Kong say the law will undermine the “high degree of autonomy” promised to the former British colony when it was handed back to China in 1997 under a “one country, two systems” framework and might be used to suppress political activity.\nPremier Li Keqiang, the country’s No. 2 leader, defended the law as consistent with Beijing’s promises.\n“The decision adopted by the NPC session is designed for steady implementation of ‘one country, two systems’ and Hong Kong’s long-term prosperity and stability,” Li said at a news conference.\nThe law and the way it is being enacted prompted U.S. Secretary of State Mike Pompeo on Wednesday to announce Washington will no longer treat Hong Kong as autonomous from Beijing. That could hurt the territory’s attractiveness as a business center.\nPompeo’s notice adds Hong Kong to the Trump administration’s conflicts with China over trade, technology, religious freedom, Chinese handling of the coronavirus pandemic and the status of Taiwan, the self-ruled island Beijing claims as its own territory.\nLi called for mutual respect and Sino-U.S. cooperation to promote “extensive common interests” in resolving global problems and promoting trade, science and other fields.\n“Both countries stand to gain from cooperation and lose from confrontation,” Li said.\nOn Thursday, three pro-democracy lawmakers were ejected from Hong Kong’s legislative chamber during a debate over a bill that would criminalize insulting or abusing the Chinese national anthem.\nAlso Thursday, the NPC approved a government budget that will increase spending to generate jobs to try to reverse an economic slump after Chinese industries were shut down to fight the coronavirus pandemic.\nPrivate sector analysts say as much as 30% of the urban workforce, or as many as 130 million people, lost their jobs at least temporarily during the shutdown. They say as many as 25 million jobs might be lost for good this year.\nThe budget calls for giving local governments 2 trillion yuan ($280 billion) to spend on meeting goals including creating 9 million new jobs. That is in line with expectations of higher spending but a fraction of the $1 trillion-plus stimulus packages launched or discussed by the United States, Japan and Europe.\nLi, the premier, said Beijing is in a “strong position to introduce new measures” if necessary but wants to avoid flooding the economy with too much money. He said 70% of planned spending is aimed at putting wages in workers’ pockets in order to support consumer spending, the biggest driver of the economy.\n“We will do our utmost to keep China’s economic growth stable,” Li said. “At the same time, we must make sure that all measures taken are well calibrated.”\nIn an anti-virus measure, Li sat on a dais in the Great Hall of the People, the seat of the legislature in central Beijing, and talked by video link with reporters at a media center 4 miles (6.5 kilometers) away. The reporters, wearing masks, sat in widely spaced chairs in an auditorium, watching Li on a video screen.\nHe called for international cooperation in fighting the coronavirus pandemic but didn’t answer a question about how an investigation into the origins of the pandemic demanded by Washington and some other governments should be conducted.\nBeijing has resisted pressure for an inquiry following criticism it mishandled the early response to the disease that emerged in central China in December. China has blocked beef imports from four Australian suppliers in apparent retaliation for Australia’s calls for an investigation."}}