{"1":{"tilte":"The #YouAreWelcomeHere Scholarship at National Louis University","link":"https:\/\/www.scholarshipportal.com\/scholarship\/the-you-are-welcome-here-scholarship-at-national-louis-university","discription":"HomeScholarshipsThe #YouAreWelcomeHere Scholarship at National Louis UniversityThe #YouAreWelcomeHere Scholarship at National Louis UniversityBachelor50% of full-time tuition1 July 2020Visit Scholarship WebsiteThe #YouAreWelcomeHere Scholarship at National Louis University recognizes international students who have a vision for enhancing intercultural understanding. National Louis University will offer two annual, renewable scholarships equal to 50% of full-time tuition to selected international undergraduates dedicated to furthering the #YouAreWelcomeHere message by bridging intercultural divides. Applicants will answer a short essay question or present a multimedia project about their ideas for applying their leadership skills on their future campuses.\nThis is a scholarship byNational Louis UniversityNLU offers more than 60 undergraduate and graduate degree programs and is one of the most diverse universities in Illinois, helping students of all ages and backgrounds achieve their personal and profEligibilityEligibility Criteria\n\n\nBe a first-year international applicant of any undergraduate program of study\n\n\nAttend (or have graduated from) a secondary school outside of the United States\n\n\nDemonstrate interest and initiative in leadership and intercultural learning\n\n\nStudents must complete a #YouAreWelcomeHere scholarship application\n\n\nComplete a 500-1000 word essay or a 2-5 minute video answering the following prompt:\n\"Tell us about your leadership skills in your school or community, and how you plan to continue applying your leadership skills at National Louis University.\"\n\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsAnnual renewable scholarships equal to 50% of full-time tuition to selected international undergraduates dedicated to furthering the #YouAreWelcomeHere message by bridging intercultural divides.\nApplicationApplication Process\n\nApply for admission using NLU’s online application at www.nl.edu\/apphub\nComplete the one-page #YouAreWelcomeHere application and corresponding essay or video\nEmail the completed YAWH application and corresponding essay or video to YAWH@nl.edu by July 1st\na. If submitting a large video file, please share a link to the video in the email\nIf you are awarded a scholarship, claim it by submitting a tuition deposit by July 7\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"2":{"tilte":"National Louis University International Opportunity Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/national-louis-university-international-opportunity-scholarship","discription":"HomeScholarshipsNational Louis University International Opportunity ScholarshipNational Louis University International Opportunity ScholarshipBachelor10% of the full-time tuition rate1 July 2020Visit Scholarship WebsiteAll international students admitted to a National Louis University Bachelor's degree program will receive an annual, renewable scholarship equal to 10% of the full-time tuition rate (valued up to $7,599*).\nThis is a scholarship byNational Louis UniversityNLU offers more than 60 undergraduate and graduate degree programs and is one of the most diverse universities in Illinois, helping students of all ages and backgrounds achieve their personal and profEligibilityInternational Opportunity Scholarship Criteria:\n• Available to international students only\n• Students are only eligible to receive one NLU resource per academic year\n• NLU scholarships can only be used to cover tuition costs and are not refundable to the student\n• Students must maintain full time status (14+ credits\/term) and continuous enrollment (Summer optional)\n• Students must maintain a minimum GPA of 2.0\n• Students must adhere to all university policies in order to remain eligible to receive NLU scholarships\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsAnnual renewable scholarship equal to 10% of the full-time tuition rate (valued up to $7,599*).\nApplicationBe an international students admitted to a National Louis University Bachelor's degree program\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"3":{"tilte":"Kendall College at National Louis University International Opportunity Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/kendall-college-at-national-louis-university-international-opportunity-scholarship","discription":"HomeScholarshipsKendall College at National Louis University International Opportunity ScholarshipKendall College at National Louis University International Opportunity ScholarshipBachelor25% of the full-time tuition rate1 July 2020Visit Scholarship WebsiteAll international students admitted to a Kendall College degree program in Culinary Arts or Baking and Pastry will receive an annual, renewable scholarship equal to 25% of the full-time tuition rate (valued up to $24,123*).\nThis is a scholarship byNational Louis UniversityNLU offers more than 60 undergraduate and graduate degree programs and is one of the most diverse universities in Illinois, helping students of all ages and backgrounds achieve their personal and profEligibilityAll international students admitted to a Kendall College undergraduate degree program in Culinary Arts or Baking and Pastry\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsAnnual, renewable scholarship equal to 25% of the full-time tuition rate (valued up to $24,123*).\nApplicationBe an international student admitted to a Kendall College undergraduate degree program in Culinary Arts or Baking and Pastry\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"4":{"tilte":"Preply Cognitive Disabilities Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/preply-cognitive-disabilities-scholarship","discription":"HomeScholarshipsPreply Cognitive Disabilities ScholarshipPreply Cognitive Disabilities ScholarshipMaster, Bachelor525030 June 2020Visit Scholarship WebsitePreply offers three scholarships to students who have learning or reading disabilities. We award $3000, $1500, and $750 to the winners to help them cover their educational expenses. Alternatively, we allow the students to choose a specialized tutor to learn English on Preply.\nThis is a scholarship byPreply1-on-1 online lessons for any budget. Friendly tutors from all over the world. 100% Satisfaction Guarantee. Prepare to speak confidently. Register today!EligibilityTo be eligible for this scholarship, you must have:\n\nA GPA of 2.5 or more\nTo be enrolled undergraduate or graduate students of the US academic institution\nA documented learning or reading disability\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsA student can either spend it on his academic expenses, or get the money to his account on Preply and learn English with a tutor that specializes on teaching to students with learning disabilities.\nApplicationTo apply, a student should submit a video explaining why he's the best candidate for this scholarship and how learning a new language helps him overcome his disability. Please visit our website for more information about the application process.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"5":{"tilte":"UTS Pathway funding for International Students in Australia","link":"https:\/\/www.scholarshipportal.com\/scholarship\/uts-pathway-funding-for-international-students-in-australia","discription":"HomeScholarshipsUTS Pathway funding for International Students in AustraliaUTS Pathway funding for International Students in AustraliaBachelor, Master25% tuition feesVisit Scholarship WebsiteThis Scholarship was established by UTS to award high achieving commencing international students completing a UTS Insearch Diploma at IEN Institute, South Korea and enrolling in an undergraduate program at UTS.\nThis is a scholarship byUniversity of Technology SydneyThe University of Technology Sydney is a public research university located in Sydney, Australia.EligibilityTo be eligible for the Scholarship, an applicant must meet all of the following criteria:\n\nMust remain an international student (not an Australian citizen, New Zealand citizen or permanent resident of Australia); and\nMust complete a UTS Insearch Diploma undertaken at IEN Institute, South Korea with a minimum overall GPA of 6.0 out of 7.0 and no fail; and\nMust meet all admission requirements for the selected UTS undergraduate course; and\nMust be commencing studies full-time and on campus in a UTS undergraduate degree that directly articulates from their UTS Insearch Diploma course, in the next available intake after completion of the candidate’s Diploma; and\nMust not be a government sponsored student; and\nMust apply using the UTS online Scholarships Application form.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >Benefits25% tuition fees\nApplicationThe selection will be based on:The Scholarship will be awarded to the applicant with the highest GPA in the UTS Insearch Diploma completed at IEN Institute, South Korea.\nWhere there are multiple applicants with the same results, further consideration will be given to:\n\nA video submission describing what you hope to achieve by studying at UTS; and\nA letter of support from one or more lecturers from your Diploma studies.\n\nDecisions to award Scholarships will be made solely by the Scholarships Committee, as described in Clause 7 below, in its absolute discretion.\nTo be considered for this scholarship, applicants must submit a scholarship application.\nBefore Starting Your Application:\n\nIf you have not already submitted an application for course admission to UTS as an international student, you must first apply to UTS International.\nPrepare a video describing what you hope to achieve by studying at UTS. Provide a web link of the video for download.\nProvide a letter of support from one or more lecturers from your Diploma studies.\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"6":{"tilte":"The TranslationServices.com Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/the-translation-services-com-scholarship","discription":"HomeScholarshipsThe TranslationServices.com ScholarshipThe TranslationServices.com ScholarshipBachelor$5001 July 2020Visit Scholarship WebsiteThe team at TranslationServices.com knows that reading can change lives. This is why, for every translation order, they donate five books to a homeless shelter. For their $500 annual scholarship, they invite participants to submit an essay of 500–750 words about a book that changed the way they saw the world, overturning their preconceptions and informing their understanding of a place or culture. Eligible participants are graduating US high school seniors or undergraduate students with a cumulative GPA above 3.0 over the previous school year. The submission deadline is July 1, 2020, at 12:00 p.m. (Eastern).\nEligibilityTo be eligible for the scholarship, you must:\n\nbe a graduating high school senior or an undergraduate student in the United States\nhave maintained a cumulative GPA above 3.0 over the previous school year\nprovide permission to publish your essay and a photo of you on the TranslationServices.com blog\napply by noon (US Eastern time) on July 1, 2020\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >Benefits$500 award\nApplicationPlease visit our website for more application details.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"7":{"tilte":"Ning Po- Hong Kong Scholarship at Queen Mary University of London","link":"https:\/\/www.scholarshipportal.com\/scholarship\/ning-po-hong-kong-scholarship-at-queen-mary-university-of-london","discription":"HomeScholarshipsNing Po- Hong Kong Scholarship at Queen Mary University of LondonNing Po- Hong Kong Scholarship at Queen Mary University of LondonMaster, Bachelor$6,500 Visit Scholarship WebsiteThe PhB Science Scholarship provides support to new first year PhB Science students from disadvantaged backgrounds and\/or to assist PhB Science students in relocation costs to support their moving to Canberra. Funded by the Joint Colleges of Science; Health and Medicine, the award is for the first year of studies only, paid in two instalments.\nUp to ten scholarships are available. Of these, up to eight will be for applicants applying for admission to ANU through the direct Admission, Scholarship and Accommodation (ASA). Application and up to two will be for international\/domestic applicants not applying via ASA.\nThis is a scholarship byQueen Mary University of LondonQueen Mary University of London is a public research university in London, England, and a constituent college of the federal University of London.EligibilityThis award is available to both domestic and international students that have received an offer of admission to the Bachelor of Philosophy (Honours) - Science or the Bachelor of Philosophy (Honours) - Science\/Bachelor of Science (Honours) ANU-NUS joint degree program and have not previously enrolled in any undergraduate degree program. Additional eligibility criteria applies and is set out in detail in the conditions of award.\nA recipient of the PhB Science Scholarship is permitted to hold concurrent scholarships as outlined in the ANU Coursework Scholarships procedure.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThe scholarship offers a stipend of $6,500 paid in equal instalments in the first year year of study.\nApplicationAll applicants applying for admission to ANU through the direct Admission Scholarship and Accommodation Application will be automatically considered for the award based on them meeting the eligibility criteria and electing to be considered for scholarships.\nInternational students and domestic students not applying via ASA, must submit a statement addressing how they meet the eligibility criteria and attach relevant documentation to support their claims. The application and all supporting documentation (where applicable) must be submitted to us via email on, or prior to 15 January in the year that they are commencing studies.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"8":{"tilte":"International merit awards for Vietnamese Students at RMIT University","link":"https:\/\/www.scholarshipportal.com\/scholarship\/international-merit-awards-for-vietnamese-students-at-rmit-university","discription":"HomeScholarshipsInternational merit awards for Vietnamese Students at RMIT UniversityInternational merit awards for Vietnamese Students at RMIT UniversityBachelor, Master$10,000Visit Scholarship WebsiteThis scholarship is open for Vietnamese commencing international students undertaking any RMIT programs which can provide financial assistance towards first year of study.\nThis is a scholarship byRMIT UniversityFounded by Francis Ormond in 1887, RMIT began as a night school offering classes in art, science, and technology, in response to the industrial revolution in Australia.EligibilityIn order to qualify for this scholarship, you must:\n\nbe a citizen of Vietnam\napply from Vietnam\nnot an existing RMIT student\nenrol for either Semester 2 2020 or Semester 1 2021 in any RMIT programs\napplicants with a conditional offer will need to meet the conditions of their offer before they can be awarded the scholarship\napplicants must submit an application for this scholarship\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThe total value of the scholarship is AU**$10,000,** one-off payment to be paid after census date.\n\nTwo (2) scholarship is available for Semester 2 2020\nSix (6) scholarships are available for Semester 1 2021\n\nApplication\nSelect an eligible program\nSubmit an application to study at RMIT\nReceive an offer letter to study at RMIT for either Semester 2 2020 or Semester 1 2021\nSubmit an application form for this scholarship\n\nTerms and conditions\n\nThis scholarships is only available to non-existing RMIT students.\nApplicants with a conditional offer will need to meet the conditions of their offer before they can be awarded the scholarship.\nApplicants with ELICOS packaged offer are not eligible.\nThis scholarship cannot be deferred.\nThe value of your scholarship is based on full-time 48 credit points enrolment load in your first semester, which will be adjusted accordingly if your enrolment load is reduced.\nRMIT International may profile scholarship recipients.\nScholarship selection is based on academic merit and personal statement.\nSuccessful applicants will be notified; unsuccessful applicants will not be contacted.\nApplicants should not be in receipt of any other scholarship covering tuition fees (applicants currently in receipt of a scholarship loan may be considered).\nThe scholarships will be offered on a rolling basis until exhausted.\n\nFor full terms and conditions please view the International Scholarships Term and Conditions.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"9":{"tilte":"Swansea University Fully Funded M2A ENGD Scholarship in UK","link":"https:\/\/www.scholarshipportal.com\/scholarship\/swansea-university-fully-funded-m2a-engd-scholarship-in-uk","discription":"HomeScholarshipsSwansea University Fully Funded M2A ENGD Scholarship in UKSwansea University Fully Funded M2A ENGD Scholarship in UKMaster, Bachelor£20,00012 June 2020Visit Scholarship WebsitePower Roll Ltd is a technology development company based in the North East of England. It is developing an innovative thin film photovoltaic (PV) technology that is based on 3D patterned substrate suitable for high throughput roll-to-roll (R2R) manufacturing. As part of its scale up development, it is looking to develop R2R deposition of Perovskite into its patented architecture. PRL technology has been demonstrated at +10% using spin coated perovskite into its flexible mini-module platform, but is now in the process of scaling all process parameters to R2R.\nThe project will be located within SPECIFIC as part of Professor Trystan Watson’s research group. SPECIFIC is a National Innovation and Knowledge Centre led by Swansea University, working collaboratively with Universities across the UK. SPECIFIC has significant capability and expertise across its team and facilities. Capabilities at SPECIFIC relate to the printing, coating and lifetime testing of functional materials and the development of enabling technologies that support the transition from laboratory bench to factory floor.\nThe SPECIFIC PV scale-up and stability research activity is currently carried out at Swansea University’s new Bay Campus facility and is housed in purpose-built facilities which include a new stability testing and cleanroom printing facility.\nThis is a scholarship bySwansea UniversitySwansea, is a coastal city and county, officially known as the City and County of Swansea in Wales.EligibilityWe welcome applications from candidates with an Engineering or Physical Sciences degree (minimum level 2:1), or a combination of degree and equivalent experience to the same level.\nNormally, we would expect candidates to have met the University’s English Language requirements (e.g. IELTS 6.5 overall with 5.5+ in each component) by point of application. For details on the University’s English Language entry requirements, please visit our website for more information.\nDue to funding restrictions, this scholarship is open to UK\/EU candidates only.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThe scholarship covers the full cost of UK\/EU tuition fees, plus a stipend of £20,000 p.a. for a period of four years.\nApplicationPlease visit our website for more information about the application process.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"10":{"tilte":"University of Birmingham Undergraduate funding for Canadian Students in UK","link":"https:\/\/www.scholarshipportal.com\/scholarship\/university-of-birmingham-undergraduate-funding-for-canadian-students-in-uk","discription":"HomeScholarshipsUniversity of Birmingham Undergraduate funding for Canadian Students in UKUniversity of Birmingham Undergraduate funding for Canadian Students in UKBachelor£2,50012 June 2020Visit Scholarship WebsiteThe University of Birmingham is pleased to announce the award of five scholarships of £2,500 for Canadian domiciled students applying for entry to an undergraduate programme at the University starting September 2020.\nThese are joint awards with our local representatives who are listed here in alphabetical order: Canada Law from Abroad (CLFA) and SI-UK Canada.\nThe scholarships will be awarded to the highest performing students starting their University of Birmingham programme in 2020\/21 academic year.\nThis is a scholarship byUniversity of BirminghamThe University of Birmingham is a public research university located in Edgbaston, Birmingham, United Kingdom.EligibilityPlease note that students already registered and studying on a programme at the University of Birmingham in the UK, and students applying for MBChB Medicine and Surgery or BDS Dental Surgery are not eligible for this scholarship.\nIn order to be eligible, candidates must:\n\nHave received an offer oand selected the University of Birmingham as their firm choice for a full time undergraduate programme starting September 2020. The student must be entering the first year of an undergraduate programme based at Birmingham’s UK campus\nMeet the academic conditions of their offer to the programme;\nBe classed as Canadian national or domiciled\/ resident;\nBe classed by the University as an overseas fee payer for tuition fee purposes and be able to pay the outstanding tuition fees not covered by the scholarship;\nHave sufficient funds to cover the full cost of living at the University of Birmingham, plus any visa\/travel expenses associated with studying in the UK;\nStart their studies at the University in September 2020 (the scholarship award may not be deferred;\nBe registered with, and have their undergraduate study application attached to, one of our local representatives listed here in alphabetical order: Canada Law from Abroad (CLFA) and SI-UK Canada.\nSubmit your scholarship application through one of our local representatives by the deadline; 12 June 2020.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThe scholarship awards are for £2,500 towards tuition fees (for the first year only) of a full time undergraduate degree programme at the University starting September 2020.\nApplicationTo apply for the scholarship students will need to have accepted an offer from Birmingham, have selected Birmingham as their firm choice, and be in contact with one of our local representatives listed above by the scholarship deadline of 12 June 2020. Selection for the award will be based on academic merit.\nOnly under exceptional circumstances in which the University is unable to choose an awardee based solely on academic merit (for instance, if two candidates have identical grades) will applicants be asked to attend an interview via Skype.\nDecisions will be announced in late June and the scholarships will be awarded upon the students’ enrolment in September 2020.\nSuccessful scholarship awardees will need to accept by 3 July.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"11":{"tilte":"Rent A Knee Walker Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/rent-a-knee-walker-scholarship","discription":"HomeScholarshipsRent A Knee Walker ScholarshipRent A Knee Walker ScholarshipMaster, Bachelor, Phd$10001 September 2020Visit Scholarship WebsiteThe COVID-19 global pandemic has shaken us at the core and threatens the way we all live our daily lives. As we overcome this crisis, we must stay unified to rebuild, strengthen, and overcome future challenges.\nRent A Knee Walker wishes to support students with financial needs who must continue their education during one of the most challenging times we have faced collectively as a whole.\nThis is a scholarship byRent A Knee WalkerRent a knee walker is the best online provider of knee walkers and knee scooter rentals. Recover from a foot or ankle injury with the top knee walkers on the market at the best rental price!EligibilityThis scholarship is open to qualifying students currently enrolled in an accredited college\/university that maintain a cumulative GPA of 3.0.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsMonies can be used towards tuition or any related academic expenses.\nApplicationPlease visit our website to apply via our online portal.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"12":{"tilte":"Rent A Knee Walker Scholarship Fund","link":"https:\/\/www.scholarshipportal.com\/scholarship\/rent-a-knee-walker-scholarship-fund","discription":"HomeScholarshipsRent A Knee Walker Scholarship FundRent A Knee Walker Scholarship FundMaster, Bachelor, Phd, Course$10001 September 2020Visit Scholarship WebsiteThe COVID-19 global pandemic has shaken us at the core and threatens the way we all live our daily lives. As we overcome this crisis, we must stay unified to rebuild, strengthen, and overcome future challenges.\nRent A Knee Walker wishes to support students with financial needs who must continue their education during one of the most challenging times we have faced collectively as a whole.\nThis is a scholarship byRent A Knee WalkerRent a knee walker is the best online provider of knee walkers and knee scooter rentals. Recover from a foot or ankle injury with the top knee walkers on the market at the best rental price!EligibilityThis scholarship is open to qualifying students currently enrolled in an accredited college\/university that maintain a cumulative GPA of 3.0.\nAll applicants must meet all the criteria outlined below and apply via our online portal.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsMonies can be used towards tuition or any related academic expenses.\nApplicationPlease apply via our online portal. The portal is mentioned at our website.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"13":{"tilte":"Contest Scholarships for Undergraduate Students","link":"https:\/\/www.scholarshipportal.com\/scholarship\/contest-scholarships-for-undergraduate-students","discription":"HomeScholarshipsContest Scholarships for Undergraduate StudentsContest Scholarships for Undergraduate StudentsBachelor, CourseFrom $500 tuition fees1 May 2021Visit Scholarship WebsiteOur education company offers services and resources for making students and teachers life easier, but our other goal is to motivate students to improve their skills and practice in making successful papers. You can accept a challenge and take part in our scholarships program contest. Create a strong paper and receive a fine reward! Limit 1 application per person.\nEligibility\nBe thirteen years of age or older at the time of application\nBe currently enrolled (or enroll no later than the fall of 2023) in an accredited post-secondary institution of higher education\nStudents of high schools and colleges, including undergraduate and graduate candidates, can take part in our scholarship essay contest.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThe rewards start from $500 and are going to help cover students educational expenses.\nApplicationApplication must include:\n\nname and contact information,\nacademic details,\nmake sure you have followed our rules before taking part in the scholarships contest (check the full details on the application page)\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"14":{"tilte":"The TranscriptionServices.com Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/the-transcription-services-com-scholarship","discription":"HomeScholarshipsThe TranscriptionServices.com ScholarshipThe TranscriptionServices.com ScholarshipBachelor$5001 June 2020Visit Scholarship WebsiteAs part of its social mission, TranscriptionServices.com provides hearing aid batteries to recipients in developing countries. For their $500 annual scholarship, they invite participants to submit an essay of 500–750 words discussing what challenges they would face if they were to wake up with total hearing loss and how they would address those challenges. Eligible participants are graduating US high school seniors or undergraduate students with a cumulative GPA above 3.0 over the previous school year. The submission deadline is June 1, 2020, at 12:00 p.m. (Eastern).\nEligibilityTo be eligible for the scholarship, you must …\n\nbe a graduating high school senior or an undergraduate student in the United States\nhave maintained a cumulative GPA above 3.0 over the previous school year\nprovide permission to publish your essay and a photo of you on the TranscriptionServices.com blog\napply by noon (US Eastern time) on June 1, 2020\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThe award of $500.\nApplicationWrite an essay between 500 and 750 words based on the following essay prompt:\n\n​If you woke up tomorrow with permanent hearing loss, what would be the biggest challenge you would face? How would you address that challenge?\n\nPlease visit our website for more information about the application process.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"15":{"tilte":"SMU Kewalram Chanrai Group Endowed funding for International Students in Singapore","link":"https:\/\/www.scholarshipportal.com\/scholarship\/smu-kewalram-chanrai-group-endowed-funding-for-international-students-in-singapore","discription":"HomeScholarshipsSMU Kewalram Chanrai Group Endowed funding for International Students in SingaporeSMU Kewalram Chanrai Group Endowed funding for International Students in SingaporeBachelor$30,000 per annumVisit Scholarship WebsiteThe Kewalram Chanrai Group Endowed Scholarship is available to first-year full-time undergraduates of foreign nationalities pursuing any degree programme at Singapore Management University.\nThe Scholarship is aimed at motivating the students to achieve greater heights of excellence.\nThis is a scholarship bySingapore Management UniversitySingapore Management University is the third autonomous university in Singapore.Eligibility\nFull-time first year undergraduates of foreign nationalities in any degree programme\nPreference for candidates from developing countries including but not limited to countries in which Kewalram Chanrai Group operates, such as Africa, the Indian Subcontinent, South America, Southeast Asia, and China\nSpecial consideration will be given to female candidates of suitable calibre from developing countries so as to encourage them to pursue a university education and to succeed in their lives\nGood academic achievements\nDemonstrated leadership skills or potential and good moral character\nActive CCAs and community involvement\nKeen sectoral interest in textiles, automotives, agriculture, commodities, international trade, IT and real estate\nEvidence of financial need\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >Benefits\nTenable for up to 4 years of the recipient’s academic studies, subject to outstanding academic performance\nValued up to $30,000 per annum\nThe scholarships will offer financial support towards the recipients' tuition fees and\/or study-related expenses, such as the purchase of a notebook computer which the recipients may keep upon successful completion of their studies, purchase of textbooks, participation in Business Study Mission and\/or International Student Exchange Programme with SMU partner universities.\n\nApplicationApply via applicant’s Self Service (after submitting an online admission application).\nIf you would like to be considered for this scholarship, please indicate your interest in the Scholarship section of the online application form for admission. There is no separate scholarship application form.\nSpecial consideration for this scholarship will be given to applicants with demonstrated financial needs. Applicants must also submit a separate financial aid application. This can be done via Applicant’s Self Service, after submitting the online application for admission. The financial aid application will open from 2 January to 31 May 2020 for prospective applicants applying for Academic Year 2020-21.\nSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"}}