{"1":{"tilte":"HEC Indigenous Scholarship For PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-indigenous-scholarship-for-phd-scholar-502","discription":"HEC announces Indigenous Scholarship for PhD students. Applications are invited from outstanding Pakistani\/AJK nationals who intend to complete PhD from Pakistani Higher Education Commission HEC Recognised Universities\/Degree Awarding Institutions (DAIs). Application Deadline is extended till April 18, 2020.  The Scholarships are being offered for the academic year 2020 in all areas of studies\/disciplines under the project entitled “indigenous PhD Fellowship for 5000 Scholars-Phase-II’."},"2":{"tilte":"District Council Thatta Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/district-council-thatta-scholarship-scholar-668","discription":"District Council Thatta is offering scholarship for the talented and needy students. The students must belong to district Thatta and are continuing their post-inter studies in the following categories, studying in a Government institution preferably recognized by HEC."},"3":{"tilte":"Bolan Mining Enterprise Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/bolan-mining-enterprise-scholarship-scholar-666","discription":"Bolan Mining Enterprise, A joint venture of Government of Balochistan and Pakistan Petroleum Limited announces merit scholarship. 10 students will be awarded scholarship. Last date to apply for scholarship is April 02, 2020."},"4":{"tilte":"Diya Pakistan Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/diya-pakistan-scholarship-scholar-160","discription":"Diya Pakistan is one of the largest scholarship providing organizations in Pakistan. Diya Pakistan provides 50,000 annual scholarships to school and university students. It also offers monthly stipends to the students enrolled in skill development programs. Diya Pakistan accepts applications throughout the years. Deserving students can apply online at Diya Pakistan website."},"5":{"tilte":"Tabeer Scholarship for KPK","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/tabeer-scholarship-for-kpk-scholar-663","discription":"Tabeer scholarship is announced for the students of KP colleges and universities. Tabeer scholarship offer scholarships worth 250,000\/- Merit test for the scholarship will be conducted thoughout the province and selected students will be awarded merit scholarship. Last date to apply for the scholarship is March 03, 2020."},"6":{"tilte":"NEST Nursing Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/nest-nursing-scholarship-scholar-659","discription":"National Endowment Scholarship for Talent NEST announces Nursing scholarships 2020. Nursing scholarships are for students enrolled in 4-years BS Nursing, MS Nursing and PhD programs. NEST is an initiative of Ministry of Federal Education and Professional Training Government of Pakistan. NEST scholarships are the first big scholarship opportunity for students of Nursing. NEST is striving to strength the nursing profession by"},"7":{"tilte":"CM Education Endowment Fund KP CMEEF Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/cm-education-endowment-fund-kp-cmeef-scholarship-scholar-106","discription":"Chief Minister's Education Endowment Fund Scholarship 2020 is announced by Government of Khyber Pakhtunkhwa. CMEEF scholarship is a fully funded scholarship for undergraduate and postgraduate students which covers All educational expenses and also offers PKR: 5000\/- Monthly stipend. CMEEF scholarship is a merit-cum-need based scholarship program offered by Higher Education, Archives and Libraries department of Government of Khyber Pakhtunkhwa."},"8":{"tilte":"NEST Arts and Culture Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/nest-arts-and-culture-scholarship-scholar-658","discription":"Ministry of Federal Education  and Professional Training Government of Pakistan announces National Endowment Scholarship for Talent NEST 2020. NEST scholarship is for deserving students of Arts and Culture 2020. NEST arts and Culture scholarship 2020 is a need based scholarship program for deserving students studying in the below mentioned colleges\/universities."},"9":{"tilte":"PEEF Inter and BS Scholarship for Sindh Students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/peef-inter-and-bs-scholarship-for-sindh-students-scholar-656","discription":"Punjab Education Endowmnet Fund PEEF announces scholarships for talented and deserving students Sindh for session 2019-20. PEEF scholarship is for students of Intermediate and graduation. Students who have passed Matric or Inter exams in 2019 are eligible to apply. Last date to submit application for PEEF Sindh Scholarships is February 14, 2020."},"10":{"tilte":"LUMS National Outreach Program NOP Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/lums-national-outreach-program-nop-scholarship-scholar-208","discription":"LUMS NOP scholarship 2020 is for academically bright but financially deserving students who cannot afford to study in prestigious universities. LUMS invites such students to summer coaching classes, and based on the results of different assessment, these students are offered admission at LUMS with full financial assistance. All costs of travelling, summer coaching, SAT test fee etc… are paid by LUMS.  LUMS has offered NOP Financial assistance to more than 1200 students till date."},"11":{"tilte":"National Bank NBP Student Loan Scheme","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/national-bank-nbp-student-loan-scheme-scholar-86","discription":"National Bank of Pakistan NBP offers student loan scheme to those who cannot afford their higher education. NBP Student loan scheme is for those studying in Undergraduate, Postgraduate and PhD programs and have obtained minimum 70% marks in the previous examination."},"12":{"tilte":"IBA Karachi National Talent Hunt Program Scholarship by Ihsan Trust","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/iba-karachi-national-talent-hunt-program-scholarship-by-ihsan-trust-scholar-643","discription":"The Institute of Business Administration, IBA Karachi is Pakistan's best university for Management sciences and related program. National Talent Hunt program is a fully fudnded scholarship program by IBA Karachi and Ihsan Trust. Students are selected from all over Pakistan for admission at IBA in BBA, and BS degree program."},"13":{"tilte":"Saeed Muhammad Scholarship for Baluchistan students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/saeed-muhammad-scholarship-for-baluchistan-students-scholar-647","discription":"Applicants from all over Baluchistan are invited for Saeed Muhammad (C.E.O FC HARNAI COAL PROJECT) scholarship who want to pursue studies or going to take admission in matriculation, intermediate, Bachelor (2\/4 years or masters\/ M.Phil level (Science\/ Arts) in any of the registered institute of Pakistan. The scholarships are for the academic year of 2020 and 2021in all discipline given by Saeed Muhammad (C.E.O FC Harnai Coal Project). Last date Form submission is January 25, 2020."},"14":{"tilte":"PEEF Scholarship for FATA","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/peef-scholarship-for-fata-scholar-123","discription":"Punjab Education Endowment Fund PEEF announces scholarships for talented and deserving students of FATA\/Merged areas for session 2019-20. Students who have passed Matric or Inter exams in 2019 are eligible to apply. Last date to submit application for PEEF KP Scholarships is January 30, 2020. Those having domicile of FATA\/Merged areas can apply."},"15":{"tilte":"PEEF special quota scholarship for Inter and Graduation ","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/peef-special-quota-scholarship-for-inter-and-graduation-scholar-71","discription":"Punjab Educational Endowment Fund (PEEF) has announced special quota scholarships for Intermediate and Graduation level studies 2019. Students who have passed matric or inter exams 2019 and belong to one of the following categories can apply for PEEF Special quota scholarship 2019"},"16":{"tilte":"Punjab Government Servants Benevolent Fund Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/punjab-government-servants-benevolent-fund-scholarship-scholar-87","discription":"Punjab Government Benevolent fund is offering scholarships to the children of the in-service, retired or late employees. Scholarship will be awarded for those children who have passed matriculation or higher examination with a minimum of 60% marks and are enrolled in higher classes."},"17":{"tilte":"Khairpur District Need cum Merit Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/khairpur-district-need-cum-merit-scholarship-scholar-162","discription":"The District Administration, Khiarpur is pleased to announce the Need-Cum-Merit Scholarship 2019-20 for the talented and deserving students of the Khairpur District. The students belonging to Khairpur district only who are studying in various public-sector Institutes\/colleges universities anywhere in Pakistan (preferably HEC recognized) can apply for the scholarship if they fulfill\/ meet the following criteria:"},"18":{"tilte":"HEC Scholarship for Undergraduate students at MUST","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-scholarship-for-undergraduate-students-at-must-scholar-644","discription":"Higher education commission HEC Islamabad is offering scholarships to the students admitted in Bachelor degree programs in session 2019 at Mirpur university of Science and Technology, MUST Mirpur AJK. Scholarship will be offered through the MUST university relevant department."},"19":{"tilte":"IBA Sukkur Sindh talent hunt program scholarship 2019","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/iba-sukkur-sindh-talent-hunt-program-scholarship-2019-scholar-80","discription":"Sukkur Institute of Business Administration IBA announced Talent Hunt Program scholarship 2019 for the students from Sindh province. IBA Talent Hunt program offers merit cum need based fully funded scholarship to 500 talented students. Students will be selected based on entrance test, and will be offered admission to six month foundation program. Now the deadline for Sindh talent Hunt Program is extended to December 14, 2019."},"20":{"tilte":"Ehsaas Scholarship program for undergraduate students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/ehsaas-scholarship-program-for-undergraduate-students-scholar-641","discription":"Government of Pakistan has launched the country's largest undergraduate Scholarship program Ehsaas Undergraduate scholarship 2019. Under Ehsaas scholarship program, 200,000 scholarships will be awarded to the deserving students in coming four years. 50% quota is reserved for female students. Ehsaas scholarship is a fully funded program, which not only covers tuition fee but a monthly stipend will also be provided to the scholars. Now the Deadline for Ehsaas Undergraduate Scholarship is extended till December 24, 2019"}}