{"1":{"tilte":"Fulbright Foreign Language Teaching Assistant FLTA in US","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/fulbright-foreign-language-teaching-assistant-flta-in-us-scholar-670","discription":"USEFP offers Fulbright Foreign Language Teaching Assistant FLTA program for English language teachers in Pakistan to refine their skills and enhance their English language proficiency. FLTA is a nine-month course. FLTA will teach Urdu or Pashto in American Colleges or Universities. This is a fully-funded program. The program shall start from Fall 2021."},"2":{"tilte":"Youth of excellence scheme YES china scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/youth-of-excellence-scheme-yes-china-scholarship-scholar-669","discription":"Chinese Government announces Youth of Excellence Scheme YES China scholarship program for the students of friendly countries. Pakistani students are encouraged to apply. Students can pursue a Master's degree program in china under this program. For the academic year 2020-2021, 8 Master's degree programs in 7 leading Chinese universities are open to applicants from 79 developing countries."},"3":{"tilte":"HEC Indigenous Scholarship For PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-indigenous-scholarship-for-phd-scholar-502","discription":"HEC announces Indigenous Scholarship for PhD students. Applications are invited from outstanding Pakistani\/AJK nationals who intend to complete PhD from Pakistani Higher Education Commission HEC Recognised Universities\/Degree Awarding Institutions (DAIs). Application Deadline is extended till April 18, 2020.  The Scholarships are being offered for the academic year 2020 in all areas of studies\/disciplines under the project entitled “indigenous PhD Fellowship for 5000 Scholars-Phase-II’."},"4":{"tilte":"District Council Thatta Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/district-council-thatta-scholarship-scholar-668","discription":"District Council Thatta is offering scholarship for the talented and needy students. The students must belong to district Thatta and are continuing their post-inter studies in the following categories, studying in a Government institution preferably recognized by HEC."},"5":{"tilte":"USEFP Fulbright Scholarship for Masters and PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/usefp-fulbright-scholarship-for-masters-and-phd-scholar-38","discription":"The United States Educational Foundation in Pakistan is now accepting applications for the 2021 Fulbright Student (Master’s and PhD) and Fulbright-Higher Education Commission (HEC) PhD Program, which fully funds graduate study at top universities in the United States."},"6":{"tilte":"Australia Awards Scholarship for Pakistani Students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/australia-awards-scholarship-for-pakistani-students-scholar-92","discription":"Australia Awards Scholarships are offered Australian Government to Pakistani students. These scholarships aim to contribute to the development needs of Pakistani economy. For Pakistani Students, Australia Awards scholarships are offered for Master's Degree program in different programs as enlisted below.  Last date to apply is April 30, 2020."},"7":{"tilte":"Bolan Mining Enterprise Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/bolan-mining-enterprise-scholarship-scholar-666","discription":"Bolan Mining Enterprise, A joint venture of Government of Balochistan and Pakistan Petroleum Limited announces merit scholarship. 10 students will be awarded scholarship. Last date to apply for scholarship is April 02, 2020."},"8":{"tilte":"DAAD Scholarships for Study in Germany","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/daad-scholarships-for-study-in-germany-scholar-594","discription":"Applications are now open for DAAD Scholarships for Study in Germany. DAAD is one of the world's largest funding organizations. It provides over 100,000 scholarships and grants to German and International students for study in Germany."},"9":{"tilte":"Diya Pakistan Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/diya-pakistan-scholarship-scholar-160","discription":"Diya Pakistan is one of the largest scholarship providing organizations in Pakistan. Diya Pakistan provides 50,000 annual scholarships to school and university students. It also offers monthly stipends to the students enrolled in skill development programs. Diya Pakistan accepts applications throughout the years. Deserving students can apply online at Diya Pakistan website."},"10":{"tilte":"University of Sydney Australia Scholarships 2020 ","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/university-of-sydney-australia-scholarships-2020-scholar-662","discription":"University of Sydney Australia announces fully funded scholarships for Masters and PhD degree at University of Sydney. University of Sydney fully funded scholarship program is open for international students from all over the world. Monthly stipend will also be offered to the selected candidates."},"11":{"tilte":"Tukiye Scholarships for Undergraduate and Postgraduate in Turkey","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/tukiye-scholarships-for-undergraduate-and-postgraduate-in-turkey-scholar-661","discription":"Turkiye Scholarship is a fully funded undergraduate and postgraduate scholarship program offered by Government of Turkey. Applicants can submit the application directly without getting admission in any Turkey university. The admission process shall start after the award of scholarship Candidates are provided a university and academic program guide through Türkiye Scholarships Information System (TBBS) during their application process. Last date to apply for Turkey scholarships is 20-02-2020"},"12":{"tilte":"South East University China Fully funded MS and PhD Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/south-east-university-china-fully-funded-ms-and-phd-scholarship-scholar-660","discription":"Southeast University, China announces Masters and PhD admission and scholarship opportunities for their postgraduate programme 2020. SEU university china scholarship program is a fully funded scholarship which covers all expenses. Applications can be submitted latest by March 31 ,2020. Perspective candidates may apply directly to the SEU online portal http:\/\/fs.seu.edu.cn\/."},"13":{"tilte":"NEST Nursing Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/nest-nursing-scholarship-scholar-659","discription":"National Endowment Scholarship for Talent NEST announces Nursing scholarships 2020. Nursing scholarships are for students enrolled in 4-years BS Nursing, MS Nursing and PhD programs. NEST is an initiative of Ministry of Federal Education and Professional Training Government of Pakistan. NEST scholarships are the first big scholarship opportunity for students of Nursing. NEST is striving to strength the nursing profession by"},"14":{"tilte":"CM Education Endowment Fund KP CMEEF Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/cm-education-endowment-fund-kp-cmeef-scholarship-scholar-106","discription":"Chief Minister's Education Endowment Fund Scholarship 2020 is announced by Government of Khyber Pakhtunkhwa. CMEEF scholarship is a fully funded scholarship for undergraduate and postgraduate students which covers All educational expenses and also offers PKR: 5000\/- Monthly stipend. CMEEF scholarship is a merit-cum-need based scholarship program offered by Higher Education, Archives and Libraries department of Government of Khyber Pakhtunkhwa."},"15":{"tilte":"Islamic Development Bank Scholarship","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/islamic-development-bank-scholarship-scholar-8","discription":"Islamic Development Bank has announced scholarship for Undergraduate, Masters and PhD programs for academic year 2020-21. Applications can be submitted online at IsDB website. Islamic Development Bank scholarship is a fully funded program and open for students and scholars from 57 Islamic countries including Pakistan. It covers tuition fee, academic expenses, living expenses and everything."},"16":{"tilte":"National Bank NBP Student Loan Scheme","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/national-bank-nbp-student-loan-scheme-scholar-86","discription":"National Bank of Pakistan NBP offers student loan scheme to those who cannot afford their higher education. NBP Student loan scheme is for those studying in Undergraduate, Postgraduate and PhD programs and have obtained minimum 70% marks in the previous examination."},"17":{"tilte":"Saeed Muhammad Scholarship for Baluchistan students","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/saeed-muhammad-scholarship-for-baluchistan-students-scholar-647","discription":"Applicants from all over Baluchistan are invited for Saeed Muhammad (C.E.O FC HARNAI COAL PROJECT) scholarship who want to pursue studies or going to take admission in matriculation, intermediate, Bachelor (2\/4 years or masters\/ M.Phil level (Science\/ Arts) in any of the registered institute of Pakistan. The scholarships are for the academic year of 2020 and 2021in all discipline given by Saeed Muhammad (C.E.O FC Harnai Coal Project). Last date Form submission is January 25, 2020."},"18":{"tilte":"HEC Chinese Government Scholarship CSC ","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-chinese-government-scholarship-csc-scholar-638","discription":"China Scholarship council CSC offers fully funded scholarships to Pakistani students through HEC for undergraduate, graduate and postgraduate studies in china. China Government is offering CSC scholarships to Pakistani students for Bachelor, Master and PhD programs in china."},"19":{"tilte":"HEC Stipendium Hungaricum Scholarship for Bachelor Masters and PhD","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/hec-stipendium-hungaricum-scholarship-for-bachelor-masters-and-phd-scholar-642","discription":"Higher Education Commission (HEC) Islamabad announces fully funded Hungaricum Scholarships for undergraduates, Masters and PhD Programs.  Hungaricum Scholarship Programme (2020-21) is launched by the Hungarian Government under Higher Education and Scientific Exchange Programme for Bachelors, One-Tier Master's, Masters and PhD studies."},"20":{"tilte":"Stanford University Knight Hennessy Master and PhD Scholarship in USA","link":"https:\/\/www.eduvision.edu.pk\/scholarships\/stanford-university-knight-hennessy-master-and-phd-scholarship-in-usa-scholar-632","discription":"Stanford University USA is one of the world's top universities. The university is offering fully funded 1000 scholarship for session 2020. The Standford University scholarships are offered under Knight-Hennessy Scholarship program, through which National & International stduents will be sponsored for fully funded Scholarships to study Masters, Ph.D., MS, MBA, MFA, MD, JD degrees at Stanford University. Knight – Hennesy Scholars is on the best scholarship programs in the world. Stanford University is ranked #2 in QS World Universities Ranking 2019."}}