{"1":{"tilte":"Preply Cognitive Disabilities Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/preply-cognitive-disabilities-scholarship","discription":"HomeScholarshipsPreply Cognitive Disabilities ScholarshipPreply Cognitive Disabilities ScholarshipMaster, Bachelor525030 June 2020Visit Scholarship WebsitePreply offers three scholarships to students who have learning or reading disabilities. We award $3000, $1500, and $750 to the winners to help them cover their educational expenses. Alternatively, we allow the students to choose a specialized tutor to learn English on Preply.\nThis is a scholarship byPreply1-on-1 online lessons for any budget. Friendly tutors from all over the world. 100% Satisfaction Guarantee. Prepare to speak confidently. Register today!EligibilityTo be eligible for this scholarship, you must have:\n\nA GPA of 2.5 or more\nTo be enrolled undergraduate or graduate students of the US academic institution\nA documented learning or reading disability\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsA student can either spend it on his academic expenses, or get the money to his account on Preply and learn English with a tutor that specializes on teaching to students with learning disabilities.\nApplicationTo apply, a student should submit a video explaining why he's the best candidate for this scholarship and how learning a new language helps him overcome his disability. Please visit our website for more information about the application process.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"2":{"tilte":"Rent A Knee Walker Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/rent-a-knee-walker-scholarship","discription":"HomeScholarshipsRent A Knee Walker ScholarshipRent A Knee Walker ScholarshipMaster, Bachelor, Phd$10001 September 2020Visit Scholarship WebsiteThe COVID-19 global pandemic has shaken us at the core and threatens the way we all live our daily lives. As we overcome this crisis, we must stay unified to rebuild, strengthen, and overcome future challenges.\nRent A Knee Walker wishes to support students with financial needs who must continue their education during one of the most challenging times we have faced collectively as a whole.\nThis is a scholarship byRent A Knee WalkerRent a knee walker is the best online provider of knee walkers and knee scooter rentals. Recover from a foot or ankle injury with the top knee walkers on the market at the best rental price!EligibilityThis scholarship is open to qualifying students currently enrolled in an accredited college\/university that maintain a cumulative GPA of 3.0.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsMonies can be used towards tuition or any related academic expenses.\nApplicationPlease visit our website to apply via our online portal.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"3":{"tilte":"Rent A Knee Walker Scholarship Fund","link":"https:\/\/www.scholarshipportal.com\/scholarship\/rent-a-knee-walker-scholarship-fund","discription":"HomeScholarshipsRent A Knee Walker Scholarship FundRent A Knee Walker Scholarship FundMaster, Bachelor, Phd, Course$10001 September 2020Visit Scholarship WebsiteThe COVID-19 global pandemic has shaken us at the core and threatens the way we all live our daily lives. As we overcome this crisis, we must stay unified to rebuild, strengthen, and overcome future challenges.\nRent A Knee Walker wishes to support students with financial needs who must continue their education during one of the most challenging times we have faced collectively as a whole.\nThis is a scholarship byRent A Knee WalkerRent a knee walker is the best online provider of knee walkers and knee scooter rentals. Recover from a foot or ankle injury with the top knee walkers on the market at the best rental price!EligibilityThis scholarship is open to qualifying students currently enrolled in an accredited college\/university that maintain a cumulative GPA of 3.0.\nAll applicants must meet all the criteria outlined below and apply via our online portal.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsMonies can be used towards tuition or any related academic expenses.\nApplicationPlease apply via our online portal. The portal is mentioned at our website.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"4":{"tilte":"ImproveNet Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/improve-net-scholarship","discription":"HomeScholarshipsImproveNet ScholarshipImproveNet ScholarshipMaster, Bachelor, Phd, Course$10001 August 2020Visit Scholarship WebsiteAt ImproveNet, we are proud to offer a scholarship program for students in the process of pursuing a college degree. We will award a winning student $1,000 to be used toward expenses for his or her degree.\nThis is a scholarship byImproveNetImproveNet is your guide to help you complete home improvement & repair projects, from start to finish. Learn & get matched to a professional contractor.EligibilityU.S. citizen accepted to or currently attending a college or university within the United States. The winner will be required to provide proof of acceptance to your college or university, or a college transcript.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >Benefits$1000 to be used towards education\nApplicationTo qualify, you must be a U.S. citizen accepted to or currently attending a college or university within the United States. The winner will be required to provide proof of acceptance to your college or university, or a college transcript.\nAttach an essay below and answer one of these two questions in a minimum of 500 and a maximum of 1,000 words:\n\nWhat does “home” mean to you?\n\n\nConsider your favorite books, movies, works of art, etc.\n\n\nHave these influenced your life in a meaningful way?\n\n\nWhy are they your favorites?\n\n\n\n\nWinning essays may be featured on the ImproveNet blog with approval.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"5":{"tilte":"2020 ImproveNet Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/2020-improve-net-scholarship","discription":"HomeScholarships2020 ImproveNet Scholarship2020 ImproveNet ScholarshipMaster, Bachelor, Phd, Course$10001 August 2020Visit Scholarship WebsiteAt ImproveNet, we are proud to offer a scholarship program for students in the process of pursuing a college degree. We will award a winning student $1,000 to be used toward expenses for his or her degree.\nThis is a scholarship byImproveNetImproveNet is your guide to help you complete home improvement & repair projects, from start to finish. Learn & get matched to a professional contractor.EligibilityU.S. citizen accepted to or currently attending a college or university within the United States. The winner will be required to provide proof of acceptance to your college or university, or a college transcript.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >Benefits$1000 to be used towards education\nApplicationTo qualify, you must be a U.S. citizen accepted to or currently attending a college or university within the United States. The winner will be required to provide proof of acceptance to your college or university, or a college transcript.\nAttach an essay below and answer one of these two questions in a minimum of 500 and a maximum of 1,000 words:\n\nWhat does “home” mean to you?Consider your favorite books, movies, works of art, etc. Have these influenced your life in a meaningful way? Why are they your favorites?\n\nWinning essays may be featured on the ImproveNet blog with approval.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"6":{"tilte":"Make Me Laugh Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/make-me-laugh-scholarship","discription":"HomeScholarshipsMake Me Laugh ScholarshipMake Me Laugh ScholarshipMaster, Bachelor, Phd, Course$150031 August 2020Visit Scholarship WebsiteSubmit a complete scholarship application online at the Sponsor's Website, no later than August 31, 2020 at 11:59 pm Pacific Time. Limit 1 application per person.\nThis is a scholarship byUnigoWhere do YOU want to go to school? Read college reviews, get matched to schools, find scholarships, and more.Eligibility\nBe thirteen (13) years of age or older at the time of application\nBe legal residents of the fifty (50) United States or the District of Columbia\nBe currently enrolled (or enroll no later than the fall of 2026) in an accredited post-secondary institution of higher education\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThis scholarship will help cover students' educational expenses.\nApplicationStudents can submit essay and scholarship to us via our website.\nApplication must include:\n\nname and contact information,\nbackground details,\nacademic details,\na short original, previously unpublished written response to the scholarship topic\n\n\"OMG... finding and applying for scholarships is serious business, but it's time to lighten things up a little. We don't want to know why you deserve $1,500 or how great your grades are, we simply want to LOL.\nDescribe an incident in your life, funny or embarrassing (fact or fiction), and make us laugh!\" (250 words or less)\nYour written response must be written in English, with correct spelling and grammar, and it must not exceed two-hundred fifty (250) words.\n\n\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"7":{"tilte":"Seasonsbeachcottage.com Mental health Education Scholarship Program","link":"https:\/\/www.scholarshipportal.com\/scholarship\/seasonsbeachcottage-com-mental-health-education-scholarship-program","discription":"HomeScholarshipsSeasonsbeachcottage.com Mental health Education Scholarship ProgramSeasonsbeachcottage.com Mental health Education Scholarship ProgramMaster, Bachelor, Course150030 November 2020Visit Scholarship WebsiteThe Beach Cottage at Seasons in Malibu: Luxury Mental Health Treatment is pleased to announce the details of our annual “Mental health Education Scholarship.”\nEligibilityThe scholarship is open to any major who can shed light on this issue. It may be a personal story that you can share or a more researched essay.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsChance to win scholarship ($1,500)\nApplicationQuestions to be answered in your Essay\/Application\n\nWhat are the differences in the methodologies of mental health treatment between Eastern and Western medicine traditions?\nWhat are good examples of using these treatments synergistically in providing quality mental health care?\nAre there other modes of treatment outside of western and eastern medicine traditions that can also be of value in providing mental health care?\nWhat practices can be incorporated in one’s life to promote better states of mental health?\nAre there any determinants which have been shown to lead to better states of mental health? What are some these factors?\nCan society play a role in promoting positive states of mental health for its citizen’s? How so?\n\nSubmission Requirements\nApplicants must be currently enrolled in High School, University or College as a full-time student (2019-2020 school year). There will be 2 contest submission dates. To be eligible for the contest submit your essay by one the submission dates.\n\nJanuary 1-May 31st.\nAccepting entries July 1st – November 31st.\nWinners Announced 12\/31\/2019\n\nAlong with your submission please include a picture of yourself which we can post on our site to go along with your essay. The winner will be required to provide proof of successful acceptance to a Higher Institute of Learning, College or University. Payment will be made directly to the applicant’s college.\nParticipating in our annual scholarship constitutes your consent to use personal information for the purposes of offering the scholarship and reporting to the appropriate tax authorities. We will not share your personal information to any other persons or entities, or use your personal information for marketing purposes.\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"8":{"tilte":"Voice Talent Online Scholarship 2020-2021","link":"https:\/\/www.scholarshipportal.com\/scholarship\/voice-talent-online-scholarship-2020-2021","discription":"HomeScholarshipsVoice Talent Online Scholarship 2020-2021Voice Talent Online Scholarship 2020-2021Master, Bachelor, Phd, CourseUSD1,000 or equiv cash prize31 January 2021Visit Scholarship WebsitePrize scholarship for writing 300-600 word blog posts on Robot vs Human - Voice and Consumer Behaviour and\/or Talking the Lingo: Why You must Go Local for Global Success\nWe began offering our Scholarship in 2018, with the aim to help students at least a little bit with those annoying costs related to studying, such as books, rent, transport and so on.\nThis is a scholarship byVoice Talent Online Voice Talent Online provides end-to-end voice over, audio localization, and quality assurance with 1,500 voices available in over 75 languages.EligibilityYou can apply for our scholarship if you are a student enrolled in a university or college anywhere in the world. In fact, for the 2019-2020 Scholarship we had applications from all over the world, including USA, Canada, Nigeria, Malaysia and Bangladesh!\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsCash Prize of USD1,000 or equivalent to use towards education costs\nApplication\n\nWrite a 300- 600 word blog post on this topic: \"Robot vs Human - Voice and Consumer Behaviour\"\n\n\nThe blog should contain the hyperlink voice over, linking to the link mentioned at our website.\n\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"9":{"tilte":"iMoneySlots Online Marketing Scholarship 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/i-money-slots-online-marketing-scholarship-2020","discription":"HomeScholarshipsiMoneySlots Online Marketing Scholarship 2020iMoneySlots Online Marketing Scholarship 2020Master, Bachelor, Phd, Course$130031 December 2020Visit Scholarship WebsiteiMoneySlots provides the help for the future marketers and business founders. For that reason, our professional team decided to create Online Marketing Scholarship. It is able to recompense the costs of the educational process for the students of high schools and colleges which are really keen on promoting certain products and services over the Internet.\nOnline marketing consists of different powerful tools and mechanisms available in the virtual space. So, if you are interested in this sphere of business, go on reading the information below.\nThis is a scholarship byiMoneySlotsPlay real money slots online➡ with exclusive bonuses✅ offered by the best casinos✅ – Find detailed reviews of casino games with winning tips and make cash gamblingEligibilityWe are the team of online marketers, IT professionals and entrepreneurs who are fond of online gaming. That is why we decided to create a top-grade website for the both newcomers and compulsive gamers in order to provide them with the useful content and the latest trends of the gambling industry. Our command has the long term practice and skills in this sphere of Internet so we took a choice to encourage the new generation and work with the fresh minds.\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >Benefits\nThe prize fund is $1300\nThe video and essays are accepted via our email (please visit our website)\nThe scholarship is given once each year\nThe deadline is 31 of December\n\nApplicationThe students have to:\n\nbe interested in online business, marketing, IT technologies and management\ncurrently, make a speciality out of above-said branches\nthe creative approach to fulfilling the scholarship’s exercise\nsubmission of online application\na short video (about 3 minutes) or essay (about 600 words) with the answer for the following theme:\n\n“What is your plan for realisation a brand new web business?\nDefinitely, the student with the best tactics will be encouraged by our scholarship.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"10":{"tilte":"BrightRozee's Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/bright-rozee-s-scholarship","discription":"HomeScholarshipsBrightRozee's ScholarshipBrightRozee's ScholarshipMaster, Bachelor, Phd, Course$100030 September 2020Visit Scholarship WebsiteBrightRozee is offering educational scholarships for undergraduate or above class students. The scholarship is being offered by BrightRozee for both needy & talented students\nEligibilityApplicants for this scholarship must follow this eligibility criteria. Each applicant:- Must be enrolled in undergradute or above at a recognised college\/university.\nConditions\n\nUndergraduated or above\nResearch paper or article must be plagiarism free and no grammatical mistakes.\nArticle must be 100% unique.\nYou can submit only one article\nYou can select only one topic\nTopic must be selected from the above section\nYou need to accept our privacy policy\nApplicant must be 20 to 35 years old.\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >Benefits$1000\nApplicationTo apply for this scholarship, please read below.\n\nChoose your topic from the below Section 'Choose only one topic To write Article'.\nWrite a research paper, article or essay on \"Your Selected Topics\".\nResearch paper, article or essay must be 1500 to 2000 words long with proper references.\nYour Complete Name\nYour Email address(we will email you once you are shortlisted or the winner)\nSchool\/College\/University name\nDepartment of studies\nTopic Name\n\nResearch paper or article must be plagiarism free and no grammatical mistakes.\n\nArticle must be 100% unique.\nYou can submit only one article\nYou can select only one topic\nTopic must be selected from the above section\nYou need to accept our privacy policy\nApplicant must be 20 to 35 years old.\nSubmit Your Articile & Application via our website,\n\nChoose only one topic To write Articles\n\nInternet Marketing\nBest RAMs\nBest Wireless Routers\nBest Scannners\nBest Outdoor Wifi extenders\nBest electronic shavers 2020\n\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"11":{"tilte":"Unigo $10K Scholarship","link":"https:\/\/www.scholarshipportal.com\/scholarship\/unigo-10k-scholarship","discription":"HomeScholarshipsUnigo $10K ScholarshipUnigo $10K ScholarshipMaster, Bachelor, Phd$10.00031 December 2020Visit Scholarship WebsiteThe Unigo.com Unigo $10K Scholarship Program contest is open only to those legal residents of the fifty (50) United States and the District of Columbia who are thirteen (13) years of age or older at the time of application and who are currently enrolled (or enroll no later than the fall of 2026) in an accredited post-secondary institution of higher learning (college, university or trade school). Current employees, officers, directors and agents of Sponsor and its related companies and members of their immediate families (defined as spouse, parents, siblings and children) and persons residing at the same address are not eligible to win. Void where prohibited.\nTo enter, applicants must submit a complete scholarship Application online at the Sponsor's Website, no later than December 31, 2020 at 11:59 pm Pacific Time. Application must include name and contact information, background details, academic details, and a short original, previously unpublished written response to the scholarship topic, \"Imagine a historical figure is brought back to life. Who is it? What's their favorite mobile app?\" (250 words or less) Your written response must be written in English, with correct spelling and grammar, and it must not exceed one-hundred forty (140) characters, including spaces.\nThis is a scholarship byUnigoWhere do YOU want to go to school? Read college reviews, get matched to schools, find scholarships, and more.Eligibility\n\nBe thirteen (13) years of age or older at the time of application\n\n\nBe legal residents of the fifty (50) United States or the District of Columbia\n\n\nBe currently enrolled (or enroll no later than the fall of 2026) in an accredited post-secondary institution of higher education\n\n\nSubmit an online written response to the question:\n\"Imagine a historical figure is brought back to life. Who is it? What's their favorite mobile app?\" (250 words or less)\n\n\nThe Unigo $10K Scholarship winner will be notified by email or phone on or around March 31, 2021.\n\n\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsThe scholarship ($10,000) can be used to fund educational expenses.\nApplicationFill out the application and submit essay on the provider website.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"12":{"tilte":"Gerald F. Connor Law Firm’s Annual Academic Scholarship of 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/gerald-f-connor-law-firm-s-annual-academic-scholarship-of-2020","discription":"HomeScholarshipsGerald F. Connor Law Firm’s Annual Academic Scholarship of 2020Gerald F. Connor Law Firm’s Annual Academic Scholarship of 2020Master, Bachelor$1,00015 July 2020Visit Scholarship WebsiteGerald F. Connor Law Firm’s Annual $1,000 Scholarship will provide financial assistance to the qualified individual whose essay best addresses the topic below.\nEligibilityThis scholarship is open to any US citizen or permanent US resident who will be enrolled in fall 2020 in an accredited community college or university (undergraduate or graduate), earning credits toward a degree (associate, baccalaureate, or graduate).\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsOur scholarship recipient will also be asked to submit a current photo to be published in an announcement to recognize this year’s winner on our website.\nApplicationAll applications must be filled out and materials received via the form below by July 15, 2020. Applications submitted via any other channel will not be considered. Applications submitted after this date will not be considered. The decision of the committee is final. The winner will be notified by email or phone by August 2020. Scholarship funds will be disbursed to the college or university by the end of August 2020.\nSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"13":{"tilte":"Taylor Randolph’s Annual Academic Scholarship of 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/taylor-randolph-s-annual-academic-scholarship-of-2020","discription":"HomeScholarshipsTaylor Randolph’s Annual Academic Scholarship of 2020Taylor Randolph’s Annual Academic Scholarship of 2020Master, Bachelor$1,00015 July 2020Visit Scholarship WebsiteTaylor Randolph’s Annual $1,000 Scholarship will provide financial assistance to the qualified individual whose essay best addresses the topic below.\nThis is a scholarship byRandolph Law FirmRandolph Law Firm helps people avoid foreclosure and get out of credit card and IRS debt legally. Contact us in Las Vegas, Nevada, at 702-570-3211.EligibilityThis scholarship is open to any US citizen or permanent US resident who will be enrolled in fall 2020 in an accredited community college or university (undergraduate or graduate), earning credits toward a degree (associate, baccalaureate, or graduate).\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsOur scholarship recipient will also be asked to submit a current photo to be published in an announcement to recognize this year’s winner on our website.\nApplicationAll applications must be filled out and materials received via the form below by July 15, 2020. Applications submitted via any other channel will not be considered. Applications submitted after this date will not be considered. The decision of the committee is final. The winner will be notified by email or phone by August 2020. Scholarship funds will be disbursed to the college or university by the end of August 2020.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"14":{"tilte":"Bradshaw’s Law LLC Annual Academic Scholarship of 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/bradshaw-s-law-llc-annual-academic-scholarship-of-2020","discription":"HomeScholarshipsBradshaw’s Law LLC Annual Academic Scholarship of 2020Bradshaw’s Law LLC Annual Academic Scholarship of 2020Master, Bachelor$1,00015 July 2020Visit Scholarship WebsiteBradshaw’s Law LLC Annual $1,000 Scholarship will provide financial assistance to the qualified individual whose essay best addresses the topic below.\nThis is a scholarship byBradshaw LawElko personal injury attorney Denise Bradshaw provides legal representation to clients who were injured in car accidents & medical malpractice incidents.EligibilityThis scholarship is open to any US citizen or permanent US resident who will be enrolled in fall 2020 in an accredited community college or university (undergraduate or graduate), earning credits toward a degree (associate, baccalaureate, or graduate).\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsOur scholarship recipient will also be asked to submit a current photo to be published in an announcement to recognize this year’s winner on our website.\nApplicationAll applications must be filled out and materials received via the form below by July 15, 2020. Applications submitted via any other channel will not be considered. Applications submitted after this date will not be considered. The decision of the committee is final. The winner will be notified by email or phone by August 2020. Scholarship funds will be disbursed to the college or university by the end of August 2020.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"},"15":{"tilte":"The Patriot Law Firm’s Annual Academic Scholarship of 2020","link":"https:\/\/www.scholarshipportal.com\/scholarship\/the-patriot-law-firm-s-annual-academic-scholarship-of-2020","discription":"HomeScholarshipsThe Patriot Law Firm’s Annual Academic Scholarship of 2020The Patriot Law Firm’s Annual Academic Scholarship of 2020Master, Bachelor$1,00015 July 2020Visit Scholarship WebsiteThe Patriot Law Firm’s Annual $1,000 Scholarship will provide financial assistance to the qualified individual whose essay best addresses the topic below.\nEligibilityThis scholarship is open to any US citizen or permanent US resident who will be enrolled in fall 2020 in an accredited community college or university (undergraduate or graduate), earning credits toward a degree (associate, baccalaureate, or graduate).\nTOEFL®The TOEFL® test is a popular option for students to meet the English-language requirements for scholarships.Schedule aTOEFL®  test >BenefitsOur scholarship recipient will also be asked to submit a current photo to be published in an announcement to recognize this year’s winner on our website.\nApplicationAll applications must be filled out and materials received via the form below by July 15, 2020. Applications submitted via any other channel will not be considered. Applications submitted after this date will not be considered. The decision of the committee is final. The winner will be notified by email or phone by August 2020. Scholarship funds will be disbursed to the college or university by the end of August 2020.\nApply NowSign Up for Scholarship UpdatesGet an email every week that 10.000's of students use to get the latest scholarships.NameEmailSend me Scholarship Updates"}}